[
  {
    "spoken": "ベルが鳴るが早いか、生徒たちは教室を飛び出した。",
    "expected": "ベルが鳴るが早いか、生徒たちは教室を飛び出した。",
    "reading": "べるがなるがはやいか、せいとたちはきょうしつをとびだした。",
    "english": "As soon as the bell rang, the students rushed out of the classroom.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "彼は「さよなら」を言うが早いか、電話を切った。",
    "expected": "彼は「さよなら」を言うが早いか、電話を切った。",
    "reading": "かれは「さよなら」をいうがはやいか、でんわをきった。",
    "english": "No sooner had he said \"goodbye\" than he hung up the phone.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "雨が止むが早いか、子供たちは外へ遊びに飛び出した。",
    "expected": "雨が止むが早いか、子供たちは外へ遊びに飛び出した。",
    "reading": "あめがやむがはやいか、こどもたちはそとへあそびにとびだした。",
    "english": "As soon as the rain stopped, the children dashed outside to play.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "店が開くが早いか、限定商品を求める客が殺到した。",
    "expected": "店が開くが早いか、限定商品を求める客が殺到した。",
    "reading": "みせがあくがはやいか、げんていしょうひんをもとめるきゃくがさっとうした。",
    "english": "As soon as the store opened, customers seeking limited edition products flooded in.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "彼はドアを開けるや否や、部屋の中に駆け込んだ。",
    "expected": "彼はドアを開けるや否や、部屋の中に駆け込んだ。",
    "reading": "かれはどあをあけるやいなや、へやのなかにかけこんだ。",
    "english": "Hardly had he opened the door when he rushed into the room.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "電車がホームに着くや否や、乗客が一斉に降り始めた。",
    "expected": "電車がホームに着くや否や、乗客が一斉に降り始めた。",
    "reading": "でんしゃがほーむにつくやいなや、じょうきゃくがいっせいにおりはじめた。",
    "english": "The moment the train arrived at the platform, passengers started getting off all at once.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "首相が演説を終えるや、会場は拍手に包まれた。",
    "expected": "首相が演説を終えるや、会場は拍手に包まれた。",
    "reading": "しゅしょうがえんぜつをおえるや、かいじょうははくしゅにつつまれた。",
    "english": "As soon as the Prime Minister finished his speech, the venue erupted in applause.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "合格発表の掲示板を見るや、彼は喜びの声を上げた。",
    "expected": "合格発表の掲示板を見るや、彼は喜びの声を上げた。",
    "reading": "ごうかくはっぴょうのけいじばんをみるや、かれはよろこびのこえをあげた。",
    "english": "The instant he saw the pass list notice board, he let out a cry of joy.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "友人は私を見るなり、駆け寄ってきた。",
    "expected": "友人は私を見るなり、駆け寄ってきた。",
    "reading": "ゆうじんはわたしをみるなり、かけよってきた。",
    "english": "As soon as my friend saw me, they ran up to me.",
    "grammar": "〜なり"
  },
  {
    "spoken": "部長は部屋に入るなり、厳しい口調で話し始めた。",
    "expected": "部長は部屋に入るなり、厳しい口調で話し始めた。",
    "reading": "ぶちょうはへやにはいるなり、きびしいくちょうではなしはじめた。",
    "english": "The department manager entered the room and immediately started speaking in a stern tone.",
    "grammar": "〜なり"
  },
  {
    "spoken": "彼は家に帰るなり、かばんを放り投げてベッドに倒れ込んだ。",
    "expected": "彼は家に帰るなり、かばんを放り投げてベッドに倒れ込んだ。",
    "reading": "かれはいえにかえるなり、かばんをほうりなげてべっどにたおれこんだ。",
    "english": "Upon returning home, he tossed his bag aside and collapsed onto the bed.",
    "grammar": "〜なり"
  },
  {
    "spoken": "その作家はインスピレーションを得るなり、一気に小説を書き上げた。",
    "expected": "その作家はインスピレーションを得るなり、一気に小説を書き上げた。",
    "reading": "そのさっかは いんすぴれーしょんをえるなり、いっきにしょうせつをかきあげた。",
    "english": "As soon as the author got inspiration, they wrote the entire novel in one go.",
    "grammar": "〜なり"
  },
  {
    "spoken": "子供におもちゃを片付けさせるそばから、また散らかしてしまう。",
    "expected": "子供におもちゃを片付けさせるそばから、また散らかしてしまう。",
    "reading": "こどもにおもちゃをかたづけさせるそばから、またちらかしてしまう。",
    "english": "No sooner do I make the child clean up their toys than they mess them up again.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "新しい単語を覚えるそばから忘れていくので、なかなか語彙が増えない。",
    "expected": "新しい単語を覚えるそばから忘れていくので、なかなか語彙が増えない。",
    "reading": "あたらしい たんごをおぼえるそばからわすれていくので、なかなかごいがふえない。",
    "english": "I keep forgetting new words as soon as I learn them, so my vocabulary doesn't increase easily.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "庭の雑草を抜くそばから、次々と生えてくる。",
    "expected": "庭の雑草を抜くそばから、次々と生えてくる。",
    "reading": "にわのざっそうをぬくそばから、つぎつぎとはえてくる。",
    "english": "As soon as I pull out the weeds in the garden, more grow one after another.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "注意するそばから同じ間違いを繰り返すので、指導が難しい。",
    "expected": "注意するそばから同じ間違いを繰り返すので、指導が難しい。",
    "reading": "ちゅういするそばからおなじまちがいをくりかえすので、しどうがむずかしい。",
    "english": "They repeat the same mistake right after I warn them, making guidance difficult.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "新しい部長が就任してからというもの、職場の雰囲気が明るくなった。",
    "expected": "新しい部長が就任してからというもの、職場の雰囲気が明るくなった。",
    "reading": "あたらしいぶちょうがしゅうにんしてからというもの、しょくばのふんいきがあかるくなった。",
    "english": "Ever since the new department manager took office, the workplace atmosphere has brightened up.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "子供が生まれてからというもの、夫婦の生活は一変した。",
    "expected": "子供が生まれてからというもの、夫婦の生活は一変した。",
    "reading": "こどもがうまれてからというもの、ふうふのせいかつはいっぺんした。",
    "english": "Ever since their child was born, the couple's life has completely changed.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "日本に来てからというもの、毎日が新しい発見の連続です。",
    "expected": "日本に来てからというもの、毎日が新しい発見の連続です。",
    "reading": "にほんにきてからというもの、まいにちがあたらしいはっけんのれんぞくです。",
    "english": "Ever since I came to Japan, every day has been a continuous series of new discoveries.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "あの映画を見てからというもの、彼の人生観は大きく変わった。",
    "expected": "あの映画を見てからというもの、彼の人生観は大きく変わった。",
    "reading": "あのえいがをみてからというもの、かれのじんせいかんはおおきくかわった。",
    "english": "Ever since watching that movie, his outlook on life has changed significantly.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "この厳しい経済状況にあって、彼は新しい事業を立ち上げた。",
    "expected": "この厳しい経済状況にあって、彼は新しい事業を立ち上げた。",
    "reading": "このきびしいけいざいじょうきょうにあって、かれはあたらしいじぎょうをたちあげた。",
    "english": "In the midst of these harsh economic conditions, he launched a new business.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "国際的な緊張が高まる中にあって、外交努力が続けられている。",
    "expected": "国際的な緊張が高まる中にあって、外交努力が続けられている。",
    "reading": "こくさいてきなきんちょうがたかまるなかにあって、がいこうどりょくがつづけられている。",
    "english": "Amidst rising international tensions, diplomatic efforts are being continued.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "デジタル時代にあって、手書きの価値が見直されている。",
    "expected": "デジタル時代にあって、手書きの価値が見直されている。",
    "reading": "でじたるじだいにあって、てがきのかちがみなおされている。",
    "english": "In this digital age, the value of handwriting is being reconsidered.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "人材不足という困難な状況にあっても、彼は常に前向きな姿勢を崩さなかった。",
    "expected": "人材不足という困難な状況にあっても、彼は常に前向きな姿勢を崩さなかった。",
    "reading": "じんざいぶそくというこんなんなじょうきょうにあっても、かれはつねにまえむきなしせいをくずさなかった。",
    "english": "Even in the difficult situation of a labor shortage, he always maintained a positive attitude.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "今回の展覧会を皮切りにして、全国各地で巡回展が開催される予定だ。",
    "expected": "今回の展覧会を皮切りにして、全国各地で巡回展が開催される予定だ。",
    "reading": "こんかいのてんらんかいをかわきりにして、ぜんこくかくちでじゅんかいてんがかいさいされるよていだ。",
    "english": "Starting with this exhibition, traveling exhibitions are scheduled to be held in various parts of the country.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "京都での公演を皮切りとして、その劇団はヨーロッパツアーを開始した。",
    "expected": "京都での公演を皮切りとして、その劇団はヨーロッパツアーを開始した。",
    "reading": "きょうとでのこうえんをかわきりとして、そのげきだんはよーろっぱつあーをかいしした。",
    "english": "Beginning with the performance in Kyoto, the theater company started its European tour.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "この法律の制定を皮切りに、環境問題への取り組みが本格化した。",
    "expected": "この法律の制定を皮切りに、環境問題への取り組みが本格化した。",
    "reading": "このほうりつのせいていをかわきりに、かんきょうもんだいへのとりくみがほんかくかした。",
    "english": "Starting with the enactment of this law, efforts to address environmental issues began in earnest.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "彼のエッセイ集の出版を皮切りとして、多くの作家が同様のテーマで執筆し始めた。",
    "expected": "彼のエッセイ集の出版を皮切りとして、多くの作家が同様のテーマで執筆し始めた。",
    "reading": "かれのえっせいしゅうのしゅっぱんをかわきりとして、おおくのさっかがどうようのてーまでしっぴつしはじめた。",
    "english": "Following the publication of his essay collection, many writers began writing on similar themes.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "この博物館は、古代の土器から現代アートに至るまで、幅広い展示品を収蔵している。",
    "expected": "この博物館は、古代の土器から現代アートに至るまで、幅広い展示品を収蔵している。",
    "reading": "このはくぶつかんは、こだいのどきからげんだいあーとにいたるまで、はばひろいてんじひんをしゅうぞうしている。",
    "english": "This museum houses a wide range of exhibits, from ancient pottery all the way to contemporary art.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "彼は服装から言葉遣いに至るまで、完璧な紳士だった。",
    "expected": "彼は服装から言葉遣いに至るまで、完璧な紳士だった。",
    "reading": "かれはふくそうからことばづかいにいたるまで、かんぺきなしんしだった。",
    "english": "He was a perfect gentleman in every respect, from his clothing down to his manner of speaking.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "日常的な買い物から不動産投資に至るまで、彼女は家計をしっかり管理している。",
    "expected": "日常的な買い物から不動産投資に至るまで、彼女は家計をしっかり管理している。",
    "reading": "にちじょうてきなかいものからふどうさんとうしにいたるまで、かのじょはかけいをしっかりかんりしている。",
    "english": "From everyday shopping to real estate investment, she manages her household finances meticulously.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "その研究は、素粒子物理学から宇宙の起源に至るまで、多岐にわたる分野に影響を与えた。",
    "expected": "その研究は、素粒子物理学から宇宙の起源に至るまで、多岐にわたる分野に影響を与えた。",
    "reading": "そのけんきゅうは、そりゅうしぶつりがくからうちゅうのきげんにいたるまで、たきにわたるぶんやにえいきょうをあたえた。",
    "english": "That research influenced diverse fields, ranging from particle physics all the way to the origin of the universe.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "今月を限りに、この雑誌は休刊することになりました。",
    "expected": "今月を限りに、この雑誌は休刊することになりました。",
    "reading": "こんげつをかぎりに、このざっしはきゅうかんすることになりました。",
    "english": "This magazine will cease publication as of the end of this month.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "本日を限りに、このレストランは閉店いたします。長年のご愛顧ありがとうございました。",
    "expected": "本日を限りに、このレストランは閉店いたします。長年のご愛顧ありがとうございました。",
    "reading": "ほんじつをかぎりに、このれすとらんはへいてんいたします。ながねんのごあいこありがとうございました。",
    "english": "This restaurant will close its doors today. Thank you for your loyal patronage over the years.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "定年退職する今日を限りに、彼は教壇を去る。",
    "expected": "定年退職する今日を限りに、彼は教壇を去る。",
    "reading": "ていねんたいしょくするきょうをかぎりに、かれはきょうだんをさる。",
    "english": "Today marks his retirement; he is leaving his teaching position.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "この試合を限りに、彼は現役を引退することを表明した。",
    "expected": "この試合を限りに、彼は現役を引退することを表明した。",
    "reading": "このしあいをかぎりに、かれはげんえきをいんたいすることをひょうめいした。",
    "english": "He announced that he will retire from active competition after this match.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "これをもちまして、本日の会議を終了させていただきます。",
    "expected": "これをもちまして、本日の会議を終了させていただきます。",
    "reading": "これをもちまして、ほんじつのかいぎをしゅうりょうさせていただきます。",
    "english": "With this, I would like to conclude today's meeting.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "最終報告書の提出をもって、このプロジェクトは完了となります。",
    "expected": "最終報告書の提出をもって、このプロジェクトは完了となります。",
    "reading": "さいしゅうほうこくしょのていしゅつをもって、このぷろじぇくとはかんりょうとなります。",
    "english": "Upon submission of the final report, this project will be considered complete.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "３月末日をもって、弊社は現住所から移転いたします。",
    "expected": "３月末日をもって、弊社は現住所から移転いたします。",
    "reading": "さんがつまつじつをもって、へいしゃはげんじゅうしょからいてんいたします。",
    "english": "Our company will relocate from the current address as of the end of March.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "授賞式の終了をもって、今年の映画祭は閉幕となります。",
    "expected": "授賞式の終了をもって、今年の映画祭は閉幕となります。",
    "reading": "じゅしょうしきのしゅうりょうをもって、ことしのえいがさいはへいまくとなります。",
    "english": "This year's film festival will conclude with the end of the awards ceremony.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "この地域の平均気温は、夏でもせいぜい25度といったところだ。",
    "expected": "この地域の平均気温は、夏でもせいぜい25度といったところだ。",
    "reading": "このちいきのへいきんきおんは、なつでもせいぜいにじゅうごどといったところだ。",
    "english": "The average temperature in this region, even in summer, is about 25 degrees Celsius at most.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "会議の参加者は、多くても30人といったところだろう。",
    "expected": "会議の参加者は、多くても30人といったところだろう。",
    "reading": "かいぎのさんかしゃは、おおくてもさんじゅうにんといったところだろう。",
    "english": "The number of participants in the meeting will probably be around 30 at the most.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "あの新人選手の年俸は、まだ500万円といったところらしい。",
    "expected": "あの新人選手の年俸は、まだ500万円といったところらしい。",
    "reading": "あのしんじんせんしゅのねんぽうは、まだごひゃくまんえんといったところらしい。",
    "english": "That rookie player's annual salary seems to be only about 5 million yen.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "この作業が終わるのに、あと1時間といったところでしょうか。",
    "expected": "この作業が終わるのに、あと1時間といったところでしょうか。",
    "reading": "このさぎょうがおわるのに、あといちじかんといったところでしょうか。",
    "english": "It will take about another hour at most to finish this task, I suppose.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "この難役をこなせる俳優は、彼をおいて他にいないだろう。",
    "expected": "この難役をこなせる俳優は、彼をおいて他にいないだろう。",
    "reading": "このなんやくをこなせるはいゆうは、かれをおいてほかにいないだろう。",
    "english": "There is probably no other actor besides him who could handle this difficult role.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "日本の伝統文化の美しさを体現しているのは、京都をおいて考えられない。",
    "expected": "日本の伝統文化の美しさを体現しているのは、京都をおいて考えられない。",
    "reading": "にほんのでんとうぶんかのうつくしさをたいげんしているのは、きょうとをおいてかんがえられない。",
    "english": "When it comes to embodying the beauty of Japanese traditional culture, Kyoto is second to none.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "次期社長にふさわしい人物は、現副社長をおいて他にいない。",
    "expected": "次期社長にふさわしい人物は、現副社長をおいて他にいない。",
    "reading": "じきしゃちょうにふさわしいじんぶつは、げんふくしゃちょうをおいてほかにいない。",
    "english": "There is no one more suitable for the next company president than the current vice president.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "世界平和に貢献できる指導者は、彼女をおいていないと多くの人が信じている。",
    "expected": "世界平和に貢献できる指導者は、彼女をおいていないと多くの人が信じている。",
    "reading": "せかいへいわにこうけんできるしどうしゃは、かのじょをおいていないとおおくのひとがしんじている。",
    "english": "Many people believe that she is the only leader capable of contributing to world peace.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "この繊細な味付けは、熟練した料理人ならではの技だ。",
    "expected": "この繊細な味付けは、熟練した料理人ならではの技だ。",
    "reading": "このせんさいなあじつけは、じゅくれんしたりょうりにんならではのわざだ。",
    "english": "This delicate seasoning is a skill unique to an experienced chef.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "手作りの温かみは、大量生産品にはない、この店ならではの魅力だ。",
    "expected": "手作りの温かみは、大量生産品にはない、この店ならではの魅力だ。",
    "reading": "てづくりのぬくもりは、たいりょうせいさんひんにはない、このみせならではのみりょくだ。",
    "english": "The warmth of handmade goods is a charm unique to this shop, not found in mass-produced items.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "この景色は、山頂まで登った者ならではの特権だ。",
    "expected": "この景色は、山頂まで登った者ならではの特権だ。",
    "reading": "このけしきは、さんちょうまでのぼったものならではのとっけんだ。",
    "english": "This view is a special privilege only for those who have climbed to the summit.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "彼ならではの発想が、このプロジェクトを成功に導いた。",
    "expected": "彼ならではの発想が、このプロジェクトを成功に導いた。",
    "reading": "かれならではのはっそうが、このぷろじぇくとをせいこうにみちびいた。",
    "english": "His unique ideas led this project to success.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "このアニメの人気は国内にとどまらず、海外にも広がっている。",
    "expected": "このアニメの人気は国内にとどまらず、海外にも広がっている。",
    "reading": "このあにめの にんきはこくないにとどまらず、かいがいにもひろがっている。",
    "english": "The popularity of this anime is not limited to Japan, but is spreading overseas as well.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "環境問題の影響は、一地域にとどまらず、地球規模で考えなければならない。",
    "expected": "環境問題の影響は、一地域にとどまらず、地球規模で考えなければならない。",
    "reading": "かんきょうもんだいのえいきょうは、いちちいきにとどまらず、ちきゅうきぼでかんがえなければならない。",
    "english": "The impact of environmental problems is not confined to one region; we must think on a global scale.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "彼の活動は音楽にとどまらず、俳優や社会活動家としても知られている。",
    "expected": "彼の活動は音楽にとどまらず、俳優や社会活動家としても知られている。",
    "reading": "かれのかつどうはおんがくにとどまらず、はいゆうやしゃかいかつどうかとしても しられている。",
    "english": "His activities extend beyond music; he is also known as an actor and social activist.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "この技術は医療分野にとどまらず、様々な産業への応用が期待されている。",
    "expected": "この技術は医療分野にとどまらず、様々な産業への応用が期待されている。",
    "reading": "このぎじゅつはいりょうぶんやにとどまらず、さまざまなさんぎょうへのおうようがきたいされている。",
    "english": "This technology is expected to be applied not only in the medical field but also in various other industries.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "彼は敬語はおろか、日常会話もおぼつかない。",
    "expected": "彼は敬語はおろか、日常会話もおぼつかない。",
    "reading": "かれはけいごはおろか、にちじょうかいわもおぼつかない。",
    "english": "He struggles with everyday conversation, let alone polite language (keigo).",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "病状が悪化し、食事はおろか、水を飲むことさえ困難になった。",
    "expected": "病状が悪化し、食事はおろか、水を飲むことさえ困難になった。",
    "reading": "びょうじょうがあっかし、しょくじはおろか、みずをのむことさえこんなんになった。",
    "english": "His condition worsened, making it difficult even to drink water, let alone eat.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "その会社はボーナスはおろか、毎月の給料さえ遅れがちだ。",
    "expected": "その会社はボーナスはおろか、毎月の給料さえ遅れがちだ。",
    "reading": "そのかいしゃはぼーなすはおろか、まいつきのきゅうりょうさえおくれがちだ。",
    "english": "That company often delays monthly salaries, let alone bonuses.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "忙しくて、旅行はおろか、近所の散歩をする時間もない。",
    "expected": "忙しくて、旅行はおろか、近所の散歩をする時間もない。",
    "reading": "いそがしくて、りょこうはおろか、きんじょのさんぽをするじかんもない。",
    "english": "I'm so busy I don't even have time for a walk in the neighborhood, let alone travel.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "このレストランは料理の味もさることながら、店内の雰囲気が素晴らしい。",
    "expected": "このレストランは料理の味もさることながら、店内の雰囲気が素晴らしい。",
    "reading": "このれすとらんはりょうりのあじもさることながら、てんないのふんいきがすばらしい。",
    "english": "While the food at this restaurant is certainly delicious, the atmosphere inside is also wonderful.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "彼女は成績優秀なこともさることながら、その人柄で多くの人に慕われている。",
    "expected": "彼女は成績優秀なこともさることながら、その人柄で多くの人に慕われている。",
    "reading": "かのじょはせいせきゆうしゅうなこともさることながら、そのひとがらでおおくのひとにしたわれている。",
    "english": "Not only does she have excellent grades, but she is also admired by many for her personality.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "デザインもさることながら、この製品は機能性の高さが評価されている。",
    "expected": "デザインもさることながら、この製品は機能性の高さが評価されている。",
    "reading": "でざいんもさることながら、このせいひんはきのうせいのたかさがひょうかされている。",
    "english": "While the design is noteworthy, this product is highly praised for its functionality.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "親の経済力もさることながら、本人の努力が合格につながった。",
    "expected": "親の経済力もさることながら、本人の努力が合格につながった。",
    "reading": "おやのけいざいりょくもさることながら、ほんにんのどりょくがごうかくにつながった。",
    "english": "While the parents' financial resources were a factor, the individual's own effort led to their success in passing.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "分からないことがあれば、先生に聞くなり、自分で調べるなりしてください。",
    "expected": "分からないことがあれば、先生に聞くなり、自分で調べるなりしてください。",
    "reading": "わからないことがあれば、せんせいにきくなり、じぶんでしらべるなりしてください。",
    "english": "If there's something you don't understand, please either ask the teacher or look it up yourself.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "気分転換に、散歩するなり音楽を聴くなりしたらどうですか。",
    "expected": "気分転換に、散歩するなり音楽を聴くなりしたらどうですか。",
    "reading": "きぶんてんかんに、さんぽするなりおんがくをきくなりしたらどうですか。",
    "english": "For a change of pace, how about going for a walk or listening to music?",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "この書類は、メールで送るなり、直接手渡すなりして、明日中に提出してください。",
    "expected": "この書類は、メールで送るなり、直接手渡すなりして、明日中に提出してください。",
    "reading": "このしょるいは、めーるでおくるなり、ちょくせつてわたすなりして、あしたじゅうにていしゅつしてください。",
    "english": "Please submit this document by tomorrow, either by sending it via email or handing it over directly.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "週末は家でゆっくりするなり、友達と出かけるなり、自由に過ごしたい。",
    "expected": "週末は家でゆっくりするなり、友達と出かけるなり、自由に過ごしたい。",
    "reading": "しゅうまつはいえでゆっくりするなり、ともだちとでかけるなり、じゆうにすごしたい。",
    "english": "On the weekend, I want to spend my time freely, whether it's relaxing at home or going out with friends.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "理由が何であれ、約束を破ることは許されない。",
    "expected": "理由が何であれ、約束を破ることは許されない。",
    "reading": "りゆうがなんであれ、やくそくをやぶることはゆるされない。",
    "english": "Whatever the reason may be, breaking a promise is unacceptable.",
    "grammar": "〜であれ…であれ。〜であろうと…であろうと。"
  },
  {
    "spoken": "プロであろうとアマチュアであろうと、スポーツマンシップは守るべきだ。",
    "expected": "プロであろうとアマチュアであろうと、スポーツマンシップは守るべきだ。",
    "reading": "ぷろであろうとあまちゅあであろうと、すぽーつまんしっぷはまもるべきだ。",
    "english": "Whether professional or amateur, sportsmanship should be upheld.",
    "grammar": "〜であれ…であれ。〜であろうと…であろうと。"
  },
  {
    "spoken": "晴天であれ雨天であれ、イベントは予定通り開催されます。",
    "expected": "晴天であれ雨天であれ、イベントは予定通り開催されます。",
    "reading": "せいてんであれうてんであれ、いべんとはよていどおりかいさいされます。",
    "english": "Regardless of whether it's sunny or rainy, the event will be held as scheduled.",
    "grammar": "〜であれ…であれ。〜であろうと…であろうと。"
  },
  {
    "spoken": "大人であれ子供であれ、公共の場でのマナーは守る必要がある。",
    "expected": "大人であれ子供であれ、公共の場でのマナーは守る必要がある。",
    "reading": "おとナであれこどもであれ、こうきょうのばでのまなーはまもるひつようがある。",
    "english": "Whether adult or child, it is necessary to observe manners in public places.",
    "grammar": "〜であれ…であれ。〜であろうと…であろうと。"
  },
  {
    "spoken": "この庭園は、石の配置といい、木の剪定といい、実に見事だ。",
    "expected": "この庭園は、石の配置といい、木の剪定といい、実に見事だ。",
    "reading": "このていえんは、いしのはいちといい、きのせんていといい、じつにみごとだ。",
    "english": "This garden is truly magnificent, from the arrangement of the stones to the pruning of the trees.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "彼の描く絵は、色彩といい、構図といい、独創性に溢れている。",
    "expected": "彼の描く絵は、色彩といい、構図といい、独創性に溢れている。",
    "reading": "かれのえがくえは、しきさいといい、こうずといい、どくそうせいにあふれている。",
    "english": "The pictures he draws, both in color and composition, are full of originality.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "このホテルは、部屋の清潔さといい、従業員の対応といい、申し分ない。",
    "expected": "このホテルは、部屋の清潔さといい、従業員の対応といい、申し分ない。",
    "reading": "このほてるは、へやのせいけつさといい、じゅうぎょういんのたいおうといい、もうしぶんない。",
    "english": "This hotel is impeccable, both in the cleanliness of the rooms and the service of the staff.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "あの兄弟は、顔といい、声といい、そっくりだ。",
    "expected": "あの兄弟は、顔といい、声といい、そっくりだ。",
    "reading": "あのきょうだいは、かおといい、こえといい、そっくりだ。",
    "english": "Those brothers look and sound exactly alike.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "彼は平日といわず週末といわず、いつも研究に没頭している。",
    "expected": "彼は平日といわず週末といわず、いつも研究に没頭している。",
    "reading": "かれはへいじつといわずしゅうまつといわず、いつもけんきゅうにぼっとうしている。",
    "english": "He is always absorbed in his research, weekdays and weekends alike.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "そのアイドルは、テレビといわず雑誌といわず、見ない日はないほどの人気だ。",
    "expected": "そのアイドルは、テレビといわず雑誌といわず、見ない日はないほどの人気だ。",
    "reading": "そのあいどるは、てれびといわずざっしといわず、みないひはないほどのにんきだ。",
    "english": "That idol is so popular you see them everywhere, on TV, in magazines, every single day.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "壁といわず床といわず、子供の落書きだらけだ。",
    "expected": "壁といわず床といわず、子供の落書きだらけだ。",
    "reading": "かべといわずゆかといわず、こどものらくがきだらけだ。",
    "english": "There's children's graffiti everywhere, on the walls, on the floor, you name it.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "手といわず足といわず、彼は泥まみれになって畑仕事をしていた。",
    "expected": "手といわず足といわず、彼は泥まみれになって畑仕事をしていた。",
    "reading": "てといわずあしといわず、かれはどろまみれになってはたけしごとをしていた。",
    "english": "He was covered in mud from head to toe (lit. hands and feet) doing farm work.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "明日の試合の結果いかんで、決勝トーナメントに進めるかどうかが決まる。",
    "expected": "明日の試合の結果いかんで、決勝トーナメントに進めるかどうかが決まる。",
    "reading": "あしたのしあいのけっかいかんで、けっしょうとーなめんと にすすめ るかどうかがきまる。",
    "english": "Whether we advance to the final tournament depends on the outcome of tomorrow's match.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "検査の結果いかんでは、手術が必要になるかもしれない。",
    "expected": "検査の結果いかんでは、手術が必要になるかもしれない。",
    "reading": "けんさのけっかいかんでは、しゅじゅつがひつよう になるかもしれない。",
    "english": "Depending on the test results, surgery might be necessary.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "交渉次第いかんでは、もっと有利な条件を引き出せる可能性がある。",
    "expected": "交渉次第いかんでは、もっと有利な条件を引き出せる可能性がある。",
    "reading": "こうしょうしだいいかんでは、もっとゆうりなじょうけんをひきだせるかのうせいがある。",
    "english": "Depending on the negotiations, there's a possibility we can secure more favorable terms.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "今後の業績いかんで、ボーナスの額が決まる。",
    "expected": "今後の業績いかんで、ボーナスの額が決まる。",
    "reading": "こんごのぎょうせきいかんで、ぼーなすのがくがきまる。",
    "english": "The amount of the bonus will be determined by future business performance.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "理由のいかんにかかわらず、締め切りは厳守してください。",
    "expected": "理由のいかんにかかわらず、締め切りは厳守してください。",
    "reading": "りゆうのいかんにかかわらず、しめきりはげんしゅしてください。",
    "english": "Regardless of the reason, please strictly observe the deadline.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "国籍のいかんによらず、応募資格を満たすすべての人が採用試験を受けられます。",
    "expected": "国籍のいかんによらず、応募資格を満たすすべての人が採用試験を受けられます。",
    "reading": "こくせきのいかんによらず、おうぼしかくをみたすすべてのひとがさいようしけんをうけられます。",
    "english": "Regardless of nationality, anyone who meets the application requirements can take the employment exam.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "天候のいかんをとわず、明日のハイキングは決行します。",
    "expected": "天候のいかんをとわず、明日のハイキングは決行します。",
    "reading": "てんこうのいかんをとわず、あしたのはいきんぐはけっこうします。",
    "english": "Regardless of the weather, tomorrow's hike will proceed as planned.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "支持政党のいかんにかかわらず、選挙には行くべきだ。",
    "expected": "支持政党のいかんにかかわらず、選挙には行くべきだ。",
    "reading": "しじせいとうのいかんにかかわらず、せんきょにはいくべきだ。",
    "english": "Regardless of which political party one supports, one should go vote in the election.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "彼は足の怪我をものともせずに、マラソンを完走した。",
    "expected": "彼は足の怪我をものともせずに、マラソンを完走した。",
    "reading": "かれはあしのけがをものともせずに、まらそんをかんそうした。",
    "english": "He completed the marathon, making nothing of his leg injury.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "その登山家は、厳しい自然条件をものともせず、前人未到の山頂を目指した。",
    "expected": "その登山家は、厳しい自然条件をものともせず、前人未到の山頂を目指した。",
    "reading": "そのとざんかは、きびしいしぜんじょうけんをものともせず、ぜんじんみとうのさんちょうをめざした。",
    "english": "That mountaineer aimed for the unclimbed summit, undeterred by the harsh natural conditions.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "周囲の反対をものともせずに、彼女は自分の夢を追い続けた。",
    "expected": "周囲の反対をものともせずに、彼女は自分の夢を追い続けた。",
    "reading": "しゅういのはんたいをものともせずに、かのじょはじぶんのゆめをおいつづけた。",
    "english": "Ignoring the opposition from those around her, she continued to pursue her dream.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "高齢をものともせずに、彼は新しい技術を学び続けている。",
    "expected": "高齢をものともせずに、彼は新しい技術を学び続けている。",
    "reading": "こうれいをものともせずに、かれはあたらしいぎじゅつをまなびつづけている。",
    "english": "Undaunted by his advanced age, he continues to learn new technologies.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "親の心配をよそに、子供は危険な遊びをやめようとしない。",
    "expected": "親の心配をよそに、子供は危険な遊びをやめようとしない。",
    "reading": "おやのしんぱいをよそに、こどもはきけんなあそびをやめようとしない。",
    "english": "Ignoring their parents' worries, the child refuses to stop playing dangerously.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "住民の抗議をよそに、ダムの建設計画が進められている。",
    "expected": "住民の抗議をよそに、ダムの建設計画が進められている。",
    "reading": "じゅうみんのこうぎをよそに、だむのけんせつけいかくがすすめられている。",
    "english": "Disregarding the residents' protests, the dam construction project is moving forward.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "深刻な不況をよそに、一部の高級ブランドは売上を伸ばしている。",
    "expected": "深刻な不況をよそに、一部の高級ブランドは売上を伸ばしている。",
    "reading": "しんこくなふきょうをよそに、いちぶのこうきゅうぶらんどはうりあげをのばしている。",
    "english": "Despite the serious recession, some luxury brands are increasing their sales.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "教室の騒がしさをよそに、彼は一人静かに読書をしていた。",
    "expected": "教室の騒がしさをよそに、彼は一人静かに読書をしていた。",
    "reading": "きょうしつのさわがしさをよそに、かれはひとりしずかんどくしょをしていた。",
    "english": "Ignoring the noisiness of the classroom, he was reading quietly by himself.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "子供ならいざしらず、大人がそんな言い訳をするのは見苦しい。",
    "expected": "子供ならいざしらず、大人がそんな言い訳をするのは見苦しい。",
    "reading": "こどもならいざしらず、おとナがそんないいわけをするのはみぐるしい。",
    "english": "It might be understandable if it were a child, but it's unbecoming for an adult to make such excuses.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "１０年前ならいざしらず、今どきその考え方は古い。",
    "expected": "１０年前ならいざしらず、今どきその考え方は古い。",
    "reading": "じゅうねんまえならいざしらず、いまどきそのかんがえかたはふるい。",
    "english": "Maybe ten years ago, but that way of thinking is outdated nowadays.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "専門家ならいざしらず、素人にこの修理は無理だろう。",
    "expected": "専門家ならいざしらず、素人にこの修理は無理だろう。",
    "reading": "せんもんかならいざしらず、しろうとにこのしゅうりはむりだろう。",
    "english": "Perhaps an expert could do it, but this repair is likely impossible for an amateur.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "夏休みならいざしらず、学期中に海外旅行に行くなんて考えられない。",
    "expected": "夏休みならいざしらず、学期中に海外旅行に行くなんて考えられない。",
    "reading": "なつやすみならいざしらず、がっきちゅうにかいがいりょこうにいくなんてかんがえられない。",
    "english": "During summer vacation might be one thing, but going on an overseas trip during the school term is unthinkable.",
    "grammar": "〜ならいざしらず"
  }
]