[
  {
    "spoken": "その知らせを受け取るが早いか、彼は家を飛び出した。",
    "expected": "その知らせを受け取るが早いか、彼は家を飛び出した。",
    "reading": "そのしらせをうけとるがはやいか、かれはいえをとびだした。",
    "english": "As soon as he received the news, he rushed out of the house.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "飛行機が着陸するが早いか、乗客たちは席を立った。",
    "expected": "飛行機が着陸するが早いか、乗客たちは席を立った。",
    "reading": "ひこうきがちゃくりくするがはやいか、じょうきゃくたちはせきをたった。",
    "english": "No sooner had the plane landed than the passengers stood up.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "雷鳴が轟くが早いか、子供は母親にしがみついた。",
    "expected": "雷鳴が轟くが早いか、子供は母親にしがみついた。",
    "reading": "らいめいがとどろくがはやいか、こどもはははおやにしがみついた。",
    "english": "The moment the thunder roared, the child clung to their mother.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "スタートの合図が鳴るが早いか、選手たちは一斉に走り出した。",
    "expected": "スタートの合図が鳴るが早いか、選手たちは一斉に走り出した。",
    "reading": "すたーとのあいずがなるがはやいか、せんしゅたちはいっせいにはしりだした。",
    "english": "As soon as the starting signal sounded, the athletes all started running at once.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "ドアが開くが早いか、冷たい風が部屋に吹き込んできた。",
    "expected": "ドアが開くが早いか、冷たい風が部屋に吹き込んできた。",
    "reading": "どあがあくがはやいか、つめたいかぜがへやにふきこんできた。",
    "english": "The instant the door opened, a cold wind blew into the room.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "発表が終わるが早いか、会場は拍手に包まれた。",
    "expected": "発表が終わるが早いか、会場は拍手に包まれた。",
    "reading": "はっぴょうがおわるがはやいか、かいじょうははくしゅにつつまれた。",
    "english": "Hardly had the presentation finished when the venue was filled with applause.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "店が開店するが早いか、限定品を求める客が殺到した。",
    "expected": "店が開店するが早いか、限定品を求める客が殺到した。",
    "reading": "みせがかいてんするがはやいか、げんていひんをもとめるきゃくがさっとうした。",
    "english": "As soon as the store opened, customers seeking limited edition items rushed in.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "首相が演説を始めるが早いか、記者たちは一斉にメモを取り始めた。",
    "expected": "首相が演説を始めるが早いか、記者たちは一斉にメモを取り始めた。",
    "reading": "しゅしょうがえんぜつをはじめるがはやいか、きしゃたちはいっせいにめもをとりはじめた。",
    "english": "No sooner did the Prime Minister begin the speech than the reporters started taking notes all at once.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "携帯が鳴るが早いか、彼は重要な電話だと察した。",
    "expected": "携帯が鳴るが早いか、彼は重要な電話だと察した。",
    "reading": "けいたいがなるがはやいか、かれはじゅうようなでんわだとさっした。",
    "english": "The moment his mobile phone rang, he sensed it was an important call.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "終業のベルが鳴るが早いか、社員たちは我先にと退社した。",
    "expected": "終業のベルが鳴るが早いか、社員たちは我先にと退社した。",
    "reading": "しゅうぎょうのべるがなるがはやいか、しゃいんたちはわれさきにとたいしゃした。",
    "english": "As soon as the closing bell rang, the employees rushed to leave the office, competing to be first.",
    "grammar": "〜が早いか"
  },
  {
    "spoken": "彼はベッドに横になるや否や、深い眠りに落ちた。",
    "expected": "彼はベッドに横になるや否や、深い眠りに落ちた。",
    "reading": "かれはべっどによこになるやいなや、ふかいねむりにおちた。",
    "english": "Hardly had he lain down on the bed when he fell fast asleep.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "議長が発言を終えるや、会場から質問が相次いだ。",
    "expected": "議長が発言を終えるや、会場から質問が相次いだ。",
    "reading": "ぎちょうがはつげんをおえるや、かいじょうからしつもんがあいついだ。",
    "english": "The moment the chairman finished speaking, questions poured in from the audience.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "その俳優が舞台に登場するや否や、観客は総立ちとなった。",
    "expected": "その俳優が舞台に登場するや否や、観客は総立ちとなった。",
    "reading": "そのはいゆうがぶたいにとうじょうするやいなや、かんきゃくはそうだちとなった。",
    "english": "As soon as that actor appeared on stage, the audience gave a standing ovation.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "電車が駅に到着するや、乗客たちはドアの前に押し寄せた。",
    "expected": "電車が駅に到着するや、乗客たちはドアの前に押し寄せた。",
    "reading": "でんしゃがえきにとうちゃくするや、じょうきゃくたちはどあのまえにおしよせた。",
    "english": "The instant the train arrived at the station, passengers crowded in front of the doors.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "犯人はパトカーのサイレンを聞くや否や、路地裏へ逃げ込んだ。",
    "expected": "犯人はパトカーのサイレンを聞くや否や、路地裏へ逃げ込んだ。",
    "reading": "はんにんはぱとかーのさいれんをきくやいなや、ろじうらへにげこんだ。",
    "english": "The moment the criminal heard the police car siren, they fled into the back alley.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "雲が太陽を覆うや、辺りは急に薄暗くなった。",
    "expected": "雲が太陽を覆うや、辺りは急に薄暗くなった。",
    "reading": "くもがたいようをおおうや、あたりはきゅうにうすぐらくなった。",
    "english": "As soon as the clouds covered the sun, the surroundings suddenly became dim.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "彼はその衝撃的なニュースを目にするや、言葉を失った。",
    "expected": "彼はその衝撃的なニュースを目にするや、言葉を失った。",
    "reading": "かれはそのしょうげきてきなにゅーすをめにするや、ことばをうしなった。",
    "english": "The moment he saw the shocking news, he was lost for words.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "試験終了の合図があるや否や、受験生たちは一斉にペンを置いた。",
    "expected": "試験終了の合図があるや否や、受験生たちは一斉にペンを置いた。",
    "reading": "しけんしゅうりょうのあいずがあるやいなや、じゅけんせいたちはいっせいにぺんをおいた。",
    "english": "Hardly had the signal for the end of the exam been given when the examinees all put down their pens at once.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "その歌手が新曲を発表するや、瞬く間にチャート一位になった。",
    "expected": "その歌手が新曲を発表するや、瞬く間にチャート一位になった。",
    "reading": "そのかしゅがしんきょくをはっぴょうするや、またたくまにちゃーといちいになった。",
    "english": "No sooner did the singer release their new song than it instantly topped the charts.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "火災報知器が作動するや否や、人々は避難を開始した。",
    "expected": "火災報知器が作動するや否や、人々は避難を開始した。",
    "reading": "かさいほうちきがさどうするやいなや、ひとびとはひなんをかいしした。",
    "english": "The moment the fire alarm went off, people started evacuating.",
    "grammar": "〜や、〜や否や"
  },
  {
    "spoken": "夫は帰宅するなり、スーツも脱がずにソファに倒れ込んだ。",
    "expected": "夫は帰宅するなり、スーツも脱がずにソファに倒れ込んだ。",
    "reading": "おっとはきたくするなり、すーつもぬがずにそふぁにたおれこんだ。",
    "english": "As soon as my husband got home, he collapsed onto the sofa without even taking off his suit.",
    "grammar": "〜なり"
  },
  {
    "spoken": "彼女は怒った顔を見るなり、わっと泣き出した。",
    "expected": "彼女は怒った顔を見るなり、わっと泣き出した。",
    "reading": "かのじょはいかったかおをみるなり、わっとなきだした。",
    "english": "The moment she saw the angry face, she burst into tears.",
    "grammar": "〜なり"
  },
  {
    "spoken": "弟は部屋に入るなり、ゲームを始めた。",
    "expected": "弟は部屋に入るなり、ゲームを始めた。",
    "reading": "おとうとはへやにはいるなり、げーむをはじめた。",
    "english": "As soon as my younger brother entered the room, he started playing video games.",
    "grammar": "〜なり"
  },
  {
    "spoken": "彼は電話を切るなり、大きなため息をついた。",
    "expected": "彼は電話を切るなり、大きなため息をついた。",
    "reading": "かれはでんわをきるなり、おおきなためいきをついた。",
    "english": "Immediately after hanging up the phone, he let out a big sigh.",
    "grammar": "〜なり"
  },
  {
    "spoken": "子供は母親の姿を見つけるなり、駆け寄っていった。",
    "expected": "子供は母親の姿を見つけるなり、駆け寄っていった。",
    "reading": "こどもはははおやのすがたをみつけるなり、かけよっていった。",
    "english": "As soon as the child spotted their mother, they ran up to her.",
    "grammar": "〜なり"
  },
  {
    "spoken": "その政治家は失言するなり、すぐさま謝罪会見を開いた。",
    "expected": "その政治家は失言するなり、すぐさま謝罪会見を開いた。",
    "reading": "そのせいじかはしつげんするなり、すぐさましゃざいかいけんをひらいた。",
    "english": "Immediately after making the gaffe, the politician held an apology press conference.",
    "grammar": "〜なり"
  },
  {
    "spoken": "空が暗くなるなり、激しい雨が降り始めた。",
    "expected": "空が暗くなるなり、激しい雨が降り始めた。",
    "reading": "そらがくらくなるなり、はげしいあめがふりはじめた。",
    "english": "As soon as the sky darkened, heavy rain started to fall.",
    "grammar": "〜なり"
  },
  {
    "spoken": "観客はその見事な演技を見るなり、惜しみない拍手を送った。",
    "expected": "観客はその見事な演技を見るなり、惜しみない拍手を送った。",
    "reading": "かんきゃくはそのみごとなえんぎをみるなり、おしみないはくしゅをおくった。",
    "english": "The moment the audience saw the splendid performance, they gave generous applause.",
    "grammar": "〜なり"
  },
  {
    "spoken": "彼はコーヒーを飲むなり、「熱っ！」と叫んだ。",
    "expected": "彼はコーヒーを飲むなり、「熱っ！」と叫んだ。",
    "reading": "かれはこーひーをのむなり、「あつっ！」とさけんだ。",
    "english": "As soon as he drank the coffee, he yelled, \"Hot!\"",
    "grammar": "〜なり"
  },
  {
    "spoken": "部長は席に着くなり、今日のスケジュールを確認し始めた。",
    "expected": "部長は席に着くなり、今日のスケジュールを確認し始めた。",
    "reading": "ぶちょうはせきにつくなり、きょうのすけじゅーるをかくにんしはじめた。",
    "english": "Immediately upon reaching his seat, the department manager started checking today's schedule.",
    "grammar": "〜なり"
  },
  {
    "spoken": "新しい単語を覚えるそばから、忘れていってしまう。",
    "expected": "新しい単語を覚えるそばから、忘れていってしまう。",
    "reading": "あたらしいことばをおぼえるそばから、わすれていってしまう。",
    "english": "No sooner do I learn new words than I forget them.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "子供がおもちゃを片付けるそばから、また散らかす。",
    "expected": "子供がおもちゃを片付けるそばから、また散らかす。",
    "reading": "こどもがおもちゃをかたづけるそばから、またちらかす。",
    "english": "As soon as the child puts the toys away, they mess them up again.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "メモを取るそばから、どこに置いたか分からなくなる。",
    "expected": "メモを取るそばから、どこに置いたか分からなくなる。",
    "reading": "めもをとるそばから、どこにおいたかわからなくなる。",
    "english": "Right after I take notes, I lose track of where I put them.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "庭の雑草を抜くそばから、新しい芽が出てくる。",
    "expected": "庭の雑草を抜くそばから、新しい芽が出てくる。",
    "reading": "にわのざっそうをぬくそばから、あたらしいめがでてくる。",
    "english": "No sooner do I pull the weeds in the garden than new sprouts appear.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "給料が入るそばから、支払いで消えていく。",
    "expected": "給料が入るそばから、支払いで消えていく。",
    "reading": "きゅうりょうがはいるそばから、しはらいできえていく。",
    "english": "As soon as I get paid, the money disappears on bills.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "洗濯物を干すそばから、雨が降り出すなんて運が悪い。",
    "expected": "洗濯物を干すそばから、雨が降り出すなんて運が悪い。",
    "reading": "せんたくものをほすそばから、あめがふりだすなんてうんがわるい。",
    "english": "It's bad luck that it starts raining right after I hang out the laundry.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "欠点を指摘するそばから、彼は言い訳を始める。",
    "expected": "欠点を指摘するそばから、彼は言い訳を始める。",
    "reading": "けってんをしてきするそばから、かれはいいわけをはじめる。",
    "english": "No sooner do I point out his flaws than he starts making excuses.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "作った料理が、食卓に出すそばからなくなっていく。",
    "expected": "作った料理が、食卓に出すそばからなくなっていく。",
    "reading": "つくったりょうりが、しょくたくにだすそばからなくなっていく。",
    "english": "The food I cooked disappears as soon as I put it on the table.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "問題を解決するそばから、新たな問題が発生する。",
    "expected": "問題を解決するそばから、新たな問題が発生する。",
    "reading": "もんだいをかいけつするそばから、あらたなもんだいがはっせいする。",
    "english": "Just as we solve one problem, a new one arises.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "窓をきれいに拭くそばから、子供が手で触って汚してしまう。",
    "expected": "窓をきれいに拭くそばから、子供が手で触って汚してしまう。",
    "reading": "まどをきれいにふくそばから、こどもがてでさわってよごしてしまう。",
    "english": "No sooner do I clean the window than the child touches it with their hands and makes it dirty again.",
    "grammar": "〜そばから"
  },
  {
    "spoken": "一人暮らしを始めてからというもの、自炊の腕が上がった。",
    "expected": "一人暮らしを始めてからというもの、自炊の腕が上がった。",
    "reading": "ひとりぐらしをはじめてからというもの、じすいのうでがあがった。",
    "english": "Ever since I started living alone, my cooking skills have improved.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "父が退職してからというもの、毎日趣味の釣りを楽しんでいる。",
    "expected": "父が退職してからというもの、毎日趣味の釣りを楽しんでいる。",
    "reading": "ちちがたいしょくしてからというもの、まいにちしゅみのつりをたのしんでいる。",
    "english": "Ever since my father retired, he has been enjoying his hobby of fishing every day.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "新しいシステムを導入してからというもの、業務効率が格段に向上した。",
    "expected": "新しいシステムを導入してからというもの、業務効率が格段に向上した。",
    "reading": "あたらしいしすてむをどうにゅうしてからというもの、ぎょうむこうりつがかくだんにこうじょうした。",
    "english": "Ever since we implemented the new system, operational efficiency has improved dramatically.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "あの映画を見てからというもの、人生観が変わった気がする。",
    "expected": "あの映画を見てからというもの、人生観が変わった気がする。",
    "reading": "あのえいがをみてからというもの、じんせいかんがかわったきがする。",
    "english": "Ever since I watched that movie, I feel like my outlook on life has changed.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "子供が生まれてからというもの、生活は一変した。",
    "expected": "子供が生まれてからというもの、生活は一変した。",
    "reading": "こどもがうまれてからというもの、せいかつはいっぺんした。",
    "english": "Ever since the child was born, our lives have completely changed.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "彼女と出会ってからというもの、毎日が楽しくて仕方がない。",
    "expected": "彼女と出会ってからというもの、毎日が楽しくて仕方がない。",
    "reading": "かのじょとであってからというもの、まいにちがたのしくてしかたがない。",
    "english": "Ever since I met her, every day has been incredibly fun.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "健康診断で注意されてからというもの、食生活に気をつけるようになった。",
    "expected": "健康診断で注意されてからというもの、食生活に気をつけるようになった。",
    "reading": "けんこうしんだんでちゅういされてからというもの、しょくせいかつにきをつけるようになった。",
    "english": "Ever since I was warned during my health checkup, I've started paying attention to my diet.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "日本に来てからというもの、日本語の勉強を一日も欠かしたことがない。",
    "expected": "日本に来てからというもの、日本語の勉強を一日も欠かしたことがない。",
    "reading": "にほんにきてからというもの、にほんごのべんきょうをいちにちもかかしたことがない。",
    "english": "Ever since coming to Japan, I haven't missed a single day of studying Japanese.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "あの失敗をしてからというもの、彼は以前より慎重になった。",
    "expected": "あの失敗をしてからというもの、彼は以前より慎重になった。",
    "reading": "あのしっぱいをしてからというもの、かれはいぜんよりしんちょうになった。",
    "english": "Ever since making that mistake, he has become more cautious than before.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "引っ越してからというもの、近所付き合いも増え、地域に馴染んできた。",
    "expected": "引っ越してからというもの、近所付き合いも増え、地域に馴染んできた。",
    "reading": "ひっこしてからというもの、きんじょづきあいもふえ、ちいきになじんできた。",
    "english": "Ever since I moved, interactions with neighbors have increased, and I've become accustomed to the area.",
    "grammar": "〜てからというもの（は）"
  },
  {
    "spoken": "この非常事態にあって、冷静な判断が求められる。",
    "expected": "この非常事態にあって、冷静な判断が求められる。",
    "reading": "このひじょうじたいにあって、れいせいなはんだんがもとめられる。",
    "english": "In this state of emergency, calm judgment is required.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "グローバル化が進む現代にあって、異文化理解は不可欠だ。",
    "expected": "グローバル化が進む現代にあって、異文化理解は不可欠だ。",
    "reading": "ぐろーばるかがすすむげんだいにあって、いぶんかりかいはふかけつだ。",
    "english": "In today's world of advancing globalization, cross-cultural understanding is essential.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "彼は経営者という立場にあって、常に会社の将来を考えている。",
    "expected": "彼は経営者という立場にあって、常に会社の将来を考えている。",
    "reading": "かれはけいえいしゃというたちばにあって、つねにかいしゃのしょうらいをかんがえている。",
    "english": "Being in the position of a manager, he is always thinking about the company's future.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "この困難な状況にあっても、希望を失わずに前進したい。",
    "expected": "この困難な状況にあっても、希望を失わずに前進したい。",
    "reading": "このこんなんなじょうきょうにあっても、きぼうをうしなわずにぜんしんしたい。",
    "english": "Even in these difficult circumstances, I want to move forward without losing hope.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "少子高齢化社会にあって、労働力不足は深刻な問題だ。",
    "expected": "少子高齢化社会にあって、労働力不足は深刻な問題だ。",
    "reading": "しょうしこうれいかしゃかいにあって、ろうどうりょくぶそくはしんこくなもんだいだ。",
    "english": "In a society with a declining birthrate and aging population, the labor shortage is a serious problem.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "学生という身分にあって、学業を最優先すべきだ。",
    "expected": "学生という身分にあって、学業を最優先すべきだ。",
    "reading": "がくせいというみぶんにあって、がくぎょうをさいゆうせんすべきだ。",
    "english": "Being a student, one should prioritize their studies above all else.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "デジタル時代にあって、情報リテラシーの重要性は増すばかりだ。",
    "expected": "デジタル時代にあって、情報リテラシーの重要性は増すばかりだ。",
    "reading": "でじたるじだいにあって、じょうほうりてらしーのじゅうようせいはますばかりだ。",
    "english": "In the digital age, the importance of information literacy is only increasing.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "逆境にあってこそ、その人の真価が問われる。",
    "expected": "逆境にあってこそ、その人の真価が問われる。",
    "reading": "ぎゃっきょうにあってこそ、そのひとのしんかがとわれる。",
    "english": "It is precisely in adversity that a person's true worth is tested.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "いかなる状況にあっても、人としての尊厳は守られなければならない。",
    "expected": "いかなる状況にあっても、人としての尊厳は守られなければならない。",
    "reading": "いかなるじょうきょうにあっても、ひととしてのそんげんはまもられなければならない。",
    "english": "Human dignity must be protected under any circumstances.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "国際社会の一員たる日本にあって、平和への貢献が期待されている。",
    "expected": "国際社会の一員たる日本にあって、平和への貢献が期待されている。",
    "reading": "こくさいしゃかいのいちいんたるにほんにあって、へいわへのこうけんがきたいされている。",
    "english": "As a member of the international community, Japan is expected to contribute to peace.",
    "grammar": "〜にあって"
  },
  {
    "spoken": "その歌手は東京公演を皮切りに、全国ツアーを開始した。",
    "expected": "その歌手は東京公演を皮切りに、全国ツアーを開始した。",
    "reading": "そのかしゅはとうきょうこうえんをかわきりに、ぜんこくつあーをかいしした。",
    "english": "Starting with the Tokyo performance, the singer began a nationwide tour.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "わが社はアジア市場を皮切りとして、本格的な海外展開に乗り出す。",
    "expected": "わが社はアジア市場を皮切りとして、本格的な海外展開に乗り出す。",
    "reading": "わがしゃはあじあしじょうをかわきりとして、ほんかくてきなかいがいてんかいにのりだす。",
    "english": "Starting with the Asian market, our company will embark on full-scale overseas expansion.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "作家は初の歴史小説を皮切りに、次々と話題作を発表している。",
    "expected": "作家は初の歴史小説を皮切りに、次々と話題作を発表している。",
    "reading": "さっかははつのれきししょうせつをかわきりに、つぎつぎとわだいさくをはっぴょうしている。",
    "english": "Starting with their first historical novel, the author has been publishing one hit after another.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "その祭りは勇壮な山車の巡行を皮切りに、三日間にわたって開催される。",
    "expected": "その祭りは勇壮な山車の巡行を皮切りに、三日間にわたって開催される。",
    "reading": "そのまつりはゆうそうなだしのじゅんこうをかわきりに、みっかかんにわたってかいさいされる。",
    "english": "Starting with the parade of magnificent floats, the festival will be held over three days.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "この新製品は限定版の発売を皮切りに、様々なバージョンが展開される予定だ。",
    "expected": "この新製品は限定版の発売を皮切りに、様々なバージョンが展開される予定だ。",
    "reading": "このしんせいひんはげんていばんのはつばいをかわきりに、さまざまなばーじょんがてんかいされるよていだ。",
    "english": "Starting with the release of the limited edition, various versions of this new product are planned to be rolled out.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "彼はオリンピックでの金メダル獲得を皮切りに、数々の国際大会で優勝した。",
    "expected": "彼はオリンピックでの金メダル獲得を皮切りに、数々の国際大会で優勝した。",
    "reading": "かれはおりんぴっくでのきんめだるかくとくをかわきりに、かずかずのこくさいたいかいでゆうしょうした。",
    "english": "Starting with winning the gold medal at the Olympics, he went on to win numerous international competitions.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "あのレストランチェーンは首都圏進出を皮切りにして、急速に店舗網を拡大した。",
    "expected": "あのレストランチェーンは首都圏進出を皮切りにして、急速に店舗網を拡大した。",
    "reading": "あのれすとらんちぇーんはしゅとけんしんしゅつをかわきりにして、きゅうそくにてんぽうもうをかくだいした。",
    "english": "Starting with its expansion into the metropolitan area, that restaurant chain rapidly expanded its network of stores.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "彼の研究成果は、国際学会での発表を皮切りに、世界中から注目を集めた。",
    "expected": "彼の研究成果は、国際学会での発表を皮切りに、世界中から注目を集めた。",
    "reading": "かれのけんきゅうせいかは、こくさいがっかいでのはっぴょうをかわきりに、せかいじゅうからちゅうもくをあつめた。",
    "english": "Starting with the presentation at an international conference, his research findings gathered attention from all over the world.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "政府は消費税率の引き上げを皮切りに、抜本的な財政改革に着手した。",
    "expected": "政府は消費税率の引き上げを皮切りに、抜本的な財政改革に着手した。",
    "reading": "せいふはしょうひぜいりつのひきあげをかわきりに、ばっぽんてきなざいせいかいかくにちゃくしゅした。",
    "english": "Starting with the consumption tax rate hike, the government embarked on fundamental fiscal reforms.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "このドラマはネットでの口コミを皮切りに、徐々に視聴率を伸ばしていった。",
    "expected": "このドラマはネットでの口コミを皮切りに、徐々に視聴率を伸ばしていった。",
    "reading": "このどらまはねっとでのくちこみをかわきりに、じょじょにしちょうりつをのばしていった。",
    "english": "Starting with online word-of-mouth, this drama gradually increased its viewership ratings.",
    "grammar": "〜を皮切りに（して）、〜を皮切りとして"
  },
  {
    "spoken": "説明書には、部品の組み立て方からネジ一本の締め方に至るまで、詳細に書かれていた。",
    "expected": "説明書には、部品の組み立て方からネジ一本の締め方に至るまで、詳細に書かれていた。",
    "reading": "せつめいしょには、ぶひんのくみたてかたからねじいっぽんのしめかたにいたるまで、しょうさいにかかれていた。",
    "english": "The instruction manual detailed everything, from how to assemble the parts down to how to tighten a single screw.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "彼の研究は、理論の構築から実証実験、応用可能性に至るまで、広範囲に及んでいる。",
    "expected": "彼の研究は、理論の構築から実証実験、応用可能性に至るまで、広範囲に及んでいる。",
    "reading": "かれのけんきゅうは、りろんのこうちくからじっしょうじっけん、おうようかのうせいにいたるまで、こうはんいにおよんでいる。",
    "english": "His research covers a wide range, from theoretical construction to empirical experiments and even potential applications.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "被災者には、住居の提供から食料、衣類、そして心のケアに至るまで、手厚い支援が行われた。",
    "expected": "被災者には、住居の提供から食料、衣類、そして心のケアに至るまで、手厚い支援が行われた。",
    "reading": "ひさいしゃには、じゅうきょのていきょうからしょくりょう、いるい、そしてこころのけあにいたるまで、てあついしえんがおこなわれた。",
    "english": "Generous support was provided to the disaster victims, covering everything from housing provision to food, clothing, and even mental health care.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "彼は歴史や文学はもとより、最新のポップカルチャーに至るまで、あらゆる分野に精通している。",
    "expected": "彼は歴史や文学はもとより、最新のポップカルチャーに至るまで、あらゆる分野に精通している。",
    "reading": "かれはれきしやぶんがくはもとより、さいしんのぽっぷかるちゃーにいたるまで、あらゆるぶんやにせいつうしている。",
    "english": "He is well-versed in all fields, not only history and literature but extending even to the latest pop culture.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "美術館の特別展では、画家の幼少期のスケッチから晩年の大作に至るまで、その生涯を辿ることができる。",
    "expected": "美術館の特別展では、画家の幼少期のスケッチから晩年の大作に至るまで、その生涯を辿ることができる。",
    "reading": "びじゅつかんのとくべつてんでは、がかのようしょうきのすけっちからばんねんのたいさくにいたるまで、そのしょうがいをたどることができる。",
    "english": "At the museum's special exhibition, you can trace the artist's life, from childhood sketches right up to their masterpieces from later years.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "警察は、事件現場の遺留品から関係者のアリバイ、過去の類似事件に至るまで、徹底的に捜査した。",
    "expected": "警察は、事件現場の遺留品から関係者のアリバイ、過去の類似事件に至るまで、徹底的に捜査した。",
    "reading": "けいさつは、じけんげんばのいりゅうひんからかんけいしゃのありばい、かこのるいじじけんにいたるまで、てっていてきにそうさした。",
    "english": "The police conducted a thorough investigation, examining everything from items left at the crime scene to the alibis of those involved, and even past similar cases.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "この料理本は、食材の選び方から下ごしらえ、調理手順、盛り付けに至るまで、丁寧に解説している。",
    "expected": "この料理本は、食材の選び方から下ごしらえ、調理手順、盛り付けに至るまで、丁寧に解説している。",
    "reading": "このりょうりぼんは、しょくざいのえらびかたからしたごしらえ、ちょうりてじゅん、もりつけにいたるまで、ていねいにかいせつしている。",
    "english": "This cookbook carefully explains everything from selecting ingredients and preparation to cooking procedures and even plating.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "大企業では、社内の情報管理が厳しく、業務メールの内容に至るまでチェックされることがある。",
    "expected": "大企業では、社内の情報管理が厳しく、業務メールの内容に至るまでチェックされることがある。",
    "reading": "だいきぎょうでは、しゃないのじょうほうかんりがきびしく、ぎょうむめーるのないようにいたるまでちぇっくされることがある。",
    "english": "In large corporations, internal information management is strict, and sometimes even the content of business emails is checked.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "私たちは、公園内の有名な観光スポットから、地元の人しか知らないような小道に至るまで散策した。",
    "expected": "私たちは、公園内の有名な観光スポットから、地元の人しか知らないような小道に至るまで散策した。",
    "reading": "わたしたちは、こうえんないのゆうめいなかんこうすぽっとから、じもとのひとしかしらないようなこみちにいたるまでさんさくした。",
    "english": "We strolled through the park, exploring everything from the famous tourist spots to little paths known only to locals.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "カタログには、大型家具からインテリア小物、生活雑貨に至るまで、ありとあらゆる商品が掲載されている。",
    "expected": "カタログには、大型家具からインテリア小物、生活雑貨に至るまで、ありとあらゆる商品が掲載されている。",
    "reading": "かたろぐには、おおがたかぐからいんてりあこもの、せいかつざっかにいたるまで、ありとあらゆるしょうひんがけいさいされている。",
    "english": "The catalog lists all sorts of products, from large furniture to small interior accessories and even everyday household goods.",
    "grammar": "〜に至るまで"
  },
  {
    "spoken": "本日を限りに、私はこの会社を退職いたします。長年お世話になりました。",
    "expected": "本日を限りに、私はこの会社を退職いたします。長年お世話になりました。",
    "reading": "ほんじつをかぎりに、わたしはこのかいしゃをたいしょくいたします。ながねんおせわになりました。",
    "english": "Effective today, I will be retiring from this company. Thank you for everything over the years.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "誠に勝手ながら、当店は今月を限りに閉店させていただくことになりました。",
    "expected": "誠に勝手ながら、当店は今月を限りに閉店させていただくことになりました。",
    "reading": "まことにかってながら、とうてんはこんげつをかぎりにへいてんさせていただくことになりました。",
    "english": "We regret to inform you that, due to circumstances, our store will be closing at the end of this month.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "健康のため、今日を限りに禁煙することを固く決意した。",
    "expected": "健康のため、今日を限りに禁煙することを固く決意した。",
    "reading": "けんこうのため、きょうをかぎりにきんえんすることをかたくけついした。",
    "english": "For my health, I firmly decided to quit smoking starting today.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "この特別割引キャンペーンは本日を限りに終了となりますので、お早めにご利用ください。",
    "expected": "この特別割引キャンペーンは本日を限りに終了となりますので、お早めにご利用ください。",
    "reading": "このとくべつわりびききゃんぺーんはほんじつをかぎりにしゅうりょうとなりますので、おはやめにごりようください。",
    "english": "This special discount campaign ends today, so please use it soon.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "彼は今回のツアーを限りにバンドを脱退し、ソロ活動に専念するそうだ。",
    "expected": "彼は今回のツアーを限りにバンドを脱退し、ソロ活動に専念するそうだ。",
    "reading": "かれはこんかいのつあーをかぎりにばんどをだったいし、そろかつどうにせんねんするそうだ。",
    "english": "I hear he's leaving the band after this tour to focus on his solo career.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "メーカーは、今年度を限りに、旧型モデルの生産を打ち切ると発表した。",
    "expected": "メーカーは、今年度を限りに、旧型モデルの生産を打ち切ると発表した。",
    "reading": "めーかーは、こんねんどをかぎりに、きゅうがたもでるのせいさんをうちきるとはっぴょうした。",
    "english": "The manufacturer announced that it will discontinue production of the older model at the end of this fiscal year.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "当病院では、来月を限りに夜間診療を取りやめることになりました。",
    "expected": "当病院では、来月を限りに夜間診療を取りやめることになりました。",
    "reading": "とうびょういんでは、らいげつをかぎりによかんしんりょうをとりやめることになりました。",
    "english": "This hospital will be discontinuing night-time consultations as of the end of next month.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "大学図書館は、今学期を限りに、週末の開館時間を短縮する予定です。",
    "expected": "大学図書館は、今学期を限りに、週末の開館時間を短縮する予定です。",
    "reading": "だいがくとしょかんは、こんがっきをかぎりに、しゅうまつのかいかんじかんをたんしゅくするよていです。",
    "english": "The university library plans to shorten its weekend opening hours starting from the end of this semester.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "このソフトウェアの無料サポートは、本日を限りに終了させていただきます。",
    "expected": "このソフトウェアの無料サポートは、本日を限りに終了させていただきます。",
    "reading": "このそふとうぇあのむりょうさぽーとは、ほんじつをかぎりにしゅうりょうさせていただきます。",
    "english": "We will be ending free support for this software as of today.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "そのベテラン選手は、今シーズンを限りに現役を引退することを表明した。",
    "expected": "そのベテラン選手は、今シーズンを限りに現役を引退することを表明した。",
    "reading": "そのべてらんせんしゅは、こんしーずんをかぎりにげんえきをいんたいすることをひょうめいした。",
    "english": "The veteran athlete announced that they will retire from active competition at the end of this season.",
    "grammar": "〜を限りに"
  },
  {
    "spoken": "受付は、本日午後５時をもって締め切らせていただきます。",
    "expected": "受付は、本日午後５時をもって締め切らせていただきます。",
    "reading": "うけつけは、ほんじつごごごじをもってしめきらせていただきます。",
    "english": "Reception will close today at 5:00 PM.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "以上をもって、本日の会議を終了いたします。ご協力ありがとうございました。",
    "expected": "以上をもって、本日の会議を終了いたします。ご協力ありがとうございました。",
    "reading": "いじょうをもって、ほんじつのかいぎをしゅうりょういたします。ごきょうりょくありがとうございました。",
    "english": "With this, we conclude today's meeting. Thank you for your cooperation.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "この最終報告をもって、プロジェクトの全工程が完了となります。",
    "expected": "この最終報告をもって、プロジェクトの全工程が完了となります。",
    "reading": "このさいしゅうほうこくをもって、ぷろじぇくとのぜんこうていがかんりょうとなります。",
    "english": "With this final report, all stages of the project are complete.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "当委員会は、本日付をもって解散することになりました。",
    "expected": "当委員会は、本日付をもって解散することになりました。",
    "reading": "とういいんかいは、ほんじつづけをもってかいさんすることになりました。",
    "english": "This committee will be dissolved effective today.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "双方合意の上、今月末をもって契約を解除することに決定しました。",
    "expected": "双方合意の上、今月末をもって契約を解除することに決定しました。",
    "reading": "そうほうごういのうえ、こんげつまつをもってけいやくをかいじょすることにけっていしました。",
    "english": "By mutual agreement, it has been decided to terminate the contract at the end of this month.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "現行の制度は、来年３月３１日をもって廃止されることが告知された。",
    "expected": "現行の制度は、来年３月３１日をもって廃止されることが告知された。",
    "reading": "げんこうのせいどは、らいねんさんがつさんじゅういちにちをもってはいしされることがこくちされた。",
    "english": "It has been announced that the current system will be abolished effective March 31st of next year.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "作品の募集は、明日の正午をもって終了いたします。",
    "expected": "作品の募集は、明日の正午をもって終了いたします。",
    "reading": "さくひんのぼしゅうは、あしたのしょうごをもってしゅうりょういたします。",
    "english": "The submission period for entries will close tomorrow at noon.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "これをもちまして、閉会式を終わります。",
    "expected": "これをもちまして、閉会式を終わります。",
    "reading": "これをもちまして、へいかいしきをおわります。",
    "english": "With this, the closing ceremony is concluded.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "本日までの審査結果をもって、受賞者を決定いたしました。",
    "expected": "本日までの審査結果をもって、受賞者を決定いたしました。",
    "reading": "ほんじつまでのしんさけっかをもって、じゅしょうしゃをけっていいたしました。",
    "english": "The award winners have been decided based on the judging results up to today.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "まことに遺憾ながら、このサービスは即日をもって停止させていただきます。",
    "expected": "まことに遺憾ながら、このサービスは即日をもって停止させていただきます。",
    "reading": "まことにいかんながら、このさーびすはそくじつをもってていしさせていただきます。",
    "english": "It is truly regrettable, but this service will be discontinued effective immediately.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "昨日の講演会の参加者は、せいぜい百人といったところだった。",
    "expected": "昨日の講演会の参加者は、せいぜい百人といったところだった。",
    "reading": "きのうのこうえんかいのさんかしゃは、せいぜいひゃくにんといったところだった。",
    "english": "The number of attendees at yesterday's lecture was about 100 at most.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "プロジェクトの進捗状況は、まだ全体の半分といったところだ。",
    "expected": "プロジェクトの進捗状況は、まだ全体の半分といったところだ。",
    "reading": "ぷろじぇくとのしんちょくじょうきょうは、まだぜんたいのはんぶんといったところだ。",
    "english": "The project's progress is only about halfway done.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "毎日確保できる日本語の勉強時間は、頑張っても２時間といったところだ。",
    "expected": "毎日確保できる日本語の勉強時間は、頑張っても２時間といったところだ。",
    "reading": "まいにちかくほできるにほんごのべんきょうじかんは、がんばってもにじかんといったところだ。",
    "english": "The amount of Japanese study time I can secure each day is around 2 hours, even if I try hard.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "この中古車の値段は、高くても３０万円といったところだろう。",
    "expected": "この中古車の値段は、高くても３０万円といったところだろう。",
    "reading": "このちゅうこしゃのねだんは、たかくてもさんじゅうまんえんといったところだろう。",
    "english": "The price of this used car would be around 300,000 yen at most.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "新薬の臨床試験における成功率は、残念ながら１０パーセントといったところだ。",
    "expected": "新薬の臨床試験における成功率は、残念ながら１０パーセントといったところだ。",
    "reading": "しんやくのりんしょうしけんにおけるせいこうりつは、ざんねんながらいちれいぱーせんとといったところだ。",
    "english": "Unfortunately, the success rate in clinical trials for the new drug is only about 10 percent.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "イベントのために集まったボランティアの数は、結局２０名といったところだった。",
    "expected": "イベントのために集まったボランティアの数は、結局２０名といったところだった。",
    "reading": "いべんとのためにあつまったぼらんてぃあのかずは、けっきょくにじゅうめいといったところだった。",
    "english": "The number of volunteers who gathered for the event ended up being only about 20 people.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "私の今の日本語能力は、まだまだ中級の上といったところです。",
    "expected": "私の今の日本語能力は、まだまだ中級の上といったところです。",
    "reading": "わたしのいまのにほんごのうりょくは、まだまだちゅうきゅうのうえといったところです。",
    "english": "My current Japanese ability is still only around the upper-intermediate level.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "人気のアトラクションなので、待ち時間は最低でも３０分といったところだろう。",
    "expected": "人気のアトラクションなので、待ち時間は最低でも３０分といったところだろう。",
    "reading": "にんきのあとらくしょんなので、まちじかんはさいていでもさんじゅっぷんといったところだろう。",
    "english": "Since it's a popular attraction, the waiting time is likely to be at least 30 minutes or so.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "私の予算で買える車は、最高でも１００万円といったところだ。",
    "expected": "私の予算で買える車は、最高でも１００万円といったところだ。",
    "reading": "わたしのよさんでかえるくるまは、さいこうでもひゃくまんえんといったところだ。",
    "english": "The most expensive car I can buy with my budget is around 1 million yen.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "新しい政策に対する国民の支持率は、現状では３割といったところだ。",
    "expected": "新しい政策に対する国民の支持率は、現状では３割といったところだ。",
    "reading": "あたらしいせいさくにたいするこくみんのしじりつは、げんじょうではさんわりといったところだ。",
    "english": "Currently, public support for the new policy is only around 30 percent.",
    "grammar": "〜といったところだ"
  },
  {
    "spoken": "この複雑なプロジェクトを任せられるのは、経験豊富な彼をおいて他にいない。",
    "expected": "この複雑なプロジェクトを任せられるのは、経験豊富な彼をおいて他にいない。",
    "reading": "このふくざつなぷろじぇくとをまかせられるのは、けいけんほうふなかれをおいてほかにいない。",
    "english": "There is no one else besides the experienced him who can be entrusted with this complex project.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "現代最高のピアニストといえば、やはり彼女をおいては考えられないでしょう。",
    "expected": "現代最高のピアニストといえば、やはり彼女をおいては考えられないでしょう。",
    "reading": "げんだいさいこうのぴあにすとといえば、やはりかのじょをおいてはかんがえられないでしょう。",
    "english": "Speaking of the greatest pianist of our time, it's probably unthinkable to consider anyone other than her.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "日本文化の神髄を体験できる場所は、京都をおいて他にはありますまい。",
    "expected": "日本文化の神髄を体験できる場所は、京都をおいて他にはありますまい。",
    "reading": "にほんぶんかのしんずいをたいけんできるばしょは、きょうとをおいてほかにはありますまい。",
    "english": "There probably isn't any place other than Kyoto where you can experience the essence of Japanese culture.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "この難解な古文書を解読できる学者は、田中先生をおいて他に存在しないと言われている。",
    "expected": "この難解な古文書を解読できる学者は、田中先生をおいて他に存在しないと言われている。",
    "reading": "このなんかいなこもんじょをかいどくできるがくしゃは、たなかせんせいをおいてほかにそんざいしないといわれている。",
    "english": "It is said that there exists no scholar other than Professor Tanaka who can decipher this difficult ancient document.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "チームをまとめ、目標達成に導けるリーダーは、現時点では部長をおいて考えられない。",
    "expected": "チームをまとめ、目標達成に導けるリーダーは、現時点では部長をおいて考えられない。",
    "reading": "ちーむをまとめ、もくひょうたっせいにみちびけるりーだーは、げんじてんではぶちょうをおいてかんがえられない。",
    "english": "At this point in time, we can't think of any leader besides the department manager who can unite the team and guide them to achieve their goals.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "世界平和に貢献できる人物は、彼のような高潔な人格者をおいて他に求められない。",
    "expected": "世界平和に貢献できる人物は、彼のような高潔な人格者をおいて他に求められない。",
    "reading": "せかいへいわにこうけんできるじんぶつは、かれのようなこうけつなじんかくしゃをおいてほかにもとめられない。",
    "english": "A person who can contribute to world peace cannot be sought other than a person of noble character like him.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "次世代エネルギー問題を解決する鍵は、この新技術をおいて他にないだろう。",
    "expected": "次世代エネルギー問題を解決する鍵は、この新技術をおいて他にないだろう。",
    "reading": "じせだいえねるぎーもんだいをかいけつするかぎは、このしんぎじゅつをおいてほかにないだろう。",
    "english": "There is likely no other key to solving the next-generation energy problem besides this new technology.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "この地方の美しい景観を守れるのは、地元住民の協力をおいて他に道はない。",
    "expected": "この地方の美しい景観を守れるのは、地元住民の協力をおいて他に道はない。",
    "reading": "このちほうのうつくしいけいかんをまもれるのは、じもとじゅうみんのきょうりょくをおいてほかにみちはない。",
    "english": "There is no other way to protect the beautiful scenery of this region besides the cooperation of the local residents.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "真の芸術と呼べる作品は、彼の創作活動をおいて語ることはできない。",
    "expected": "真の芸術と呼べる作品は、彼の創作活動をおいて語ることはできない。",
    "reading": "しんのげいじゅつとよべるさくひんは、かれのそうさくかつどうをおいてかたることはできない。",
    "english": "Works that can be called true art cannot be discussed without considering his creative activities.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "今回の交渉を成功させられるだけの交渉術を持つのは、彼女をおいて他に適任者はいない。",
    "expected": "今回の交渉を成功させられるだけの交渉術を持つのは、彼女をおいて他に適任者はいない。",
    "reading": "こんかいのこうしょうをせいこうさせられるだけのこうしょうじゅつをもつのは、かのじょをおいてほかにてきにんしゃはいない。",
    "english": "There is no other suitable person besides her who possesses the negotiation skills to make these talks successful.",
    "grammar": "〜をおいて"
  },
  {
    "spoken": "この独特の風合いは、手染めならではの魅力です。",
    "expected": "この独特の風合いは、手染めならではの魅力です。",
    "reading": "このどくとくのふうあいは、てぞめならではのみりょくです。",
    "english": "This unique texture is a charm unique to hand-dyeing.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "職人の熟練した技ならではの、細部にまでこだわった仕上がりになっている。",
    "expected": "職人の熟練した技ならではの、細部にまでこだわった仕上がりになっている。",
    "reading": "しょくにんのじゅくれんしたわざならではの、さいぶにまでこだわったしあがりになっている。",
    "english": "It has a finish, attentive to the finest details, that is only possible with the artisan's skilled technique.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "下町ならではの温かい人情に触れ、心が和んだ。",
    "expected": "下町ならではの温かい人情に触れ、心が和んだ。",
    "reading": "したまちならではのあたたかいにんじょうにふれ、こころがなごんだ。",
    "english": "Experiencing the warm human kindness unique to the old downtown area soothed my heart.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "この老舗旅館ならではの、きめ細やかなおもてなしに感動しました。",
    "expected": "この老舗旅館ならではの、きめ細やかなおもてなしに感動しました。",
    "reading": "このしにせりょかんならではの、きめこまやかなおもてなしにかんどうしました。",
    "english": "I was moved by the meticulous hospitality unique to this long-established traditional inn.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "現地ならではの食材を使った料理は、旅行の醍醐味の一つだ。",
    "expected": "現地ならではの食材を使った料理は、旅行の醍醐味の一つだ。",
    "reading": "げんちならではのしょくざいをつかったりょうりは、りょこうのだいごみのひとつだ。",
    "english": "Cuisine using ingredients unique to the local area is one of the real pleasures of traveling.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "この祭りは、地域住民の団結力ならではの迫力がある。",
    "expected": "この祭りは、地域住民の団結力ならではの迫力がある。",
    "reading": "このまつりは、ちいきじゅうみんのだんけつりょくならではのはくりょくがある。",
    "english": "This festival has an intensity that comes uniquely from the solidarity of the local residents.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "彼の発想は、長年の研究者ならではの深い洞察に基づいている。",
    "expected": "彼の発想は、長年の研究者ならではの深い洞察に基づいている。",
    "reading": "かれのはっそうは、ながねんのけんきゅうしゃならではのふかいどうさつにもとづいている。",
    "english": "His ideas are based on deep insights unique to someone who has been a researcher for many years.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "オーダーメイドならではの、自分の体に完璧にフィットするスーツが仕上がった。",
    "expected": "オーダーメイドならではの、自分の体に完璧にフィットするスーツが仕上がった。",
    "reading": "おーだーめいどならではの、じぶんのからだにかんぺきにふぃっとするすーつがしあがった。",
    "english": "A suit that perfectly fits my body, unique to custom-made tailoring, has been completed.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "デジタル時代ならではの新しい表現方法を模索している。",
    "expected": "デジタル時代ならではの新しい表現方法を模索している。",
    "reading": "でじたるじだいならではのあたらしいひょうげんほうほうをもしゃくしている。",
    "english": "We are exploring new methods of expression unique to the digital age.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "歴史ある街並みならではの落ち着いた雰囲気が、訪れる人々を魅了する。",
    "expected": "歴史ある街並みならではの落ち着いた雰囲気が、訪れる人々を魅了する。",
    "reading": "れきしあるまちなみならではのおちついたふんいきが、おとずれるひとびとをみりょうする。",
    "english": "The calm atmosphere, unique to the historic townscape, fascinates visitors.",
    "grammar": "〜ならでは"
  },
  {
    "spoken": "彼の活躍は所属チームにとどまらず、国全体に勇気を与えた。",
    "expected": "彼の活躍は所属チームにとどまらず、国全体に勇気を与えた。",
    "reading": "かれのかつやくはしょぞくちーむにとどまらず、くにぜんたいにゆうきをあたえた。",
    "english": "His success extended beyond his team, giving courage to the entire nation.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "この技術の影響は、製造業にとどまらず、医療や教育分野にも及んでいる。",
    "expected": "この技術の影響は、製造業にとどまらず、医療や教育分野にも及んでいる。",
    "reading": "このぎじゅつのえいきょうは、せいぞうぎょうにとどまらず、いりょうやきょういくぶんやにもおよんでいる。",
    "english": "The impact of this technology extends not only to the manufacturing industry but also to the fields of medicine and education.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "環境問題への関心は、一部の専門家にとどまらず、一般市民の間でも高まっている。",
    "expected": "環境問題への関心は、一部の専門家にとどまらず、一般市民の間でも高まっている。",
    "reading": "かんきょうもんだいへのかんしんは、いちぶのせんもんかにとどまらず、いっぱんしみんのあいだでもたかまっている。",
    "english": "Interest in environmental issues is growing not only among some experts but also among the general public.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "インターネットの普及は、情報の伝達速度を速めたにとどまらず、人々の生活様式をも変えた。",
    "expected": "インターネットの普及は、情報の伝達速度を速めたにとどまらず、人々の生活様式をも変えた。",
    "reading": "いんたーねっとのふきゅうは、じょうほうのでんたつそくどをはやめたにとどまらず、ひとびとのせいかつようしきをもかえた。",
    "english": "The spread of the internet has not only accelerated the speed of information transmission but has also changed people's lifestyles.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "この新製品は、国内市場にとどまらず、海外からも大きな注目を集めている。",
    "expected": "この新製品は、国内市場にとどまらず、海外からも大きな注目を集めている。",
    "reading": "このしんせいひんは、こくないしじょうにとどまらず、かいがいからもおおきなちゅうもくをあつめている。",
    "english": "This new product is attracting significant attention not only in the domestic market but also from overseas.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "少子高齢化の影響は、経済にとどまらず、社会保障制度全体に及んでいる。",
    "expected": "少子高齢化の影響は、経済にとどまらず、社会保障制度全体に及んでいる。",
    "reading": "しょうしこうれいかのえいきょうは、けいざいにとどまらず、しゃかいほしょうせいどぜんたいにおよんでいる。",
    "english": "The effects of the declining birthrate and aging population extend beyond the economy to the entire social security system.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "彼の芸術活動は、絵画にとどまらず、彫刻や映像作品にも広がっている。",
    "expected": "彼の芸術活動は、絵画にとどまらず、彫刻や映像作品にも広がっている。",
    "reading": "かれのげいじゅつかつどうは、かいがにとどまらず、ちょうこくやえいぞうさくひんにもひろがっている。",
    "english": "His artistic activities extend beyond painting to include sculpture and video works.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "再生可能エネルギーの導入は、環境保全にとどまらず、新たな産業創出にも繋がる。",
    "expected": "再生可能エネルギーの導入は、環境保全にとどまらず、新たな産業創出にも繋がる。",
    "reading": "さいせいかのうえねるぎーのどうにゅうは、かんきょうほぜんにとどまらず、あらたなさんぎょうそうしゅつにもつながる。",
    "english": "The introduction of renewable energy not only contributes to environmental conservation but also leads to the creation of new industries.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "その企業の不祥事は、会社の信用失墜にとどまらず、業界全体のイメージダウンを引き起こした。",
    "expected": "その企業の不祥事は、会社の信用失墜にとどまらず、業界全体のイメージダウンを引き起こした。",
    "reading": "そのきぎょうのふしょうじは、かいしゃのしんようしっついにとどまらず、ぎょうかいぜんたいのいめーじだうんをひきおこした。",
    "english": "The company's scandal not only led to a loss of trust in the company but also caused damage to the image of the entire industry.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "ボランティア活動への参加は、大学生にとどまらず、社会人や高齢者にも広がっている。",
    "expected": "ボランティア活動への参加は、大学生にとどまらず、社会人や高齢者にも広がっている。",
    "reading": "ぼらんてぃあかつどうへのさんかは、だいがくせいにとどまらず、しゃかいじんやこうれいしゃにもひろがっている。",
    "english": "Participation in volunteer activities is spreading not only among university students but also among working adults and the elderly.",
    "grammar": "〜にとどまらず"
  },
  {
    "spoken": "彼は十分な食事はおろか、水さえ満足に飲めない状況だった。",
    "expected": "彼は十分な食事はおろか、水さえ満足に飲めない状況だった。",
    "reading": "かれはじゅうぶんなしょくじはおろか、みずさえまんぞくにのめないじょうきょうだった。",
    "english": "He was in a situation where he couldn't even drink water properly, let alone have a proper meal.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "この地域では、電車はおろか、バスも一日数本しか走っていない。",
    "expected": "この地域では、電車はおろか、バスも一日数本しか走っていない。",
    "reading": "このちいきでは、でんしゃはおろか、ばすもいちにちすうほんしかはしっていない。",
    "english": "In this region, there are only a few buses a day, let alone trains.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "彼は仕事で忙しく、休みを取ることはおろか、睡眠時間さえ削っている。",
    "expected": "彼は仕事で忙しく、休みを取ることはおろか、睡眠時間さえ削っている。",
    "reading": "かれはしごとでいそがしく、やすみをとることはおろか、すいみんじかんさえけずっている。",
    "english": "He is so busy with work that he is cutting back even on sleep, let alone taking days off.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "災害により家を失い、着るものはおろか、今日食べるものにも困っている人々がいる。",
    "expected": "災害により家を失い、着るものはおろか、今日食べるものにも困っている人々がいる。",
    "reading": "さいがいによりいえをうしない、きるものはおろか、きょうたべるものにもこまっているひとびとがいる。",
    "english": "Due to the disaster, there are people who have lost their homes and are struggling even for food for today, let alone clothes to wear.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "日本語の新聞を読むことはおろか、簡単な挨拶もまだ難しい。",
    "expected": "日本語の新聞を読むことはおろか、簡単な挨拶もまだ難しい。",
    "reading": "にほんごのしんぶんをよむことはおろか、かんたんなあいさつもまだむずかしい。",
    "english": "Even simple greetings are still difficult for me, let alone reading a Japanese newspaper.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "彼は自分の意見を主張することはおろか、人前で話すことさえ苦手だ。",
    "expected": "彼は自分の意見を主張することはおろか、人前で話すことさえ苦手だ。",
    "reading": "かれはじぶんのいけんをしゅちょうすることはおろか、ひとまえではなすことさえにがてだ。",
    "english": "He finds it difficult even to speak in public, let alone assert his own opinions.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "貯金はおろか、毎月の生活費を賄うので精一杯だ。",
    "expected": "貯金はおろか、毎月の生活費を賄うので精一杯だ。",
    "reading": "ちょきんはおろか、まいつきのせいかつひをまかなうのでせいいっぱいだ。",
    "english": "It's all I can do to cover my monthly living expenses, let alone save any money.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "病状が悪化し、歩くことはおろか、起き上がることさえ困難になった。",
    "expected": "病状が悪化し、歩くことはおろか、起き上がることさえ困難になった。",
    "reading": "びょうじょうがあっかし、あるくことはおろか、おきあがることさえこんなんになった。",
    "english": "His medical condition worsened, making it difficult even to sit up, let alone walk.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "彼は感謝の言葉はおろか、謝罪の一言もなかった。",
    "expected": "彼は感謝の言葉はおろか、謝罪の一言もなかった。",
    "reading": "かれはかんしゃのことばはおろか、しゃざいのひとこともなかった。",
    "english": "He didn't offer a single word of apology, let alone words of thanks.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "パソコンはおろか、スマートフォンさえ持っていない高齢者も少なくない。",
    "expected": "パソコンはおろか、スマートフォンさえ持っていない高齢者も少なくない。",
    "reading": "ぱそこんはおろか、すまーとふぉんさえもっていないこうれいしゃもすくなくない。",
    "english": "There are quite a few elderly people who don't even own a smartphone, let alone a personal computer.",
    "grammar": "〜はおろか"
  },
  {
    "spoken": "彼女のプレゼンテーションは、内容もさることながら、話し方が非常に説得力があった。",
    "expected": "彼女のプレゼンテーションは、内容もさることながら、話し方が非常に説得力があった。",
    "reading": "かのじょのぷれぜんてーしょんは、ないようもさることながら、はなしかたがひじょうにせっとくりょくがあった。",
    "english": "Regarding her presentation, while the content was certainly good, her speaking style was extremely persuasive.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "このレストランは、料理の味もさることながら、店内の雰囲気も素晴らしい。",
    "expected": "このレストランは、料理の味もさることながら、店内の雰囲気も素晴らしい。",
    "reading": "このれすとらんは、りょうりのあじもさることながら、てんないのふんいきもすばらしい。",
    "english": "At this restaurant, while the taste of the food is certainly great, the atmosphere inside is also wonderful.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "彼の成功は、才能もさることながら、並外れた努力の結果だろう。",
    "expected": "彼の成功は、才能もさることながら、なみはずれたどりょくのけっかだろう。",
    "reading": "かれのせいこうは、さいのうもさることながら、なみはずれたどりょくのけっかだろう。",
    "english": "His success is likely the result of extraordinary effort, although his talent is also undeniable.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "この製品は、デザインもさることながら、機能性の高さが評価されている。",
    "expected": "この製品は、デザインもさることながら、機能性の高さが評価されている。",
    "reading": "このせいひんは、でざいんもさることながら、きのうせいのたかさがひょうかされている。",
    "english": "This product is highly evaluated for its functionality, although its design is also noteworthy.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "彼が信頼される理由は、知識や経験もさることながら、その誠実な人柄にある。",
    "expected": "彼が信頼される理由は、知識や経験もさることながら、その誠実な人柄にある。",
    "reading": "かれがしんらいされるりゆうは、ちしきやけいけんもさることながら、そのせいじつなひとがら にある。",
    "english": "The reason he is trusted lies in his sincere personality, although his knowledge and experience are also significant.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "留学生活では、語学力もさることながら、異文化への適応力が重要になる。",
    "expected": "留学生活では、語学力もさることながら、異文化への適応力が重要になる。",
    "reading": "りゅうがくせいかつでは、ごがくりょくもさることながら、いぶんかへのてきおうりょくがじゅうようになる。",
    "english": "In life studying abroad, adaptability to different cultures becomes important, though language ability is certainly crucial too.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "この温泉地は、泉質もさることながら、周囲の豊かな自然が魅力だ。",
    "expected": "この温泉地は、泉質もさることながら、周囲の豊かな自然が魅力だ。",
    "reading": "このおんせんちは、せんしつもさることながら、しゅういのゆたかなしぜんがみりょくだ。",
    "english": "This hot spring area's appeal lies in the rich natural surroundings, although the quality of the spring water is also notable.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "リーダーシップを発揮するには、決断力もさることながら、部下の意見に耳を傾ける姿勢が求められる。",
    "expected": "リーダーシップを発揮するには、決断力もさることながら、部下の意見に耳を傾ける姿勢が求められる。",
    "reading": "りーだーしっぷをはっきするには、けつだんりょくもさることながら、ぶかのいけんにみみをかたむけるしせいがもとめられる。",
    "english": "To demonstrate leadership, decisiveness is important, but an attitude of listening to subordinates' opinions is also required.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "古い建物を改修する際は、耐震性もさることながら、歴史的な価値を損なわない配慮が必要だ。",
    "expected": "古い建物を改修する際は、耐震性もさることながら、歴史的な価値を損なわない配慮が必要だ。",
    "reading": "ふるいたてものをかいしゅうするさいは、たいしんせいもさることながら、れきしてきなかちをそこなわないはいりょがひつようだ。",
    "english": "When renovating old buildings, consideration not to spoil their historical value is necessary, although earthquake resistance is also important.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "子育てにおいては、経済的な安定もさることながら、親子のコミュニケーションが何より大切だ。",
    "expected": "子育てにおいては、経済的な安定もさることながら、親子のコミュニケーションが何より大切だ。",
    "reading": "こそだてにおいては、けいざいてきなあんていもさることながら、おやこのこみゅにけーしょんがなによりたいせつだ。",
    "english": "In child-rearing, parent-child communication is paramount, although financial stability is certainly important too.",
    "grammar": "〜もさることながら"
  },
  {
    "spoken": "困ったときは、先生になり先輩になり相談してみるといいですよ。",
    "expected": "困ったときは、先生になり先輩になり相談してみるといいですよ。",
    "reading": "こまったときは、せんせいになりせんぱいになりそうだんしてみるといいですよ。",
    "english": "When you're in trouble, it's a good idea to consult with either a teacher or a senior student.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "週末は、映画を見るなり本を読むなりして、ゆっくり過ごしたいと思っています。",
    "expected": "週末は、映画を見るなり本を読むなりして、ゆっくり過ごしたいと思っています。",
    "reading": "しゅうまつは、えいがをみるなりほんをよむなりして、ゆっくりすごしたいとおもっています。",
    "english": "This weekend, I'm thinking of relaxing by either watching a movie or reading a book.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "お忙しいようでしたら、電話なりメールなりでご連絡いただければ結構です。",
    "expected": "お忙しいようでしたら、電話なりメールなりでご連絡いただければ結構です。",
    "reading": "おいそがしいようでしたら、でんわなりめーるなりでごれんらくいただければけっこうです。",
    "english": "If you seem busy, contacting us by either phone or email is perfectly fine.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "分からないことがあれば、自分で調べるなり、詳しい人に聞くなりしてください。",
    "expected": "分からないことがあれば、自分で調べるなり、詳しい人に聞くなりしてください。",
    "reading": "わからないことがあれば、じぶんでしらべるなり、くわしいひとにきくなりしてください。",
    "english": "If there's something you don't understand, please either look it up yourself or ask someone knowledgeable.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "この状況を改善するには、トップが辞任するなり、組織改革をするなり、抜本的な対策が必要です。",
    "expected": "この状況を改善するには、トップが辞任するなり、組織改革をするなり、抜本的な対策が必要です。",
    "reading": "このじょうきょうをかいぜんするには、とっぷがじにんするなり、そしきかいかくをするなり、ばっぽんてきなたいさくがひつようです。",
    "english": "To improve this situation, drastic measures are needed, such as the leader resigning or implementing organizational reforms.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "昼食は、各自でコンビニで買うなり、近くの食堂に行くなりしてください。",
    "expected": "昼食は、各自でコンビニで買うなり、近くの食堂に行くなりしてください。",
    "reading": "ちゅうしょくは、かくじでこんびにでかうなり、ちかくのしょくどうにいくなりしてください。",
    "english": "For lunch, please either buy something at the convenience store or go to a nearby cafeteria on your own.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "もう我慢できない。今の会社を辞めるなり、長期休暇を取るなりしたい気分だ。",
    "expected": "もう我慢できない。今の会社を辞めるなり、長期休暇を取るなりしたい気分だ。",
    "reading": "もうがまんできない。いまのかいしゃをやめるなり、ちょうききゅうかをとるなりしたいきぶんだ。",
    "english": "I can't stand it anymore. I feel like either quitting my current company or taking a long vacation.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "資料が見つからないなら、担当者に連絡するなり、共有ドライブを検索するなりしてみてはどうですか。",
    "expected": "資料が見つからないなら、担当者に連絡するなり、共有ドライブを検索するなりしてみてはどうですか。",
    "reading": "しりょうがみつからないなら、たんとうしゃにれんらくするなり、きょうゆうどらいぶをけんさくするなりしてみてはどうですか。",
    "english": "If you can't find the document, how about either contacting the person in charge or searching the shared drive?",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "パーティーの飲み物は、ビールなりワインなり、お好きなものをお取りください。",
    "expected": "パーティーの飲み物は、ビールなりワインなり、お好きなものをお取りください。",
    "reading": "ぱーてぃーののみものは、びーるなりわいんなり、おすきなものをおとりください。",
    "english": "For drinks at the party, please help yourself to what you like, be it beer or wine.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "約束を破った以上、謝罪するなり、何らかの形で埋め合わせをするなり、誠意を見せるべきだ。",
    "expected": "約束を破った以上、謝罪するなり、何らかの形で埋め合わせをするなり、誠意を見せるべきだ。",
    "reading": "やくそくをやぶったいじょう、しゃざいするなり、なんらかのかたちでうめあわせをするなり、せいいをみせるべきだ。",
    "english": "Since you broke the promise, you should show sincerity by either apologizing or making up for it in some way.",
    "grammar": "〜なり…なり"
  },
  {
    "spoken": "理由が何であれ、無断欠勤は社会人として許されない行為だ。",
    "expected": "理由が何であれ、無断欠勤は社会人として許されない行為だ。",
    "reading": "りゆうがなんであれ、むだんけっきんはしゃかいじんとしてゆるされないこういだ。",
    "english": "Whatever the reason may be, unexcused absence is unacceptable behavior for a working adult.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "経験者であれ未経験者であれ、学ぶ意欲のある人を歓迎します。",
    "expected": "経験者であれ未経験者であれ、学ぶ意欲のある人を歓迎します。",
    "reading": "けいけんしゃであれみけいけんしゃであれ、まなぶいよくのあるひとをかんげいします。",
    "english": "Whether you are experienced or inexperienced, we welcome anyone who is eager to learn.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "国籍であれ宗教であれ、それ自体が個人の価値を決めるものではない。",
    "expected": "国籍であれ宗教であれ、それ自体が個人の価値を決めるものではない。",
    "reading": "こくせきであれしゅうきょうであれ、それじたいがこじんのかちをきめるものではない。",
    "english": "Neither nationality nor religion in itself determines an individual's worth.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "晴天であろうと雨天であろうと、明日のハイキングは決行します。",
    "expected": "晴天であろうと雨天であろうと、明日のハイキングは決行します。",
    "reading": "せいてんであろうとうてんであろうと、あすのはいきんぐはけっこうします。",
    "english": "Regardless of whether it's sunny or rainy, tomorrow's hike will proceed as planned.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "社長であろうと平社員であろうと、会社の規則は遵守しなければならない。",
    "expected": "社長であろうと平社員であろうと、会社の規則は遵守しなければならない。",
    "reading": "しゃちょうであろうとひらしゃいんであろうと、かいしゃのきそくはじゅんしゅしなければならない。",
    "english": "Whether one is the president or a regular employee, company rules must be observed.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "音楽であれ美術であれ、芸術は人の心を豊かにする力を持っている。",
    "expected": "音楽であれ美術であれ、芸術は人の心を豊かにする力を持っている。",
    "reading": "おんがくであれびじゅつであれ、げいじゅつはひとのこころをゆたかにするちからをもっている。",
    "english": "Be it music or art, the arts possess the power to enrich people's hearts.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "いかに困難な状況であろうと、私たちは最後まで諦めずに解決策を探すべきだ。",
    "expected": "いかに困難な状況であろうと、私たちは最後まで諦めずに解決策を探すべきだ。",
    "reading": "いかにこんなんなじょうきょうであろうと、わたしたちはさいごまであきらめずにかいけつさくをさがすべきだ。",
    "english": "However difficult the situation may be, we should search for a solution without giving up until the very end.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "彼が賛成しようと反対しようと、この計画は実行に移されるだろう。",
    "expected": "彼が賛成しようと反対しようと、この計画は実行に移されるだろう。",
    "reading": "かれがさんせいしようとはんたいしようと、このけいかくはじっこうにうつされるだろう。",
    "english": "Whether he agrees or disagrees, this plan will likely be put into action.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "子供であれ大人であれ、この博物館の展示は知的好奇心を刺激するでしょう。",
    "expected": "子供であれ大人であれ、この博物館の展示は知的好奇心を刺激するでしょう。",
    "reading": "こどもであれおとなであれ、このはくぶつかんのてんじはちてきこうきしんをしげきするでしょう。",
    "english": "Whether for children or adults, the exhibits at this museum will likely stimulate intellectual curiosity.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "富める者であろうと貧しい者であろうと、法の前では全ての人が平等に扱われるべきです。",
    "expected": "富める者であろうと貧しい者であろうと、法の前では全ての人が平等に扱われるべきです。",
    "reading": "とめるものであろうとまずしいものであろうと、ほうのまえではすべてのひとがびょうどうにあつかわれるべきです。",
    "english": "Whether one is rich or poor, all people should be treated equally before the law.",
    "grammar": "〜であれ…であれ、〜であろうと…であろうと"
  },
  {
    "spoken": "この旅館は、部屋の雰囲気といい、食事のおいしさといい、本当に満足でした。",
    "expected": "この旅館は、部屋の雰囲気といい、食事のおいしさといい、本当に満足でした。",
    "reading": "このりょかんは、へやのふんいきといい、しょくじのおいしさといい、ほんとうにまんぞくでした。",
    "english": "This traditional inn was truly satisfying, both in terms of the room's atmosphere and the deliciousness of the meals.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "あのレストランは、値段の高さといい、接客態度の悪さといい、もう行きたくない。",
    "expected": "あのレストランは、値段の高さといい、接客態度の悪さといい、もう行きたくない。",
    "reading": "あのれすとらんは、ねだんのたかさといい、せっきゃくたいどのわるさといい、もういきたくない。",
    "english": "That restaurant, with its high prices and poor customer service attitude, I don't want to go there anymore.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "彼のスーツの着こなしといい、洗練された話し方といい、いかにもエリートという感じだ。",
    "expected": "彼のスーツの着こなしといい、洗練された話し方といい、いかにもエリートという感じだ。",
    "reading": "かれのすーつのきこなしといい、せんれんされたはなしかたといい、いかにもえりーとというかんじだ。",
    "english": "Both the way he wears his suit and his sophisticated manner of speaking give him the distinct air of an elite.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "この庭園は、苔の美しさといい、石灯籠の配置といい、日本のわびさびを感じさせる。",
    "expected": "この庭園は、苔の美しさといい、石灯籠の配置といい、日本のわびさびを感じさせる。",
    "reading": "このていえんは、こけのうつくしさといい、いしどうろうのはいちといい、にほんのわびさびをかんじさせる。",
    "english": "This garden, with the beauty of its moss and the placement of its stone lanterns, evokes the Japanese aesthetic of wabi-sabi.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "今回の彼のレポートは、内容の薄さといい、誤字脱字の多さといい、評価に値しない。",
    "expected": "今回の彼のレポートは、内容の薄さといい、誤字脱字の多さといい、評価に値しない。",
    "reading": "こんかいのかれのれぽーとは、ないようのうすさといい、ごじだつじのおおさといい、ひょうかにあたいしない。",
    "english": "His report this time, considering its lack of substance and numerous typos, is not worthy of evaluation.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "彼女のデザインは、色使いといい、フォルムの独創性といい、他の追随を許さない。",
    "expected": "彼女のデザインは、色使いといい、フォルムの独創性といい、他の追随を許さない。",
    "reading": "かのじょのでざいんは、いろづかいといい、ふぉるむのどくそうせいといい、ほかのついずいをゆるさない。",
    "english": "Her designs, both in their use of color and the originality of their forms, are unparalleled.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "新しく赴任した支店長は、部下への態度といい、指示の出し方といい、周りから不評を買っている。",
    "expected": "新しく赴任した支店長は、部下への態度といい、指示の出し方といい、周りから不評を買っている。",
    "reading": "あたらしくふにんしたしてんちょうは、ぶかへのたいどといい、しじのだしかたといい、まわりからふひょうをかっている。",
    "english": "The newly appointed branch manager is unpopular with those around him due to both his attitude towards subordinates and the way he gives instructions.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "この中古パソコンは、外観の傷といい、動作の遅さといい、買う気にはなれない。",
    "expected": "この中古パソコンは、外観の傷といい、動作の遅さといい、買う気にはなれない。",
    "reading": "このちゅうこぱそこんは、がいかんのきずといい、どうさのおそさといい、かうきにはなれない。",
    "english": "This used computer, with the scratches on its exterior and its slow performance, doesn't make me want to buy it.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "昨日のプレゼンは、準備された資料といい、質疑応答への対応といい、完璧だった。",
    "expected": "昨日のプレゼンは、準備された資料といい、質疑応答への対応といい、完璧だった。",
    "reading": "きのうのぷれぜんは、じゅんびされたしりょうといい、しつぎおうとうへのたいおうといい、かんぺきだった。",
    "english": "Yesterday's presentation was perfect, both in terms of the prepared materials and the handling of the Q&A session.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "隠れ家のようなそのバーは、照明の暗さといい、流れるジャズといい、大人の雰囲気だ。",
    "expected": "隠れ家のようなそのバーは、照明の暗さといい、流れるジャズといい、大人の雰囲気だ。",
    "reading": "かくれがのようなそのばーは、しょうめいのくらさといい、ながれるじゃずといい、おとなのふんいきだ。",
    "english": "That bar, like a hideaway, has a mature atmosphere with its dim lighting and the jazz music playing.",
    "grammar": "〜といい…といい"
  },
  {
    "spoken": "子供たちは公園で、手といわず顔といわず、砂だらけになって遊んでいた。",
    "expected": "子供たちは公園で、手といわず顔といわず、砂だらけになって遊んでいた。",
    "reading": "こどもたちはこうえんで、てといわずかおといわず、すなだらけになってあそんでいた。",
    "english": "The children were playing in the park, getting covered in sand all over, not just their hands but their faces too.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "彼は作家として、昼といわず夜といわず、執筆活動に没頭している。",
    "expected": "彼は作家として、昼といわず夜といわず、執筆活動に没頭している。",
    "reading": "かれはさっかとして、ひるといわずよるといわず、しっぴつかつどうにぼっとうしている。",
    "english": "As a writer, he is absorbed in his writing activities day and night.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "先日の事故現場は、道路といわず歩道といわず、ガラスの破片が散乱していた。",
    "expected": "先日の事故現場は、道路といわず歩道といわず、ガラスの破片が散乱していた。",
    "reading": "せんじつのじこげんばは、どうろといわずほどうといわず、がらすのはへんがさんらんしていた。",
    "english": "At the scene of the recent accident, shards of glass were scattered everywhere, on the road and the sidewalk alike.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "最近の若者は、電車の中といわず、食事中といわず、常にスマホを操作している。",
    "expected": "最近の若者は、電車の中といわず、食事中といわず、常にスマホを操作している。",
    "reading": "さいきんのわかものは、でんしゃのなかといわず、しょくじちゅうといわず、つねにすまほをそうさしている。",
    "english": "Young people these days are constantly operating their smartphones, whether on the train or during meals.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "マラソンを完走した後、足といわず腕といわず、全身が筋肉痛になった。",
    "expected": "マラソンを完走した後、足といわず腕といわず、全身が筋肉痛になった。",
    "reading": "まらそんをかんそうしたあと、あしといわずうでといわず、ぜんしんがきんにくつうになった。",
    "english": "After completing the marathon, my whole body ached, including my legs and arms.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "有名シェフが作る料理は、盛り付けといわず香りといわず、五感を刺激する。",
    "expected": "有名シェフが作る料理は、盛り付けといわず香りといわず、五感を刺激する。",
    "reading": "ゆうめいしぇふがつくるりょうりは、もりつけといわずかおりといわず、ごかんをしげきする。",
    "english": "The dishes prepared by the famous chef stimulate all five senses, from the presentation to the aroma.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "大型台風の影響で、庭の木々は枝といわず葉といわず、ひどい有様だった。",
    "expected": "大型台風の影響で、庭の木々は枝といわず葉といわず、ひどい有様だった。",
    "reading": "おおがたたいふうのえいきょうで、にわのきぎはえだといわずはといわず、ひどいありさまだった。",
    "english": "Due to the major typhoon, the trees in the garden were in a terrible state, affecting both branches and leaves.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "人気アイドルのコンサート会場は、アリーナ席といわずスタンド席といわず、ファンで埋め尽くされた。",
    "expected": "人気アイドルのコンサート会場は、アリーナ席といわずスタンド席といわず、ファンで埋め尽くされた。",
    "reading": "にんきあいどるのこんさーとかいじょうは、ありーなせきといわずすたんどせきといわず、ふぁんでうめつくされた。",
    "english": "The concert venue for the popular idol was completely filled with fans, in both the arena and the stands.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "年末の大掃除では、窓といわず床といわず、家中の汚れを徹底的に落とした。",
    "expected": "年末の大掃除では、窓といわず床といわず、家中の汚れを徹底的に落とした。",
    "reading": "ねんまつのおおそうじでは、まどといわずゆかといわず、いえじゅうのよごれをてっていてきにおとした。",
    "english": "During the year-end cleaning, we thoroughly removed dirt from all over the house, including windows and floors.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "スパゲッティを食べている赤ちゃんは、口といわず手といわず、トマトソースでべとべとだ。",
    "expected": "スパゲッティを食べている赤ちゃんは、口といわず手といわず、トマトソースでべとべとだ。",
    "reading": "すぱげってぃをたべているあかちゃんは、くちといわずてといわず、とまとそーすでべとべとだ。",
    "english": "The baby eating spaghetti is sticky with tomato sauce all over, not just their mouth but their hands too.",
    "grammar": "〜といわず…といわず"
  },
  {
    "spoken": "検査の結果いかんでは、手術が必要になるかもしれません。",
    "expected": "検査の結果いかんでは、手術が必要になるかもしれません。",
    "reading": "けんさのけっかいかんでは、しゅじゅつがひつようになるかもしれません。",
    "english": "Depending on the test results, surgery might be necessary.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "明日の天候いかんによっては、イベントは中止となります。",
    "expected": "明日の天候いかんによっては、イベントは中止となります。",
    "reading": "あしたのてんこういかんによっては、いべんとはちゅうしとなります。",
    "english": "Depending on tomorrow's weather, the event will be cancelled.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "交渉の展開いかんでは、契約条件が変わる可能性がある。",
    "expected": "交渉の展開いかんでは、契約条件が変わる可能性がある。",
    "reading": "こうしょうのてんかいいかんでは、けいやくじょうけんがかわるかのうせいがある。",
    "english": "Depending on how the negotiations unfold, the contract terms might change.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "君の努力いかんで、目標達成が可能になるだろう。",
    "expected": "君の努力いかんで、目標達成が可能になるだろう。",
    "reading": "きみのどりょくいかんで、もくひょうたっせいがかのうになるだろう。",
    "english": "Depending on your effort, achieving the goal will become possible.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "今後の業績いかんで、ボーナスの額が決まります。",
    "expected": "今後の業績いかんで、ボーナスの額が決まります。",
    "reading": "こんごのぎょうせきいかんで、ぼーなすのがくがきまります。",
    "english": "The amount of the bonus will be decided depending on future business performance.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "支持率いかんでは、首相は辞任を迫られるかもしれない。",
    "expected": "支持率いかんでは、首相は辞任を迫られるかもしれない。",
    "reading": "しじりついかんでは、しゅしょうはじにんをせまられるかもしれない。",
    "english": "Depending on the approval ratings, the Prime Minister might be forced to resign.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "申請者の資格いかんで、奨学金が授与されるかが決まる。",
    "expected": "申請者の資格いかんで、奨学金が授与されるかが決まる。",
    "reading": "しんせいしゃのしかくいかんで、しょうがくきんがじゅよされるかがきまる。",
    "english": "Whether the scholarship is awarded or not depends on the applicant's qualifications.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "その国の対応いかんによっては、国際的な制裁が科されるだろう。",
    "expected": "その国の対応いかんによっては、国際的な制裁が科されるだろう。",
    "reading": "そのくにのたいおういかんによっては、こくさいてきなせいさいがかされるだろう。",
    "english": "Depending on that country's response, international sanctions will likely be imposed.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "裁判の判決いかんでは、会社の存続が危ぶまれる。",
    "expected": "裁判の判決いかんでは、会社の存続が危ぶまれる。",
    "reading": "さいばんのはんけついかんでは、かいしゃのそんぞくがあやぶまれる。",
    "english": "Depending on the court's verdict, the company's survival is at stake.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "調査の進捗いかんで、報告書の提出時期が前後します。",
    "expected": "調査の進捗いかんで、報告書の提出時期が前後します。",
    "reading": "ちょうさのしんちょくいかんで、ほうこくしょのていしゅつじきがぜんごします。",
    "english": "Depending on the progress of the investigation, the submission date of the report will change.",
    "grammar": "〜いかんだ"
  },
  {
    "spoken": "理由のいかんにかかわらず、遅刻は認められません。",
    "expected": "理由のいかんにかかわらず、遅刻は認められません。",
    "reading": "りゆうのいかんにかかわらず、ちこくはみとめられません。",
    "english": "Regardless of the reason, being late is not permitted.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "国籍のいかんをとわず、この大会には誰でも参加できます。",
    "expected": "国籍のいかんをとわず、この大会には誰でも参加できます。",
    "reading": "こくせきのいかんをとわず、このたいかいにはだれでもさんかできます。",
    "english": "Regardless of nationality, anyone can participate in this tournament.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "経験のいかんによらず、やる気のある方を募集しています。",
    "expected": "経験のいかんによらず、やる気のある方を募集しています。",
    "reading": "けいけんのいかんによらず、やるきのあるかたをぼしゅうしています。",
    "english": "Regardless of experience, we are looking for motivated individuals.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "成績のいかんにかかわらず、すべての学生は卒業論文を提出しなければならない。",
    "expected": "成績のいかんにかかわらず、すべての学生は卒業論文を提出しなければならない。",
    "reading": "せいせきのいかんにかかわらず、すべてのがくせいはそつぎょうろんぶんをていしゅつしなければならない。",
    "english": "Regardless of grades, all students must submit a graduation thesis.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "天候のいかんによらず、明日の試合は決行されます。",
    "expected": "天候のいかんによらず、明日の試合は決行されます。",
    "reading": "てんこうのいかんによらず、あしたのしあいはけっこうされます。",
    "english": "Regardless of the weather, tomorrow's match will be held.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "年齢や性別のいかんをとわず、ボランティアを歓迎します。",
    "expected": "年齢や性別のいかんをとわず、ボランティアを歓迎します。",
    "reading": "ねんれいやせいべつのいかんをとわず、ぼらんてぃあをかんげいします。",
    "english": "We welcome volunteers regardless of age or gender.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "その決定の賛否いかんにかかわらず、私たちは前に進むしかない。",
    "expected": "その決定の賛否いかんにかかわらず、私たちは前に進むしかない。",
    "reading": "そのけっていのさんぴいかんにかかわらず、わたしたちはまえにすすむしかない。",
    "english": "Regardless of whether we agree or disagree with that decision, we have no choice but to move forward.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "収入のいかんによらず、納税の義務はすべての国民にあります。",
    "expected": "収入のいかんによらず、納税の義務はすべての国民にあります。",
    "reading": "しゅうにゅうのいかんによらず、のうぜいのぎむはすべてのこくみんにあります。",
    "english": "Regardless of income, the duty to pay taxes applies to all citizens.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "結果のいかんをとわず、最後まで全力を尽くすことが重要だ。",
    "expected": "結果のいかんをとわず、最後まで全力を尽くすことが重要だ。",
    "reading": "けっかのいかんをとわず、さいごまでぜんりょくをつくすことがじゅうようだ。",
    "english": "Regardless of the outcome, it is important to do your best until the very end.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "事前の連絡のいかんにかかわらず、会議への参加は必須です。",
    "expected": "事前の連絡のいかんにかかわらず、会議への参加は必須です。",
    "reading": "じぜんのれんらくのいかんにかかわらず、かいぎへのさんかはひっすです。",
    "english": "Regardless of prior notification, attendance at the meeting is mandatory.",
    "grammar": "〜いかんにかかわらず・いかんによらず・いかんをとわず"
  },
  {
    "spoken": "彼は度重なる困難をものともせずに、研究を続けた。",
    "expected": "彼は度重なる困難をものともせずに、研究を続けた。",
    "reading": "かれはたびかさなるこんなんをものともせずに、けんきゅうをつづけた。",
    "english": "He continued his research, braving repeated difficulties.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "消防士たちは燃え盛る炎をものともせず、人命救助にあたった。",
    "expected": "消防士たちは燃え盛る炎をものともせず、人命救助にあたった。",
    "reading": "しょうぼうしたちはもえさかるほのおをものともせず、じんめいきゅうじょにあたった。",
    "english": "The firefighters engaged in rescue efforts, braving the raging flames.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "彼女は周囲の批判をものともせずに、自分の信念を貫いた。",
    "expected": "彼女は周囲の批判をものともせずに、自分の信念を貫いた。",
    "reading": "かのじょはしゅういのひはんをものともせずに、じぶんのしんねんをつらぬいた。",
    "english": "She stuck to her beliefs, undeterred by the criticism from those around her.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "選手たちは悪天候をものともせず、素晴らしいパフォーマンスを見せた。",
    "expected": "選手たちは悪天候をものともせず、素晴らしいパフォーマンスを見せた。",
    "reading": "せんしゅたちはあくてんこうをものともせず、すばらしいぱふぉーまんすをみせた。",
    "english": "The athletes showed a wonderful performance, undaunted by the bad weather.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "その登山家は厳しい寒さをものともせずに、山頂を目指した。",
    "expected": "その登山家は厳しい寒さをものともせずに、山頂を目指した。",
    "reading": "そのとざんかはきびしいさむさをものともせずに、さんちょうをめざした。",
    "english": "The mountaineer aimed for the summit, braving the severe cold.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "彼は病気をものともせず、マラソン大会で見事に完走した。",
    "expected": "彼は病気をものともせず、マラソン大会で見事に完走した。",
    "reading": "かれはびょうきをものともせず、まらそんたいかいでみごとにかんそうした。",
    "english": "He successfully completed the marathon, overcoming his illness.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "高齢にもかかわらず、祖父は長旅の疲れをものともせずに観光を楽しんだ。",
    "expected": "高齢にもかかわらず、祖父は長旅の疲れをものともせずに観光を楽しんだ。",
    "reading": "こうれいにもかかわらず、そふはながたびのつかれをものともせずにかんこうをたのしんだ。",
    "english": "Despite his advanced age, my grandfather enjoyed sightseeing, undeterred by the fatigue of the long journey.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "その若い起業家は資金不足をものともせずに、会社を立ち上げた。",
    "expected": "その若い起業家は資金不足をものともせずに、会社を立ち上げた。",
    "reading": "そのわかいきぎょうかはしきんぶそくをものともせずに、かいしゃをたちあげた。",
    "english": "The young entrepreneur started the company, overcoming the lack of funds.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "彼女はプレッシャーをものともせずに、大舞台で実力を発揮した。",
    "expected": "彼女はプレッシャーをものともせずに、大舞台で実力を発揮した。",
    "reading": "かのじょはぷれっしゃーをものともせずに、おおぶたいでじつりょくをはっきした。",
    "english": "She demonstrated her abilities on the big stage, unfazed by the pressure.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "子供たちは降りしきる雨をものともせず、外で遊び続けた。",
    "expected": "子供たちは降りしきる雨をものともせず、外で遊び続けた。",
    "reading": "こどもたちはふりしきるあめをものともせず、そとであそびつづけた。",
    "english": "The children continued playing outside, undeterred by the pouring rain.",
    "grammar": "〜をものともせず（に）"
  },
  {
    "spoken": "親の心配をよそに、彼は危険なスポーツに挑戦し続けている。",
    "expected": "親の心配をよそに、彼は危険なスポーツに挑戦し続けている。",
    "reading": "おやのしんぱいをよそに、かれはきけんなすぽーつにちょうせんしつづけている。",
    "english": "Ignoring his parents' worries, he continues to challenge himself in dangerous sports.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "住民の反対運動をよそに、ダムの建設工事が進められている。",
    "expected": "住民の反対運動をよそに、ダムの建設工事が進められている。",
    "reading": "じゅうみんのはんたいうんどうをよそに、だむのけんせつこうじがすすめられている。",
    "english": "Ignoring the residents' opposition movement, the dam construction is proceeding.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "彼は周りの騒音をよそに、読書に集中していた。",
    "expected": "彼は周りの騒音をよそに、読書に集中していた。",
    "reading": "かれはまわりのそうおんをよそに、どくしょにしゅうちゅうしていた。",
    "english": "He was concentrating on his reading, indifferent to the noise around him.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "株価の急落をよそに、彼は冷静に状況を分析していた。",
    "expected": "株価の急落をよそに、彼は冷静に状況を分析していた。",
    "reading": "かぶかのきゅうらくをよそに、かれはれいせいにじょうきょうをぶんせきしていた。",
    "english": "Ignoring the sharp drop in stock prices, he calmly analyzed the situation.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "世間の批判をよそに、その政治家は自説を曲げなかった。",
    "expected": "世間の批判をよそに、その政治家は自説を曲げなかった。",
    "reading": "せけんのひはんをよそに、そのせいじかはじせつをまげなかった。",
    "english": "Ignoring public criticism, the politician did not bend his own views.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "緊迫した会議の雰囲気をよそに、彼は一人だけあくびをしていた。",
    "expected": "緊迫した会議の雰囲気をよそに、彼は一人だけあくびをしていた。",
    "reading": "きんぱくしたかいぎのふんいきをよそに、かれはひとりだけあくびをしていた。",
    "english": "Ignoring the tense atmosphere of the meeting, he alone was yawning.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "町の急速な変化をよそに、その古い寺は静かに佇んでいた。",
    "expected": "町の急速な変化をよそに、その古い寺は静かに佇んでいた。",
    "reading": "まちのきゅうそくなへんかをよそに、そのふるいてらはしずかにたたずんでいた。",
    "english": "Ignoring the rapid changes in the town, the old temple stood quietly.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "深刻な食糧不足をよそに、一部の地域では食料が廃棄されている。",
    "expected": "深刻な食糧不足をよそに、一部の地域では食料が廃棄されている。",
    "reading": "しんこくなしょくりょうぶそくをよそに、いちぶのちいきではしょくりょうがはいきされている。",
    "english": "Despite the serious food shortage, food is being wasted in some areas.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "国際社会の警告をよそに、その国は核開発を続けている。",
    "expected": "国際社会の警告をよそに、その国は核開発を続けている。",
    "reading": "こくさいしゃかいのけいこくをよそに、そのくにはかくかいはつをつづけている。",
    "english": "Ignoring warnings from the international community, that country continues its nuclear development.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "締め切りが迫っているのをよそに、彼はのんびりとコーヒーを飲んでいた。",
    "expected": "締め切りが迫っているのをよそに、彼はのんびりとコーヒーを飲んでいた。",
    "reading": "しめきりがせまっているのをよそに、かれはのんびりとこーひーをのんでいた。",
    "english": "Ignoring the approaching deadline, he was leisurely drinking coffee.",
    "grammar": "〜をよそに"
  },
  {
    "spoken": "子供ならいざしらず、大人がそんな言い訳をするのはみっともない。",
    "expected": "子供ならいざしらず、大人がそんな言い訳をするのはみっともない。",
    "reading": "こどもならいざしらず、おとながそんないいわけをするのはみっともない。",
    "english": "If it were a child, maybe, but it's embarrassing for an adult to make such excuses.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "新人ならいざしらず、ベテランの君がこんなミスをするなんて信じられない。",
    "expected": "新人ならいざしらず、ベテランの君がこんなミスをするなんて信じられない。",
    "reading": "しんじんならいざしらず、べてらんのきみがこんなみすをするなんてしんじられない。",
    "english": "If you were a newcomer, okay, but I can't believe a veteran like you would make this kind of mistake.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "１０年前ならいざしらず、今時そんな古い型のパソコンを使っている人は珍しい。",
    "expected": "１０年前ならいざしらず、今時そんな古い型のパソコンを使っている人は珍しい。",
    "reading": "じゅうねんまえならいざしらず、いまどきそんなふるいがたのぱそこんをつかっているひとはめずらしい。",
    "english": "If it were 10 years ago, maybe, but nowadays it's rare to find someone using such an old model computer.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "海外旅行ならいざしらず、国内の出張でパスポートが必要になることはない。",
    "expected": "海外旅行ならいざしらず、国内の出張でパスポートが必要になることはない。",
    "reading": "かいがいりょこうならいざしらず、こくないのしゅっちょうでぱすぽーとがひつようになることはない。",
    "english": "If it were international travel, fine, but you don't need a passport for a domestic business trip.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "専門家ならいざしらず、素人の私にはその違いがよく分からない。",
    "expected": "専門家ならいざしらず、素人の私にはその違いがよく分からない。",
    "reading": "せんもんかならいざしらず、しろうとのわたしにはそのちがいがよくわからない。",
    "english": "If you were an expert, maybe, but as an amateur, I don't really understand the difference.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "昔ならいざしらず、現代社会では女性も男性と同じように働くのが普通だ。",
    "expected": "昔ならいざしらず、現代社会では女性も男性と同じように働くのが普通だ。",
    "reading": "むかしならいざしらず、げんだいしゃかいではじょせいもだんせいとおなじようにはたらくのがふつうだ。",
    "english": "If it were the old days, perhaps, but in modern society, it's normal for women to work just like men.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "少しの遅刻ならいざしらず、１時間も遅れるなんて問題外だ。",
    "expected": "少しの遅刻ならいざしらず、１時間も遅れるなんて問題外だ。",
    "reading": "すこしのちこくならいざしらず、いちじかんもおくれるなんてもんだいがいだ。",
    "english": "If you were a little late, okay, but being an hour late is out of the question.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "簡単な料理ならいざしらず、フランス料理のフルコースを作るのは大変だ。",
    "expected": "簡単な料理ならいざしらず、フランス料理のフルコースを作るのは大変だ。",
    "reading": "かんたんなりょうりならいざしらず、ふらんすりょうりのふるこーすをつくるのはたいへんだ。",
    "english": "If it were simple cooking, fine, but making a full-course French meal is a lot of work.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "安い物ならいざしらず、何十万円もする物を即決で買うわけにはいかない。",
    "expected": "安い物ならいざしらず、何十万円もする物を即決で買うわけにはいかない。",
    "reading": "やすいものならいざしらず、なんじゅうまんえんもするものをそっけつでかうわけにはいかない。",
    "english": "If it were something cheap, maybe, but I can't just decide instantly to buy something costing hundreds of thousands of yen.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "田舎の小さな店ならいざしらず、都心の大企業がそんな対応をするとは驚きだ。",
    "expected": "田舎の小さな店ならいざしらず、都心の大企業がそんな対応をするとは驚きだ。",
    "reading": "いなかのちいさなみせならいざしらず、としんのだいきぎょうがそんなたいおうをするとはおどろきだ。",
    "english": "If it were a small shop in the countryside, maybe, but it's surprising that a large company in the city center would handle things that way.",
    "grammar": "〜ならいざしらず"
  },
  {
    "spoken": "会場の熱気は、今にも爆発せんばかりだった。",
    "expected": "会場の熱気は、今にも爆発せんばかりだった。",
    "reading": "かいじょうのねっきは、いまにもばくはつせんばかりだった。",
    "english": "The excitement in the venue was such that it seemed about to explode at any moment.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "彼は全てを知っていると言わんばかりの態度で話し始めた。",
    "expected": "彼は全てを知っていると言わんばかりの態度で話し始めた。",
    "reading": "かれはすべてをしっているといわんばかりのたいどではなしはじめた。",
    "english": "He started talking with an attitude as if to say he knew everything.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "子供たちは、お菓子をもらえると、飛び上がらんばかりに喜んだ。",
    "expected": "子供たちは、お菓子をもらえると、飛び上がらんばかりに喜んだ。",
    "reading": "こどもたちは、おかしをもらえると、とびあがらんばかりに よろこんだ。",
    "english": "When the children were told they'd get sweets, they rejoiced as if they were about to jump for joy.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "祖父は古い写真を見て、涙をこぼさんばかりの表情をしていた。",
    "expected": "祖父は古い写真を見て、涙をこぼさんばかりの表情をしていた。",
    "reading": "そふはふるいしゃしんをみて、なみだをこぼさんばかりのひょうじょうをしていた。",
    "english": "Looking at the old photo, my grandfather had an expression as if he were about to shed tears.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "そのピアニストの演奏は、魂を揺さぶらんばかりの迫力があった。",
    "expected": "そのピアニストの演奏は、魂を揺さぶらんばかりの迫力があった。",
    "reading": "そのぴあにすと のえんそうは、たましいをゆさぶらんばかりのはくりょくがあった。",
    "english": "The pianist's performance had such power it felt as if it could shake one's soul.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "新製品の発表会では、開発者が自信満々と言わんばかりにプレゼンを行った。",
    "expected": "新製品の発表会では、開発者が自信満々と言わんばかりにプレゼンを行った。",
    "reading": "しんせいひんのはっぴょうかいでは、かいはつしゃがじしんまんまんといわんばかりにぷれぜんをおこなった。",
    "english": "At the new product launch, the developer gave a presentation as if to say they were full of confidence.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "ゴールが決まった瞬間、スタジアムは割れんばかりの歓声に包まれた。",
    "expected": "ゴールが決まった瞬間、スタジアムは割れんばかりの歓声に包まれた。",
    "reading": "ごーるがきまったしゅんかん、すたじあむはわれんばかりのかんせいにつつまれた。",
    "english": "The moment the goal was scored, the stadium erupted in cheers that sounded as if it would break.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "その子犬は、捨てられたのか、泣き出さんばかりの目でこちらを見ていた。",
    "expected": "その子犬は、捨てられたのか、泣き出さんばかりの目でこちらを見ていた。",
    "reading": "そのこいぬは、すてられたのか、なきださんばかりのめでこちらをみていた。",
    "english": "The puppy, perhaps abandoned, looked this way with eyes as if it were about to cry.",
    "grammar": "〜んばかりだ"
  },
  {
    "spoken": "彼は議論に勝ったとばかりに、得意げな顔をした。",
    "expected": "彼は議論に勝ったとばかりに、得意げな顔をした。",
    "reading": "かれはぎろんにかったとばかりに、とくいげなかおをした。",
    "english": "He made a triumphant face, as if to say he had won the argument.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "彼女は「もう知らない」とばかりに、ぷいと横を向いた。",
    "expected": "彼女は「もう知らない」とばかりに、ぷいと横を向いた。",
    "reading": "かのじょは「もうしらない」とばかりに、ぷいとよこをむいた。",
    "english": "She turned away sharply, as if to say 'I don't care anymore'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "部長は「あとは任せた」とばかりに、私の肩を軽く叩いて部屋を出て行った。",
    "expected": "部長は「あとは任せた」とばかりに、私の肩を軽く叩いて部屋を出て行った。",
    "reading": "ぶちょうは「あとはまかせた」とばかりに、わたしのかたをかるくたたいてへやをでていった。",
    "english": "The department manager lightly tapped my shoulder and left the room, as if to say 'I'm leaving the rest to you'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "彼は「待ってました」とばかりに、すぐに料理に手を付けた。",
    "expected": "彼は「待ってました」とばかりに、すぐに料理に手を付けた。",
    "reading": "かれは「まってました」とばかりに、すぐにりょうりにてをつけた。",
    "english": "He immediately started eating, as if to say 'I've been waiting for this!'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "犬は「散歩に連れて行って」とばかりに、私の足元で尻尾を振っていた。",
    "expected": "犬は「散歩に連れて行って」とばかりに、私の足元で尻尾を振っていた。",
    "reading": "いぬは「さんぽにつれていって」とばかりに、わたしのあしもとでしっぽをふっていた。",
    "english": "The dog wagged its tail at my feet, as if to say 'Take me for a walk!'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "その知らせを聞いて、彼は「信じられない」とばかりに首を横に振った。",
    "expected": "その知らせを聞いて、彼は「信じられない」とばかりに首を横に振った。",
    "reading": "そのしらせをきいて、かれは「しんじられない」とばかりにくびをよこにふった。",
    "english": "Hearing the news, he shook his head, as if to say 'I can't believe it'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "「邪魔だ」とばかりに、彼は私を押しのけて前に進んだ。",
    "expected": "「邪魔だ」とばかりに、彼は私を押しのけて前に進んだ。",
    "reading": "「じゃまだ」とばかりに、かれはわたしをおしのけてまえにすすんだ。",
    "english": "He pushed me aside and moved forward, as if to say 'You're in the way'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "子供は母親に見せつけるとばかりに、積み木を高く積み上げた。",
    "expected": "子供は母親に見せつけるとばかりに、積み木を高く積み上げた。",
    "reading": "こどもはははおやにみせつけるとばかりに、つみきをたかくつみあげた。",
    "english": "The child stacked the blocks high, as if showing off to his mother.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "店員は「どうぞごゆっくり」とばかりに、にっこり笑って会釈した。",
    "expected": "店員は「どうぞごゆっくり」とばかりに、にっこり笑って会釈した。",
    "reading": "てんいんは「どうぞごゆっくり」とばかりに、にっこりわらってえしゃくした。",
    "english": "The shop assistant smiled and bowed slightly, as if to say 'Please take your time'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "彼女は「手伝いましょうか？」とばかりに、私の荷物を持とうとした。",
    "expected": "彼女は「手伝いましょうか？」とばかりに、私の荷物を持とうとした。",
    "reading": "かのじょは「てつだいましょうか？」とばかりに、わたしのにもつをもとうとした。",
    "english": "She reached for my luggage, as if to say 'Shall I help you?'.",
    "grammar": "〜とばかり（に）"
  },
  {
    "spoken": "テレビを見るともなく見ていたら、突然、緊急地震速報が流れた。",
    "expected": "テレビを見るともなく見ていたら、突然、緊急地震速報が流れた。",
    "reading": "てれびをみるともなくみていたら、とつぜん、きんきゅうじしんそくほうがながれた。",
    "english": "While I was idly watching TV without paying much attention, an emergency earthquake warning suddenly appeared.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "何をするともなく、ただ窓の外の景色を眺めて一日を過ごした。",
    "expected": "何をするともなく、ただ窓の外の景色を眺めて一日を過ごした。",
    "reading": "なにをするともなく、ただまどのそとのけしきをながめていちにちをすごした。",
    "english": "I spent the whole day just gazing out the window, without doing anything in particular.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "どこからともなく、キンモクセイの甘い香りが漂ってきた。",
    "expected": "どこからともなく、キンモクセイの甘い香りが漂ってきた。",
    "reading": "どこからともなく、きんもくせいのあまいかおりがただよってきた。",
    "english": "From somewhere indeterminate, the sweet fragrance of osmanthus drifted over.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "電車の中で聞くともなしに聞いていた会話が、妙に心に残った。",
    "expected": "電車の中で聞くともなしに聞いていた会話が、妙に心に残った。",
    "reading": "でんしゃのなかできくともなしにきいていたかいわが、みょうにこころにのこった。",
    "english": "A conversation I overheard on the train without really listening somehow stuck in my mind.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "いつからともなく、この古い寺は地域のシンボルとして親しまれている。",
    "expected": "いつからともなく、この古い寺は地域のシンボルとして親しまれている。",
    "reading": "いつからともなく、このふるいてらはちいきのしんぼるとしてしたしまれている。",
    "english": "Since sometime unknown, this old temple has been cherished as a symbol of the region.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "彼は誰に言うともなく、深い溜息をついた。",
    "expected": "彼は誰に言うともなく、深い溜息をついた。",
    "reading": "かれはだれにいうともなく、ふかいためいきをついた。",
    "english": "He let out a deep sigh, not directed at anyone in particular.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "カーラジオから流れるともなしに聞いていた曲が、昔好きだった歌だと気づいた。",
    "expected": "カーラジオから流れるともなしに聞いていた曲が、昔好きだった歌だと気づいた。",
    "reading": "かーらじおからながれるともなしにきいていたきょくが、むかしすきだったうただときづいた。",
    "english": "I realized the song playing idly on the car radio was one I used to love.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "公園のベンチに座り、何を見るともなく遠くの空を眺めていた。",
    "expected": "公園のベンチに座り、何を見るともなく遠くの空を眺めていた。",
    "reading": "こうえんのべんちにすわり、なにをみるともなくとおくのそらをながめていた。",
    "english": "Sitting on a park bench, I gazed at the distant sky without looking at anything in particular.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "どこへ行くともなしに、あてもなく街を歩き続けた。",
    "expected": "どこへ行くともなしに、あてもなく街を歩き続けた。",
    "reading": "どこへいくともなしに、あてもなくまちをあるきつづけた。",
    "english": "I kept walking aimlessly through the town, without any particular destination in mind.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "書斎で本を読むともなくページをめくっていたら、眠ってしまった。",
    "expected": "書斎で本を読むともなくページをめくっていたら、眠ってしまった。",
    "reading": "しょさいでほんをよむともなくぺーじをめくっていたら、ねむってしまった。",
    "english": "While idly turning the pages of a book in the study without really reading, I fell asleep.",
    "grammar": "〜ともなく・ともなしに"
  },
  {
    "spoken": "彼女は生まれながらにして、人を惹きつける魅力を持っていた。",
    "expected": "彼女は生まれながらにして、人を惹きつける魅力を持っていた。",
    "reading": "かのじょはうまれながらにして、ひとをひきつけるみりょくをもっていた。",
    "english": "She possessed a charm that attracted people, right from birth.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "インターネットの普及により、家にいながらにして世界中の情報が手に入るようになった。",
    "expected": "インターネットの普及により、家にいながらにして世界中の情報が手に入るようになった。",
    "reading": "いんたーねっとのふきゅうにより、いえにいながらにしてせかいじゅうのじょうほうがてにはいるようになった。",
    "english": "Thanks to the spread of the internet, we can now access information from all over the world while staying at home.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "彼は涙ながらに、これまでの苦労と成功について語った。",
    "expected": "彼は涙ながらに、これまでの苦労と成功について語った。",
    "reading": "かれはなみだながらに、これまでのくろうとせいこうについてかたった。",
    "english": "In tears, he talked about his past struggles and successes.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "昔ながらの製法を守り続けることが、この店の誇りです。",
    "expected": "昔ながらの製法を守り続けることが、この店の誇りです。",
    "reading": "むかしながらのせいほうをまもりつづけることが、このみせのほこりです。",
    "english": "Continuing to preserve the traditional manufacturing method is the pride of this shop.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "その作家は、いつもながらに鋭い社会風刺を作品に込めている。",
    "expected": "その作家は、いつもながらに鋭い社会風刺を作品に込めている。",
    "reading": "そのさっかは、いつもながらにするどいしゃかいふうしをさくひんにこめている。",
    "english": "That author, as always, incorporates sharp social satire into their works.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "彼は病床にありながらにして、会社の経営について指示を出していた。",
    "expected": "彼は病床にありながらにして、会社の経営について指示を出していた。",
    "reading": "かれはびょうしょうにありながらにして、かいしゃのけいえいについてしじをだしていた。",
    "english": "Even while confined to his sickbed, he gave instructions regarding the company's management.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "この地域では、古くながらの習慣が今も大切に受け継がれている。",
    "expected": "この地域では、古くながらの習慣が今も大切に受け継がれている。",
    "reading": "このちいきでは、ふるくながらのしゅうかんがいまもたいせつにうけつがれている。",
    "english": "In this region, age-old customs are still carefully passed down today.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "彼女は従来ながらの考え方にとらわれず、新しいアイデアを次々と生み出した。",
    "expected": "彼女は従来ながらの考え方にとらわれず、新しいアイデアを次々と生み出した。",
    "reading": "かのじょはじゅうらいながらのかんがえかたにとらわれず、あたらしいあいであをつぎつぎとうみだした。",
    "english": "Unbound by conventional ways of thinking, she generated one new idea after another.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "その老舗旅館は、昔ながらの佇まいとおもてなしで人気を集めている。",
    "expected": "その老舗旅館は、昔ながらの佇まいとおもてなしで人気を集めている。",
    "reading": "そのしにせりょかんは、むかしながらのたたずまいとおもてなしでにんきをあつめている。",
    "english": "That long-established inn attracts popularity with its traditional appearance and hospitality.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "彼は遺憾ながらに、プロジェクトの中止を決定した。",
    "expected": "彼は遺憾ながらに、プロジェクトの中止を決定した。",
    "reading": "かれはいかんながらに、ぷろじぇくとのちゅうしをけっていした。",
    "english": "Regrettably, he decided to cancel the project.",
    "grammar": "〜ながらに（して）"
  },
  {
    "spoken": "彼はどうも物事を悲観的に考えるきらいがある。",
    "expected": "彼はどうも物事を悲観的に考えるきらいがある。",
    "reading": "かれはどうもものごとをひかんてきにかんがえるきらいがある。",
    "english": "He somehow has a tendency to think pessimistically about things.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "最近の若者は、活字離れが進んでいるきらいがあると言われている。",
    "expected": "最近の若者は、活字離れが進んでいるきらいがあると言われている。",
    "reading": "さいきんのわかものは、かつじばなれがすすんでいるきらいがあるといわれている。",
    "english": "It is said that young people recently have a tendency towards moving away from print media.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "あの政治家は、演説で大風呂敷を広げるきらいがある。",
    "expected": "あの政治家は、演説で大風呂敷を広げるきらいがある。",
    "reading": "あのせいじかは、えんぜつでおおぶろしきをひろげるきらいがある。",
    "english": "That politician has a tendency to make grandiose promises in speeches.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "彼は優秀だが、少し独断専行のきらいがあるため、チームワークが課題だ。",
    "expected": "彼は優秀だが、少し独断専行のきらいがあるため、チームワークが課題だ。",
    "reading": "かれはゆうしゅうだが、すこしどくだんせんこうのきらいがあるため、ちーむわーくがかだいだ。",
    "english": "He is talented, but teamwork is an issue because he has a slight tendency to act arbitrarily.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "うちの部長は、細かいことにこだわりすぎるきらいがある。",
    "expected": "うちの部長は、細かいことにこだわりすぎるきらいがある。",
    "reading": "うちのぶちょうは、こまかいことにこだわりすぎるきらいがある。",
    "english": "My department manager has a tendency to fuss too much over minor details.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "彼は自分の意見を押し通そうとするきらいがあるので、議論が長引くことが多い。",
    "expected": "彼は自分の意見を押し通そうとするきらいがあるので、議論が長引くことが多い。",
    "reading": "かれはじぶんのいけんをおしとおそうとするきらいがあるので、ぎろんがながびくことがおおい。",
    "english": "He has a tendency to try and push his own opinions, so discussions often drag on.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "現代社会は、何でも効率を優先するきらいがあるのではないだろうか。",
    "expected": "現代社会は、何でも効率を優先するきらいがあるのではないだろうか。",
    "reading": "げんだいしゃかいは、なんでもこうりつをゆうせんするきらいがあるのではないだろうか。",
    "english": "Doesn't modern society seem to have a tendency to prioritize efficiency in everything?",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "彼女は少しお節介なきらいがあるが、根は親切な人だ。",
    "expected": "彼女は少しお節介なきらいがあるが、根は親切な人だ。",
    "reading": "かのじょはすこしおせっかいなきらいがあるが、ねはしんせつなひとだ。",
    "english": "She has a tendency to be a bit meddlesome, but she is fundamentally a kind person.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "彼は会議で難しい専門用語を多用するきらいがある。",
    "expected": "彼は会議で難しい専門用語を多用するきらいがある。",
    "reading": "かれはかいぎでむずかしいせんもんようごをたようするきらいがある。",
    "english": "He has a tendency to overuse difficult technical terms in meetings.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "この種の調査は、回答者の主観に左右されるきらいがあることを考慮すべきだ。",
    "expected": "この種の調査は、回答者の主観に左右されるきらいがあることを考慮すべきだ。",
    "reading": "このしゅのちょうさは、かいとうしゃのしゅかんにさゆうされるきらいがあることをこうりょすべきだ。",
    "english": "It should be considered that this type of survey has a tendency to be influenced by the respondents' subjectivity.",
    "grammar": "〜きらいがある"
  },
  {
    "spoken": "お忙しいところを申し訳ありませんが、少々お時間をいただけますでしょうか。",
    "expected": "お忙しいところを申し訳ありませんが、少々お時間をいただけますでしょうか。",
    "reading": "おいそがしいところをもうしわけありませんが、しょうしょうおじかんをいただけますでしょうか。",
    "english": "I apologize for bothering you while you're busy, but could I have a little of your time?",
    "grammar": "〜ところを"
  },
  {
    "spoken": "ちょうど出かけようとしていたところを呼び止めてしまって、すみません。",
    "expected": "ちょうど出かけようとしていたところを呼び止めてしまって、すみません。",
    "reading": "ちょうどでかけようとしていたところをよびとめてしまって、すみません。",
    "english": "I'm sorry for stopping you just as you were about to leave.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "お話し中のところを失礼いたします。緊急のご連絡です。",
    "expected": "お話し中のところを失礼いたします。緊急のご連絡です。",
    "reading": "おはなしちゅうのところをしつれいいたします。きんきゅうのごれんらくです。",
    "english": "Excuse me for interrupting while you're talking. There is an urgent message.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "彼がまさに重要な決断を下そうとしているところを、邪魔するわけにはいかない。",
    "expected": "彼がまさに重要な決断を下そうとしているところを、邪魔するわけにはいかない。",
    "reading": "かれがまさにじゅうようなけつだんをくだそうとしているところを、じゃまするわけにはいかない。",
    "english": "I can't possibly interfere just when he is about to make an important decision.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "寝込んでいるところを見舞いに来てくれて、本当にありがとう。",
    "expected": "寝込んでいるところを見舞いに来てくれて、本当にありがとう。",
    "reading": "ねこんでいるところをみまいにきてくれて、ほんとうにありがとう。",
    "english": "Thank you so much for coming to visit me while I was sick in bed.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "私がうたた寝しているところを、子供に見られてしまった。",
    "expected": "私がうたた寝しているところを、子供に見られてしまった。",
    "reading": "わたしがうたたねしているところを、こどもにみられてしまった。",
    "english": "My child saw me dozing off.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "危険なところを助けていただき、感謝の言葉もありません。",
    "expected": "危険なところを助けていただき、感謝の言葉もありません。",
    "reading": "きけんなところをたすけていただき、かんしゃのことばもありません。",
    "english": "I have no words to express my gratitude for saving me from danger.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "会議の準備で立て込んでいるところを悪いんだけど、この書類を確認してくれない？",
    "expected": "会議の準備で立て込んでいるところを悪いんだけど、この書類を確認してくれない？",
    "reading": "かいぎのじゅんびでたてこんでいるところをわるいんだけど、このしょるいをかくにんしてくれない？",
    "english": "Sorry to bother you when you're busy preparing for the meeting, but could you check this document?",
    "grammar": "〜ところを"
  },
  {
    "spoken": "閉店間際のところを無理を言って、商品を取り置きしてもらった。",
    "expected": "閉店間際のところを無理を言って、商品を取り置きしてもらった。",
    "reading": "へいてんまぎわのところをむりをいって、しょうひんをとりおきしてもらった。",
    "english": "Even though it was just before closing time, I asked them to hold the product for me, and they did.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "子供がこっそりお菓子を食べているところを、母親に見つかってしまった。",
    "expected": "子供がこっそりお菓子を食べているところを、母親に見つかってしまった。",
    "reading": "こどもがこっそりおかしをたべているところを、ははおやにみつかってしまった。",
    "english": "The child was caught by their mother secretly eating snacks.",
    "grammar": "〜ところを"
  },
  {
    "spoken": "早く予約すれば良い席が取れたものを、ぐずぐずしていたから満席になってしまった。",
    "expected": "早く予約すれば良い席が取れたものを、ぐずぐずしていたから満席になってしまった。",
    "reading": "はやくよやくすればよいせきがとれたものを、ぐずぐずしていたからまんせきになってしまった。",
    "english": "If I had booked earlier, I could have gotten good seats, but since I procrastinated, it became fully booked.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "一言謝れば済んだものを、意地を張ったせいで関係が悪化した。",
    "expected": "一言謝れば済んだものを、意地を張ったせいで関係が悪化した。",
    "reading": "ひとことあやまればすんだものを、いじをはったせい ގ かんけいがあっかした。",
    "english": "It would have been settled with a simple apology, but relations worsened because I was stubborn.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "経験者の忠告を聞いておけばよかったものを、無視したばかりに失敗した。",
    "expected": "経験者の忠告を聞いておけばよかったものを、無視したばかりに失敗した。",
    "reading": "けいけんしゃのちゅうこくをきいておけばよかったものを、むししたばかりにしっぱいした。",
    "english": "I should have listened to the experienced person's advice, but I failed precisely because I ignored it.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "せっかくのチャンスだったものを、準備不足で逃してしまった。",
    "expected": "せっかくのチャンスだったものを、準備不足で逃してしまった。",
    "reading": "せっかくのちゃんすだったものを、じゅんびぶそくでにがしてしまった。",
    "english": "It was a great chance, but I missed it due to lack of preparation.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "もっと慎重に計画を立てれば成功したかもしれないものを、焦りすぎたのが敗因だ。",
    "expected": "もっと慎重に計画を立てれば成功したかもしれないものを、焦りすぎたのが敗因だ。",
    "reading": "もっとしんちょうにけいかくをたてればせいこうしたかもしれないものを、あせりすぎたのがはいいんだ。",
    "english": "If we had planned more carefully, we might have succeeded, but being too hasty was the cause of failure.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "黙っていれば秘密が守れたものを、つい口を滑らせてしまった。",
    "expected": "黙っていれば秘密が守れたものを、つい口を滑らせてしまった。",
    "reading": "だまっていればひみつがまもれたものを、ついくちをすべらせてしまった。",
    "english": "If I had kept quiet, the secret could have been kept, but I accidentally let it slip.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "ちゃんと確認すれば簡単なミスに気づけたものを、見落として提出してしまった。",
    "expected": "ちゃんと確認すれば簡単なミスに気づけたものを、見落として提出してしまった。",
    "reading": "ちゃんとかくにんすればかんたんなみすにきづけたものを、みおとしてていしゅつしてしまった。",
    "english": "If I had checked properly, I could have noticed the simple mistake, but I overlooked it and submitted it.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "あの時正直に話していれば誤解されなかったものを、隠そうとしたから余計に怪しまれた。",
    "expected": "あの時正直に話していれば誤解されなかったものを、隠そうとしたから余計に怪しまれた。",
    "reading": "あのときしょうじきにはなしていればごかいされなかったものを、かくそうとしたからよけいにあやしまれた。",
    "english": "If I had spoken honestly then, I wouldn't have been misunderstood, but because I tried to hide it, I became even more suspicious.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "もう少し頑張れば目標達成できたものを、途中で諦めてしまった。",
    "expected": "もう少し頑張れば目標達成できたものを、途中で諦めてしまった。",
    "reading": "もうすこしがんばればもくひょうたっせいできたものを、とちゅうであきらめてしまった。",
    "english": "If I had tried a little harder, I could have achieved the goal, but I gave up halfway.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "天気が良ければ最高の景色が見られたものを、あいにくの霧で何も見えなかった。",
    "expected": "天気が良ければ最高の景色が見られたものを、あいにくの霧で何も見えなかった。",
    "reading": "てんきがよければさいこうのけしきがみられたものを、あいにくのきりでなにもみえなかった。",
    "english": "If the weather had been good, we could have seen the best scenery, but unfortunately, we couldn't see anything because of the fog.",
    "grammar": "〜ものを"
  },
  {
    "spoken": "４月になったとはいえ、まだ肌寒い日が続いている。",
    "expected": "４月になったとはいえ、まだ肌寒い日が続いている。",
    "reading": "しがつになったとはいえ、まだはだざむいひがつづいている。",
    "english": "Although it's April, chilly days still continue.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "最新の設備を導入したとはいえ、すぐに生産性が倍増するわけではない。",
    "expected": "最新の設備を導入したとはいえ、すぐに生産性が倍増するわけではない。",
    "reading": "さいしんのせつびをどうにゅうしたとはいえ、すぐにせいさんせいがばいぞうするわけではない。",
    "english": "Even though we've introduced the latest equipment, it doesn't mean productivity will double immediately.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "彼はまだ若いとはいえ、その分野では第一人者として認められている。",
    "expected": "彼はまだ若いとはいえ、その分野では第一人者として認められている。",
    "reading": "かれはまだわかいとはいえ、そのぶんやではだいいちにんしゃとしてみとめられている。",
    "english": "Although he is still young, he is recognized as a leading figure in that field.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "理論上は可能だとはいえ、実現するには多くの課題が残っている。",
    "expected": "理論上は可能だとはいえ、実現するには多くの課題が残っている。",
    "reading": "りろんじょうはかのうだとはいえ、じつげんするにはおおくのかだいがのこっている。",
    "english": "Although it's theoretically possible, many challenges remain to realize it.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "セールで安くなっていたとはいえ、予定外の大きな買い物をしてしまった。",
    "expected": "セールで安くなっていたとはいえ、予定外の大きな買い物をしてしまった。",
    "reading": "せーるでやすくなっていたとはいえ、よていがいのおおきなかいものをしてしまった。",
    "english": "Even though it was cheap on sale, I ended up making a large, unplanned purchase.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "謝罪を受けたとはいえ、完全にわだかまりが消えたわけではない。",
    "expected": "謝罪を受けたとはいえ、完全にわだかまりが消えたわけではない。",
    "reading": "しゃざいをうけたとはいえ、かんぜんにわだかまりがきえたわけではない。",
    "english": "Although I received an apology, the ill feelings haven't completely disappeared.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "日本語能力試験N1に合格したとはいえ、ネイティブのように話せるわけではない。",
    "expected": "日本語能力試験N1に合格したとはいえ、ネイティブのように話せるわけではない。",
    "reading": "にほんごのうりょくしけんN1にごうかくしたとはいえ、ねいてぃぶのようにはなせるわけではない。",
    "english": "Even though I passed the JLPT N1, it doesn't mean I can speak like a native.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "都会は便利だとはいえ、時には自然の中で静かに過ごしたくなる。",
    "expected": "都会は便利だとはいえ、時には自然の中で静かに過ごしたくなる。",
    "reading": "とかいはべんりだとはいえ、ときにはしぜんのなかでしずかにすごしたくなる。",
    "english": "Although the city is convenient, sometimes I want to spend time quietly in nature.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "景気は回復傾向にあるとはいえ、中小企業の経営は依然として厳しい。",
    "expected": "景気は回復傾向にあるとはいえ、中小企業の経営は依然として厳しい。",
    "reading": "けいきはかいふくけいこうにあるとはいえ、ちゅうしょうきぎょうのけいえいはいぜんとしてきびしい。",
    "english": "Although the economy is tending towards recovery, management of small and medium-sized enterprises remains severe.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "説明書を読んだとはいえ、実際に操作してみると難しい部分がある。",
    "expected": "説明書を読んだとはいえ、実際に操作してみると難しい部分がある。",
    "reading": "せつめいしょをよんだとはいえ、じっさいにそうさしてみるとむずかしいぶぶんがある。",
    "english": "Even though I read the instruction manual, there are difficult parts when I actually try to operate it.",
    "grammar": "〜とはいえ"
  },
  {
    "spoken": "百戦錬磨の彼といえども、今回の交渉は難航しているようだ。",
    "expected": "百戦錬磨の彼といえども、今回の交渉は難航しているようだ。",
    "reading": "ひゃくせんれんまのかれといえども、こんかいのこうしょうはなんこうしているようだ。",
    "english": "Even for him, a veteran of a hundred battles, these negotiations seem to be difficult.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "専門家といえども、未来の出来事を完全に予測することはできない。",
    "expected": "専門家といえども、未来の出来事を完全に予測することはできない。",
    "reading": "せんもんかといえども、みらいのできごとをかんぜんによそくすることはできない。",
    "english": "Even experts cannot completely predict future events.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "いかなる理由があるといえども、法を破ることは許されない。",
    "expected": "いかなる理由があるといえども、法を破ることは許されない。",
    "reading": "いかなるりゆうがあるといえども、ほうをやぶることはゆるされない。",
    "english": "Whatever the reason may be, breaking the law is not permitted.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "子供といえども、一人の人間として尊重すべきだ。",
    "expected": "子供といえども、一人の人間として尊重すべきだ。",
    "reading": "こどもといえども、ひとりのにんげんとしてそんちょうすべきだ。",
    "english": "Even a child should be respected as an individual human being.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "たとえ親友といえども、お金の貸し借りには慎重になるべきだ。",
    "expected": "たとえ親友といえども、お金の貸し借りには慎重になるべきだ。",
    "reading": "たとえしんゆうといえども、おかねのかしかりにはしんちょうになるべきだ。",
    "english": "Even with a close friend, one should be cautious about lending or borrowing money.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "わずかな金額といえども、積もり積もれば大きな負担になる。",
    "expected": "わずかな金額といえども、積もり積もれば大きな負担になる。",
    "reading": "わずかなきんがくといえども、つもりつもればおおきなふたんになる。",
    "english": "Even a small amount of money can become a large burden if it accumulates.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "最新技術といえども、万能ではなく限界があることを理解する必要がある。",
    "expected": "最新技術といえども、万能ではなく限界があることを理解する必要がある。",
    "reading": "さいしんぎじゅつといえども、ばんのうではなくげんかいがあることをりかいするひつようがある。",
    "english": "It is necessary to understand that even the latest technology is not omnipotent and has limits.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "社長といえども、会社の規則には従わなければならない。",
    "expected": "社長といえども、会社の規則には従わなければならない。",
    "reading": "しゃちょうといえども、かいしゃのきそくにはしたがわなければならない。",
    "english": "Even the company president must follow the company rules.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "どんなに多忙といえども、健康管理を怠ってはならない。",
    "expected": "どんなに多忙といえども、健康管理を怠ってはならない。",
    "reading": "どんなにたぼうといえども、けんこうかんりをおこたってはならない。",
    "english": "No matter how busy one may be, health management should not be neglected.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "大企業の役員といえども、不祥事を起こせばその地位を失う。",
    "expected": "大企業の役員といえども、不祥事を起こせばその地位を失う。",
    "reading": "だいきぎょうのやくいんといえども、ふしょうじをおこせばそのちいをうしなう。",
    "english": "Even executives of large corporations will lose their positions if they cause a scandal.",
    "grammar": "〜といえども"
  },
  {
    "spoken": "試験は非常に難しいだろうと思いきや、意外と基本的な問題が多かった。",
    "expected": "試験は非常に難しいだろうと思いきや、意外と基本的な問題が多かった。",
    "reading": "しけんはひじょうにむずかしいだろうとおもいきや、いがいときほんてきなもんだいがおおかった。",
    "english": "I thought the exam would be extremely difficult, but surprisingly, there were many basic questions.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "彼は怒っているだろうと思いきや、笑顔で迎えてくれた。",
    "expected": "彼は怒っているだろうと思いきや、笑顔で迎えてくれた。",
    "reading": "かれはおこっているだろうとおもいきや、えがおでむかえてくれた。",
    "english": "I thought he would be angry, but instead, he greeted me with a smile.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "もう売り切れているだろうと思いきや、最後の一個を手に入れることができた。",
    "expected": "もう売り切れているだろうと思いきや、最後の一個を手に入れることができた。",
    "reading": "もううりきれているだろうとおもいきや、さいごのいっこをてにいれることができた。",
    "english": "I thought it would be sold out already, but I managed to get the very last one.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "交渉は決裂するかと思いきや、土壇場で合意に至った。",
    "expected": "交渉は決裂するかと思いきや、土壇場で合意に至った。",
    "reading": "こうしょうはけつれつするかとおもいきや、どたんばでごういにいたった。",
    "english": "I thought the negotiations would break down, but we reached an agreement at the last minute.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "今日のプレゼンは失敗するだろうと思いきや、驚くほどうまくいった。",
    "expected": "今日のプレゼンは失敗するだろうと思いきや、驚くほどうまくいった。",
    "reading": "きょうのぷれぜんはしっぱいするだろうとおもいきや、おどろくほどうまくいった。",
    "english": "I thought today's presentation would be a failure, but it went surprisingly well.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "目的地まで遠いと思いきや、新しい道路ができていてすぐに着いた。",
    "expected": "目的地まで遠いと思いきや、新しい道路ができていてすぐに着いた。",
    "reading": "もくてきちまでとおいとおもいきや、あたらしいどうろができていてすぐについた。",
    "english": "I thought it was far to the destination, but a new road had been built, and we arrived quickly.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "彼は誘いを断るだろうと思いきや、二つ返事で引き受けてくれた。",
    "expected": "彼は誘いを断るだろうと思いきや、二つ返事で引き受けてくれた。",
    "reading": "かれはさそいをことわるだろうとおもいきや、ふたつへんじでひきうけてくれた。",
    "english": "I thought he would decline the invitation, but he accepted readily.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "あのレストランは高いだろうと思いきや、手頃な値段で美味しかった。",
    "expected": "あのレストランは高いだろうと思いきや、手頃な値段で美味しかった。",
    "reading": "あのれすとらんはたかいだろうとおもいきや、てごろなねだんでおいしかった。",
    "english": "I thought that restaurant would be expensive, but it was reasonably priced and delicious.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "これで万事解決と思いきや、また新たな問題が発生した。",
    "expected": "これで万事解決と思いきや、また新たな問題が発生した。",
    "reading": "これでばんじかいけつとおもいきや、またあらたなもんだいがはっせいした。",
    "english": "Just when I thought everything was resolved, another new problem arose.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "彼は冗談を言っていると思いきや、本気だったことが後でわかった。",
    "expected": "彼は冗談を言っていると思いきや、本気だったことが後でわかった。",
    "reading": "かれはじょうだんをいっているとおもいきや、ほんきだったことがあとでわかった。",
    "english": "I thought he was joking, but later I realized he was serious.",
    "grammar": "〜と思いきや"
  },
  {
    "spoken": "愛する家族のためとあれば、どんな困難にも立ち向かう覚悟がある。",
    "expected": "愛する家族のためとあれば、どんな困難にも立ち向かう覚悟がある。",
    "reading": "あいするかぞくのためとあれば、どんなこんなんにもたちむかうかくごがある。",
    "english": "If it's for my beloved family, I'm prepared to face any hardship.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "社長命令とあれば、たとえ休日でも出社せざるを得ない。",
    "expected": "社長命令とあれば、たとえ休日でも出社せざるを得ない。",
    "reading": "しゃちょうめいれいとあれば、たとえきゅうじつでもしゅっしゃせざるをえない。",
    "english": "If it's an order from the president, I have no choice but to go to the office, even on a day off.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "お客様のご要望とあれば、可能な限り対応させていただきます。",
    "expected": "お客様のご要望とあれば、可能な限り対応させていただきます。",
    "reading": "おきゃくさまのごようぼうとあれば、かのうなかぎりたいおうさせていただきます。",
    "english": "If it's the customer's request, we will accommodate it as much as possible.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "一度きりの人生とあれば、後悔しないように生きたいものだ。",
    "expected": "一度きりの人生とあれば、後悔しないように生きたいものだ。",
    "reading": "いちどきりのじんせいとあれば、こうかいしないようにいきたいものだ。",
    "english": "Given that we only have one life, I want to live without regrets.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "どうしても必要とあれば、私の貯金を貸しましょう。",
    "expected": "どうしても必要とあれば、私の貯金を貸しましょう。",
    "reading": "どうしてもひつようとあれば、わたしのちょきんをかしましょう。",
    "english": "If it's absolutely necessary, I'll lend you my savings.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "国家の危機とあれば、国民は一致団結して乗り越えなければならない。",
    "expected": "国家の危機とあれば、国民は一致団結して乗り越えなければならない。",
    "reading": "こっかのききとあれば、こくみんはいっちだんけつのりこえなければならない。",
    "english": "If it's a national crisis, the citizens must unite and overcome it.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "友人の頼みとあれば、少々無理をしてでも力になりたい。",
    "expected": "友人の頼みとあれば、少々無理をしてでも力になりたい。",
    "reading": "ゆうじんのたのみとあれば、しょうしょうむりをしてでもちからになりたい。",
    "english": "If it's a request from a friend, I want to help, even if it requires some extra effort.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "優勝がかかっているとあれば、選手たちは最高のパフォーマンスを発揮するだろう。",
    "expected": "優勝がかかっているとあれば、選手たちは最高のパフォーマンスを発揮するだろう。",
    "reading": "ゆうしょうがかかっているとあれば、せんしゅたちはさいこうのぱふぉーまんすをはっきするだろう。",
    "english": "If the championship is at stake, the players will likely deliver their best performance.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "絶好のチャンスとあれば、逃すわけにはいかない。",
    "expected": "絶好のチャンスとあれば、逃すわけにはいかない。",
    "reading": "ぜっこうのちゃんすとあれば、のがすわけにはいかない。",
    "english": "If it's a golden opportunity, I can't afford to miss it.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "子供の教育のためとあれば、親は転居さえも考える。",
    "expected": "子供の教育のためとあれば、親は転居さえも考える。",
    "reading": "こどものきょういくのためとあれば、おやはてんきょさえもかんがえる。",
    "english": "If it's for their child's education, parents will even consider relocating.",
    "grammar": "〜とあれば"
  },
  {
    "spoken": "一度その秘密を口外したが最後、彼は社会的に抹殺されるだろう。",
    "expected": "一度その秘密を口外したが最後、彼は社会的に抹殺されるだろう。",
    "reading": "いちどそのひみつをこうがいしたがさいご、かれはしゃかいてきにまっさつされるだろう。",
    "english": "Once he reveals that secret, he will surely be socially ruined.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "うちの犬は一度外へ逃げ出したが最後、なかなか捕まらない。",
    "expected": "うちの犬は一度外へ逃げ出したが最後、なかなか捕まらない。",
    "reading": "うちのいぬはいちどそとへにげだしたがさいご、なかなか捕まらない。",
    "english": "Once our dog escapes outside, it's really hard to catch him.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "彼はマイクを握ったが最後、朝まで離さないカラオケ好きだ。",
    "expected": "彼はマイクを握ったが最後、朝まで離さないカラオケ好きだ。",
    "reading": "かれはまいくをにぎったがさいご、あさまではなさないからおけずきだ。",
    "english": "Once he grabs the microphone, he's the type of karaoke lover who won't let go until morning.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "あの頑固な父を怒らせたら最後、誰にも止められない。",
    "expected": "あの頑固な父を怒らせたら最後、誰にも止められない。",
    "reading": "あのがんこなちちをおこらせたらさいご、だれにもとめられない。",
    "english": "If you anger my stubborn father, nobody can stop him once he gets going.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "重要なデータを一度消去したが最後、復旧はほぼ不可能だ。",
    "expected": "重要なデータを一度消去したが最後、復旧はほぼ不可能だ。",
    "reading": "じゅうようなでーたをいちどしょうきょしたがさいご、ふっきゅうはほぼふかのうだ。",
    "english": "Once you delete the important data, recovery is almost impossible.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "あの子に甘いものを与えたら最後、際限なく欲しがるから注意が必要だ。",
    "expected": "あの子に甘いものを与えたら最後、際限なく欲しがるから注意が必要だ。",
    "reading": "あのこにあまいものをあたえたらさいご、さいげんなくほしがるからちゅういがひつようだ。",
    "english": "Be careful, because if you give that child sweets, they'll want them endlessly.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "信用を一度失ったが最後、取り戻すのは容易ではない。",
    "expected": "信用を一度失ったが最後、取り戻すのは容易ではない。",
    "reading": "しんようをいちどうしなったがさいご、とりもどすのはよういではない。",
    "english": "Once trust is lost, it is not easy to regain it.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "あの山道は一度迷い込んだら最後、日が暮れるまでに出られないかもしれない。",
    "expected": "あの山道は一度迷い込んだら最後、日が暮れるまでに出られないかもしれない。",
    "reading": "あのやまみちはいちどまよいこんだらさいご、ひがくれるまでにでられないかもしれない。",
    "english": "If you get lost on that mountain path, you might not be able to get out before dark.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "彼は賭け事に手を出したが最後、借金地獄に陥ってしまった。",
    "expected": "彼は賭け事に手を出したが最後、借金地獄に陥ってしまった。",
    "reading": "かれはかけごとにてをだしたがさいご、しゃっきんじごくにおちいってしまった。",
    "english": "Once he started gambling, he fell into a hell of debt.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "この契約書にサインしたら最後、もう後戻りはできない。",
    "expected": "この契約書にサインしたら最後、もう後戻りはできない。",
    "reading": "このけいやくしょにさいんしたらさいご、もうあともどりはできない。",
    "english": "Once you sign this contract, there's no turning back.",
    "grammar": "〜たら最後・〜たが最後"
  },
  {
    "spoken": "会議に毎回遅刻するようでは、社会人としての自覚が足りないと言われても仕方ない。",
    "expected": "会議に毎回遅刻するようでは、社会人としての自覚が足りないと言われても仕方ない。",
    "reading": "かいぎにまいかいちこくするようでは、しゃかいじんとしてのじかくがたりないといわれてもしかたない。",
    "english": "If you're always late for meetings, it can't be helped if people say you lack awareness as a working adult.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "こんな初歩的なミスを犯すようでは、大事な仕事を任せることはできない。",
    "expected": "こんな初歩的なミスを犯すようでは、大事な仕事を任せることはできない。",
    "reading": "こんなしょほてきなみすをおかすようでは、だいじなしごとをまかせることはできない。",
    "english": "If you make basic mistakes like this, I can't entrust important tasks to you.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "若者が政治に無関心なようでは、この国の将来が案じられる。",
    "expected": "若者が政治に無関心なようでは、この国の将来が案じられる。",
    "reading": "わかものがせいじにむかんしんなようでは、このくにのしょうらいがあんじられる。",
    "english": "If young people are indifferent to politics, I worry about the future of this country.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "練習もせずに試合に臨むようでは、勝てるはずがない。",
    "expected": "練習もせずに試合に臨むようでは、勝てるはずがない。",
    "reading": "れんしゅうもせずにしあいにのぞむようでは、かてるはずがない。",
    "english": "If you go into the match without practicing, there's no way you can win.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "部下の失敗を全て自分の責任にしないようでは、上司失格だ。",
    "expected": "部下の失敗を全て自分の責任にしないようでは、上司失格だ。",
    "reading": "ぶかのしっぱいをすべてじぶんのせきにんにしないようでは、じょうししっかくだ。",
    "english": "If you don't take responsibility for your subordinates' failures, you're unfit to be a boss.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "少し注意されただけで落ち込むようでは、この厳しい競争社会で生き残れない。",
    "expected": "少し注意されただけで落ち込むようでは、この厳しい競争社会で生き残れない。",
    "reading": "すこしちゅういされただけでおちこむようでは、このきびしいきょうそうしゃかいでいきのこれない。",
    "english": "If you get discouraged just by being slightly warned, you won't survive in this tough competitive society.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "顧客のニーズを理解しようとしないようでは、良い商品は開発できないだろう。",
    "expected": "顧客のニーズを理解しようとしないようでは、良い商品は開発できないだろう。",
    "reading": "こきゃくのニーズをりかいしようとしないようでは、よいしょうひんはかいはつできないだろう。",
    "english": "If you don't try to understand customer needs, you probably can't develop good products.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "健康管理を怠るようでは、将来的に病気になるリスクが高まる。",
    "expected": "健康管理を怠るようでは、将来的に病気になるリスクが高まる。",
    "reading": "けんこうかんりをおこたるようでは、しょうらいてきにびょうきになるりすくがたかまる。",
    "english": "If you neglect your health management, the risk of getting sick in the future increases.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "自分の意見をはっきり言えないようでは、議論に参加する意味がない。",
    "expected": "自分の意見をはっきり言えないようでは、議論に参加する意味がない。",
    "reading": "じぶんのいけんをはっきりいえないようでは、ぎろんにさんかするいみがない。",
    "english": "If you can't clearly state your own opinion, there's no point in participating in the discussion.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "計画性もなしにお金を使うようでは、すぐに破産してしまうよ。",
    "expected": "計画性もなしにお金を使うようでは、すぐに破産してしまうよ。",
    "reading": "けいかくせいもなしにおかねをつかうようでは、すぐにはさんしてしまうよ。",
    "english": "If you spend money without any planning, you'll go bankrupt quickly.",
    "grammar": "〜ようでは"
  },
  {
    "spoken": "国民の支持なしには、いかなる政策も実行に移すことは難しい。",
    "expected": "国民の支持なしには、いかなる政策も実行に移すことは難しい。",
    "reading": "こくみんのしじなしには、いかなるせいさくもじっこうにうつすことはむずかしい。",
    "english": "Without the support of the citizens, it is difficult to implement any policy.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "十分な準備なしに、重要なプレゼンテーションに臨むべきではない。",
    "expected": "十分な準備なしに、重要なプレゼンテーションに臨むべきではない。",
    "reading": "じゅうぶんなじゅんびなしに、じゅうようなぷれぜんてーしょんにのぞむべきではない。",
    "english": "You shouldn't undertake an important presentation without sufficient preparation.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "皆様のご協力なしでは、このプロジェクトの成功はあり得ませんでした。",
    "expected": "皆様のご協力なしでは、このプロジェクトの成功はあり得ませんでした。",
    "reading": "みなさまのごきょうりょくなしでは、このぷろじぇくとのせいこうはありえませんでした。",
    "english": "Without everyone's cooperation, the success of this project would not have been possible.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "血のにじむような努力なくして、トップアスリートになることはできない。",
    "expected": "血のにじむような努力なくして、トップアスリートになることはできない。",
    "reading": "ちのにじむようなどりょくなくして、とっぷあすりーとになることはできない。",
    "english": "One cannot become a top athlete without blood-sweat-and-tears effort.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "確固たる証拠なしに、彼を犯人だと断定することはできない。",
    "expected": "確固たる証拠なしに、彼を犯人だと断定することはできない。",
    "reading": "かっこたるしょうこなしに、かれをはんにんだとだんていすることはできない。",
    "english": "We cannot conclude he is the culprit without solid evidence.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "適切なインフラなしでは、経済の持続的な発展は望めない。",
    "expected": "適切なインフラなしでは、経済の持続的な発展は望めない。",
    "reading": "てきせつないんふらなしでは、けいざいのじぞくてきなはってんはのぞめない。",
    "english": "Sustainable economic development cannot be expected without proper infrastructure.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "関係者の合意なくして、計画を先に進めることは許されない。",
    "expected": "関係者の合意なくして、計画を先に進めることは許されない。",
    "reading": "かんけいしゃのごういなくして、けいかくをさきにすすめることはゆるされない。",
    "english": "Proceeding with the plan is not permitted without the agreement of the parties involved.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "先生の丁寧な指導なしには、私の日本語能力はここまで上達しなかっただろう。",
    "expected": "先生の丁寧な指導なしには、私の日本語能力はここまで上達しなかっただろう。",
    "reading": "せんせいのていねいなしどうなしには、わたしのにほんごのうりょくはここまてじょうたつしなかっただろう。",
    "english": "Without the teacher's careful guidance, my Japanese ability probably wouldn't have improved this much.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "愛なしでは、人生は味気ないものになってしまう。",
    "expected": "愛なしでは、人生は味気ないものになってしまう。",
    "reading": "あいなしでは、じんせいはあじけないものになってしまう。",
    "english": "Without love, life becomes dull.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "多くの犠牲なくしては、今日の平和と繁栄は築かれなかった。",
    "expected": "多くの犠牲なくしては、今日の平和と繁栄は築かれなかった。",
    "reading": "おおくのぎせいなくしては、こんにちのへいわとはんえいはきずかれなかった。",
    "english": "Today's peace and prosperity could not have been built without many sacrifices.",
    "grammar": "〜なしに（は）・〜なしでは・〜なくして（は）"
  },
  {
    "spoken": "あんな条件の悪い会社で働くくらいなら、アルバイトの方がましだ。",
    "expected": "あんな条件の悪い会社で働くくらいなら、アルバイトの方がましだ。",
    "reading": "あんなじょうけんのわるいかいしゃではたらくくらいなら、あるばいとのほうがましだ。",
    "english": "Rather than working at a company with such bad conditions, doing a part-time job is better.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "満員電車で一時間も立ちっぱなしになるくらいなら、三十分歩くよ。",
    "expected": "満員電車で一時間も立ちっぱなしになるくらいなら、三十分歩くよ。",
    "reading": "まんいんでんしゃでいちじかんもたちっぱなしになるくらいなら、さんじゅっぷんあるくよ。",
    "english": "Rather than standing for an hour on a crowded train, I'll walk for thirty minutes.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "美味しくない料理にお金を払うくらいなら、自分で作った方がいい。",
    "expected": "美味しくない料理にお金を払うくらいなら、自分で作った方がいい。",
    "reading": "おいしくないりょうりにおかねをはらうくらいなら、じぶんでつくったほうがいい。",
    "english": "Rather than paying money for food that doesn't taste good, it's better to make it myself.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "彼に借金を頼むくらいなら、持っている物を売ってお金を作る。",
    "expected": "彼に借金を頼むくらいなら、持っている物を売ってお金を作る。",
    "reading": "かれにしゃっきんをたのむくらいなら、もっているものをうっておかねをつくる。",
    "english": "Rather than asking him for a loan, I'll sell my belongings to make money.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "中途半端な気持ちで付き合うくらいなら、最初から一人でいた方がいい。",
    "expected": "中途半端な気持ちで付き合うくらいなら、最初から一人でいた方がいい。",
    "reading": "ちゅうとはんぱなきもちでつきあうくらいなら、さいしょからひとりでいたほうがいい。",
    "english": "Rather than dating with half-hearted feelings, it's better to be alone from the start.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "あんな無責任な人にリーダーを任せるくらいなら、私が引き受けた方がましだ。",
    "expected": "あんな無責任な人にリーダーを任せるくらいなら、私が引き受けた方がましだ。",
    "reading": "あんなむせきにんなひとにりーだーをまかせるくらいなら、わたしがひきうけたほうがましだ。",
    "english": "Rather than entrusting the leadership to such an irresponsible person, it would be better if I took it on.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "試合に負けて泣くくらいなら、もっと必死に練習すべきだった。",
    "expected": "試合に負けて泣くくらいなら、もっと必死に練習すべきだった。",
    "reading": "しあいにまけてなくくらいなら、もっとひっしにれんしゅうすべきだった。",
    "english": "Rather than crying after losing the match, you should have practiced more desperately.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "嫌いな上司にお世辞を言うくらいなら、窓際族になった方が楽かもしれない。",
    "expected": "嫌いな上司にお世辞を言うくらいなら、窓際族になった方が楽かもしれない。",
    "reading": "きらいなじょうしにおせじをいうくらいなら、まどぎわぞくになったほうがらくかもしれない。",
    "english": "Rather than flattering a boss I dislike, it might be easier to become someone pushed off to a desk by the window (madogiwazoku).",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "将来性のない分野に投資するくらいなら、貯金しておいた方が賢明だ。",
    "expected": "将来性のない分野に投資するくらいなら、貯金しておいた方が賢明だ。",
    "reading": "しょうらいせいのないぶんやにとうしするくらいなら、ちょきんしておいたほうがけんめいだ。",
    "english": "Rather than investing in a field with no future prospects, it's wiser to save the money.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "自由を束縛されるくらいなら、どんな贅沢もいらない。",
    "expected": "自由を束縛されるくらいなら、どんな贅沢もいらない。",
    "reading": "じゆうをそくばくされるくらいなら、どんなぜいたくもいらない。",
    "english": "Rather than having my freedom restricted, I don't need any luxury.",
    "grammar": "〜くらいなら"
  },
  {
    "spoken": "どんなに反対されようとも、私は自分の信じる道を進むつもりだ。",
    "expected": "どんなに反対されようとも、私は自分の信じる道を進むつもりだ。",
    "reading": "どんなにはんたいされようとも、わたしはじぶんのしんじるみちをすすむつもりだ。",
    "english": "No matter how much opposition I face, I intend to follow the path I believe in.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "彼が何と言おうが、私たちの計画は変更しません。",
    "expected": "彼が何と言おうが、私たちの計画は変更しません。",
    "reading": "かれがなんといおうが、わたしたちのけいかくはへんこうしません。",
    "english": "Whatever he may say, we will not change our plan.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "たとえ失敗しようとも、挑戦した経験は無駄にはならない。",
    "expected": "たとえ失敗しようとも、挑戦した経験は無駄にはならない。",
    "reading": "たとえしっぱいしようとも、ちょうせんしたけいけんはむだにはならない。",
    "english": "Even if I fail, the experience of having tried will not be in vain.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "いくら給料が高かろうと、やりがいのない仕事はしたくない。",
    "expected": "いくら給料が高かろうと、やりがいのない仕事はしたくない。",
    "reading": "いくらきゅうりょうがたかかろうと、やりがいのないしごとはしたくない。",
    "english": "No matter how high the salary might be, I don't want to do a job that isn't rewarding.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "周りがどう考えようが、自分の価値観を大切にしたい。",
    "expected": "周りがどう考えようが、自分の価値観を大切にしたい。",
    "reading": "まわりがどうかんがえようが、じぶんのかちかんをたいせつにしたい。",
    "english": "Regardless of what others around me think, I want to cherish my own values.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "どんな困難に直面しようとも、解決策は必ず見つかるはずだ。",
    "expected": "どんな困難に直面しようとも、解決策は必ず見つかるはずだ。",
    "reading": "どんなこんなんにちょくめんしようとも、かいけつさくはかならずみつかるはずだ。",
    "english": "No matter what difficulties we face, a solution can surely be found.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "彼がどんなに謝ろうと、今回の裏切りは許せない。",
    "expected": "彼がどんなに謝ろうと、今回の裏切りは許せない。",
    "reading": "かれがどんなにあやまろうと、こんかいのうらぎりはゆるせない。",
    "english": "No matter how much he apologizes, I cannot forgive this betrayal.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "たとえ誰がリーダーになろうとも、チームの方針は変わらない。",
    "expected": "たとえ誰がリーダーになろうとも、チームの方針は変わらない。",
    "reading": "たとえだれがりーだーになろうとも、ちーむのほうしんはかわらない。",
    "english": "Regardless of who becomes the leader, the team's policy will not change.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "どんなに時代が変わろうと、人間関係の基本は同じだろう。",
    "expected": "どんなに時代が変わろうと、人間関係の基本は同じだろう。",
    "reading": "どんなにじだいがかわろうと、にんげんかんけいのきほんはおなじだろう。",
    "english": "However much times may change, the fundamentals of human relationships probably remain the same.",
    "grammar": "〜（よ）うと（も）・〜（よ）うが"
  },
  {
    "spoken": "悪天候であろうと、明日のイベントは決行される予定だ。",
    "expected": "悪天候であろうと、明日のイベントは決行される予定だ。",
    "reading": "あくてんこうであろうと、あしたのいべんとはけっこうされるよていだ。",
    "english": "Even if the weather is bad, tomorrow's event is scheduled to be held.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "君が行こうが行くまいが、会議は定刻通りに始まる。",
    "expected": "君が行こうが行くまいが、会議は定刻通りに始まる。",
    "reading": "きみがいこうがいくまいが、かいぎはていこくどおりにはじまる。",
    "english": "Whether you go or not, the meeting will start on time.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "賛成しようとしまいと、この決定は覆らないだろう。",
    "expected": "賛成しようとしまいと、この決定は覆らないだろう。",
    "reading": "さんせいしようとしまいと、このけっていはくつがえらないだろう。",
    "english": "Whether you agree or not, this decision probably won't be overturned.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "雨が降ろうが降るまいが、運動会は実施されます。",
    "expected": "雨が降ろうが降るまいが、運動会は実施されます。",
    "reading": "あめがふろうがふるまいが、うんどうかいはじっしされます。",
    "english": "Whether it rains or not, the sports festival will be held.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "彼が来ようが来まいが、パーティーは盛り上がるはずだ。",
    "expected": "彼が来ようが来まいが、パーティーは盛り上がるはずだ。",
    "reading": "かれがこようがこまいが、ぱーてぃーはもりあがるはずだ。",
    "english": "Whether he comes or not, the party should be lively.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "結果が良かろうが悪かろうが、全力を尽くしたことに満足している。",
    "expected": "結果が良かろうが悪かろうが、全力を尽くしたことに満足している。",
    "reading": "けっかがよかろうがわるかろうが、ぜんりょくをつくしたことにまんぞくしている。",
    "english": "Whether the result is good or bad, I am satisfied that I gave my all.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "試験に合格しようがしまいが、私の彼に対する評価は変わらない。",
    "expected": "試験に合格しようがしまいが、私の彼に対する評価は変わらない。",
    "reading": "しけんにごうかくしようがしまいが、わたしのかれにたいするひょうかはかわらない。",
    "english": "Whether he passes the exam or not, my evaluation of him won't change.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "理解されようとされまいと、アーティストは自分の表現を追求する。",
    "expected": "理解されようとされまいと、アーティストは自分の表現を追求する。",
    "reading": "りかいされようとされまいと、あーてぃすとはじぶんのひょうげんをついきゅうする。",
    "english": "Whether understood or not, artists pursue their own expression.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "関係者が認めようが認めまいが、事実は事実だ。",
    "expected": "関係者が認めようが認めまいが、事実は事実だ。",
    "reading": "かんけいしゃがみとめようがみとめまいが、じじつはじじつだ。",
    "english": "Whether the involved parties admit it or not, the facts are the facts.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "子供が泣こうがわめこうが、親は冷静に対応すべきだ。",
    "expected": "子供が泣こうがわめこうが、親は冷静に対応すべきだ。",
    "reading": "こどもがなこうがわめこうが、おやはれいせいにたいおうすべきだ。",
    "english": "Whether the child cries or screams, parents should respond calmly.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "成功しようがしまいが、この経験から学ぶことは多いはずだ。",
    "expected": "成功しようがしまいが、この経験から学ぶことは多いはずだ。",
    "reading": "せいこうしようがしまいが、このけいけんからまなぶことはおおいはずだ。",
    "english": "Whether successful or not, there should be much to learn from this experience.",
    "grammar": "〜（よ）うと〜まいと・〜（よ）うが〜まいが"
  },
  {
    "spoken": "理由が何であれ、約束を破ることは許されない。",
    "expected": "理由が何であれ、約束を破ることは許されない。",
    "reading": "りゆうがなんであれ、やくそくをやぶることはゆるされない。",
    "english": "Whatever the reason may be, breaking a promise is not permissible.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "たとえ相手が誰であろうと、自分の意見ははっきり言うべきだ。",
    "expected": "たとえ相手が誰であろうと、自分の意見ははっきり言うべきだ。",
    "reading": "たとえあいてがだれであろうと、じぶんのいけんははっきりいうべきだ。",
    "english": "Regardless of who the other person is, you should state your opinion clearly.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "どんな身分の人であれ、法の下では平等である。",
    "expected": "どんな身分の人であれ、法の下では平等である。",
    "reading": "どんなみぶんのひとであれ、ほうのもとではびょうどうである。",
    "english": "Regardless of their social status, everyone is equal under the law.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "たとえわずかな可能性であろうと、最後まで諦めてはいけない。",
    "expected": "たとえわずかな可能性であろうと、最後まで諦めてはいけない。",
    "reading": "たとえわずかなかんせいであろうと、さいごまであきらめてはいけない。",
    "english": "Even if it's only a slight possibility, you must not give up until the very end.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "経験者であれ初心者であれ、安全規則は全員が守る必要がある。",
    "expected": "経験者であれ初心者であれ、安全規則は全員が守る必要がある。",
    "reading": "けいけんしゃであれしょしんしゃであれ、あんぜんきそくはぜんいんがまもるひつようがある。",
    "english": "Whether experienced or a beginner, everyone needs to follow the safety rules.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "国王であれ、国民の信頼を失えばその地位は安泰ではない。",
    "expected": "国王であれ、国民の信頼を失えばその地位は安泰ではない。",
    "reading": "こくおうであれ、こくみのしんらいをうしなえばそのちいはあんたいではない。",
    "english": "Even for a king, if he loses the trust of the people, his position is not secure.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "目的が何であれ、他人を傷つける手段は正当化できない。",
    "expected": "目的が何であれ、他人を傷つける手段は正当化できない。",
    "reading": "もくてきがなんであれ、たにんをきずつけるしゅだんはせいとうかできない。",
    "english": "Whatever the objective may be, means that harm others cannot be justified.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "晴天であれ雨天であれ、祭りは予定通り行われる。",
    "expected": "晴天であれ雨天であれ、祭りは予定通り行われる。",
    "reading": "せいてんであれうてんであれ、まつりはよていどおりおこなわれる。",
    "english": "Whether the weather is fine or rainy, the festival will be held as planned.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "たとえ科学的な根拠が不明確であろうと、昔からの言い伝えには耳を傾ける価値があるかもしれない。",
    "expected": "たとえ科学的な根拠が不明確であろうと、昔からの言い伝えには耳を傾ける価値があるかもしれない。",
    "reading": "たとえかがくてきなこんきょがふめいかくであろうと、むかしからのいいつたえにはみみをかたむけるかちがあるかもしれない。",
    "english": "Even if the scientific basis is unclear, traditional sayings might be worth listening to.",
    "grammar": "〜であれ・〜であろうと"
  },
  {
    "spoken": "今さら後悔したところで、失われた時間は戻ってこない。",
    "expected": "今さら後悔したところで、失われた時間は戻ってこない。",
    "reading": "いまさらこうかいしたところで、うしなわれたじかんはもどってこない。",
    "english": "Even if you regret it now, the lost time won't come back.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "どんなに説明したところで、彼は納得しないだろう。",
    "expected": "どんなに説明したところで、彼は納得しないだろう。",
    "reading": "どんなにせつめいしたところで、かれはなっとくしないだろう。",
    "english": "No matter how much you explain, he probably won't be convinced.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "急いだところで、もう会議には間に合わない。",
    "expected": "急いだところで、もう会議には間に合わない。",
    "reading": "いそいだところで、もうかいぎにはまにあわない。",
    "english": "Even if you hurry, you won't make it to the meeting anymore.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "一人で悩んでいたところで、問題は解決しないよ。",
    "expected": "一人で悩んでいたところで、問題は解決しないよ。",
    "reading": "ひとりでなやんでいたところで、もんだいはかいけつしないよ。",
    "english": "Worrying about it by yourself won't solve the problem.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "彼に反論したところで、状況が変わるとは思えない。",
    "expected": "彼に反論したところで、状況が変わるとは思えない。",
    "reading": "かれにはんろんしたところで、じょうきょうがかわるとはおもえない。",
    "english": "Even if I argue with him, I don't think the situation will change.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "専門家が見たところで、この絵の真贋を見分けるのは困難だそうだ。",
    "expected": "専門家が見たところで、この絵の真贋を見分けるのは困難だそうだ。",
    "reading": "せんもんかがみたところで、このえのしんがんをみわけるのはこんなんだそうだ。",
    "english": "I heard that even if an expert looks at it, distinguishing the authenticity of this painting is difficult.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "今から勉強を始めたところで、明日の試験には効果がないだろう。",
    "expected": "今から勉強を始めたところで、明日の試験には効果がないだろう。",
    "reading": "いまからべんきょうをはじめたところで、あしたのしけんにはこうかがないだろう。",
    "english": "Even if you start studying now, it probably won't be effective for tomorrow's exam.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "不満を言ったところで、会社の決定が覆るわけではない。",
    "expected": "不満を言ったところで、会社の決定が覆るわけではない。",
    "reading": "ふまんをいったところで、かいしゃのけっていがくつがえるわけではない。",
    "english": "Even if you complain, it doesn't mean the company's decision will be overturned.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "いくら謝罪されたところで、壊れた信頼関係は元には戻らない。",
    "expected": "いくら謝罪されたところで、壊れた信頼関係は元には戻らない。",
    "reading": "いくらしゃざいされたところで、こわれたしんらいかんけいはもとにはもどらない。",
    "english": "No matter how much they apologize, the broken trust cannot be restored.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "その古い機械を修理したところで、またすぐに壊れるだろう。",
    "expected": "その古い機械を修理したところで、またすぐに壊れるだろう。",
    "reading": "そのふるいきかいをしゅうりしたところで、またすぐにこわれるだろう。",
    "english": "Even if you repair that old machine, it will probably break again soon.",
    "grammar": "〜たところで"
  },
  {
    "spoken": "お金があればあったで、使い道に悩むものだ。",
    "expected": "お金があればあったで、使い道に悩むものだ。",
    "reading": "おかねがあればあったで、つかいみちになやむものだ。",
    "english": "If you have money, then you worry about how to spend it.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "家が広ければ広いで、掃除が大変になる。",
    "expected": "家が広ければ広いで、掃除が大変になる。",
    "reading": "いえがひろければひろいで、そうじがたいへんになる。",
    "english": "If the house is big, then cleaning becomes a chore.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "子供がいなければいないで、寂しいと感じることもあるらしい。",
    "expected": "子供がいなければいないで、寂しいと感じることもあるらしい。",
    "reading": "こどもがいなければいないで、さびしいとかんじることもあるらしい。",
    "english": "If you don't have children, apparently you sometimes feel lonely in that situation.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "田舎は不便なら不便で、都会にはない魅力がある。",
    "expected": "田舎は不便なら不便で、都会にはない魅力がある。",
    "reading": "いなかはふべんならふべんで、とかいにはないみりょくがある。",
    "english": "If the countryside is inconvenient, it has its own charm that the city lacks.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "仕事が忙しければ忙しいで、充実感はある。",
    "expected": "仕事が忙しければ忙しいで、充実感はある。",
    "reading": "しごとがいそがしければいそがしいで、じゅうじつかんはある。",
    "english": "If work is busy, then there's a sense of fulfillment that comes with it.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "休みが長ければ長いで、何をして過ごすか計画するのが面倒だ。",
    "expected": "休みが長ければ長いで、何をして過ごすか計画するのが面倒だ。",
    "reading": "やすみがながければながいで、なにをしてすごすかけいかくするのがめんどうだ。",
    "english": "If the vacation is long, then planning what to do becomes bothersome.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "新しい技術は便利なら便利で、使い方を覚えるのが一苦労だ。",
    "expected": "新しい技術は便利なら便利で、使い方を覚えるのが一苦労だ。",
    "reading": "あたらしいぎじゅつはべんりならべんりで、つかいかたをおぼえるのがひとくろうだ。",
    "english": "If new technology is convenient, learning how to use it is quite a struggle.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "昇進したらしたで、責任が重くなって気苦労が増える。",
    "expected": "昇進したらしたで、責任が重くなって気苦労が増える。",
    "reading": "しょうしんしたらしたで、せきにんがおもくなってきぐろうがふえる。",
    "english": "Once you get promoted, the responsibility becomes heavier and worries increase.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "結婚したらしたで、独身時代とは違う悩みが出てくるものだ。",
    "expected": "結婚したらしたで、独身時代とは違う悩みが出てくるものだ。",
    "reading": "けっこんしたらしたで、どくしんじだいとはちがうなやみがでてくるものだ。",
    "english": "Once you get married, different worries than those from single life emerge.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "有名になればなったで、プライバシーがなくなって大変らしい。",
    "expected": "有名になればなったで、プライバシーがなくなって大変らしい。",
    "reading": "ゆうめいになればなったで、ぷらいばしーがなくなってたいへんらしい。",
    "english": "If you become famous, apparently it's tough because you lose your privacy.",
    "grammar": "〜ば〜で・〜なら〜で・〜たら〜たで"
  },
  {
    "spoken": "会社は経営再建を果たすべく、大規模なリストラを実施した。",
    "expected": "会社は経営再建を果たすべく、大規模なリストラを実施した。",
    "reading": "かいしゃはけいえいさいけんをはたすべく、だいきぼなりすとらをじっしした。",
    "english": "In order to achieve management restructuring, the company carried out large-scale downsizing.",
    "grammar": "〜べく"
  },
  {
    "spoken": "研究者たちは未知のウイルスに対抗すべく、日夜研究に励んでいる。",
    "expected": "研究者たちは未知のウイルスに対抗すべく、日夜研究に励んでいる。",
    "reading": "けんきゅうしゃたちはみちのういるすにたいこうすべく、にちやけんきゅうにはげんでいる。",
    "english": "Researchers are working hard day and night in order to combat the unknown virus.",
    "grammar": "〜べく"
  },
  {
    "spoken": "彼は一流の音楽家になるべく、厳しい練習に耐えている。",
    "expected": "彼は一流の音楽家になるべく、厳しい練習に耐えている。",
    "reading": "かれはいちりゅうのおんがくかになるべく、きびしいれんしゅうにたえている。",
    "english": "He is enduring rigorous practice in order to become a top-tier musician.",
    "grammar": "〜べく"
  },
  {
    "spoken": "国民の安全を守るべく、政府は新たな法律を制定した。",
    "expected": "国民の安全を守るべく、政府は新たな法律を制定した。",
    "reading": "こくみんのあんぜんをまもるべく、せいふはあらたなほうりつをせいていした。",
    "english": "The government enacted a new law in order to protect the safety of its citizens.",
    "grammar": "〜べく"
  },
  {
    "spoken": "一日も早く技術を習得すべく、彼は海外へ留学した。",
    "expected": "一日も早く技術を習得すべく、彼は海外へ留学した。",
    "reading": "いちにちもはやくぎじゅつをしゅうとくすべく、かれはかいがいへりゅうがくした。",
    "english": "He studied abroad in order to master the skills as quickly as possible.",
    "grammar": "〜べく"
  },
  {
    "spoken": "環境問題の解決に貢献すべく、多くの企業が再生可能エネルギー導入を進めている。",
    "expected": "環境問題の解決に貢献すべく、多くの企業が再生可能エネルギー導入を進めている。",
    "reading": "かんきょうもんだいのかいけつにこうけんすべく、おおくのきぎょうがさいせいかのうえねるぎーどうにゅうをすすめている。",
    "english": "Many companies are promoting the introduction of renewable energy in order to contribute to solving environmental problems.",
    "grammar": "〜べく"
  },
  {
    "spoken": "選手たちは優勝すべく、最後の最後まで全力を尽くした。",
    "expected": "選手たちは優勝すべく、最後の最後まで全力を尽くした。",
    "reading": "せんしゅたちはゆうしょうすべく、さいごのさいごまでぜんりょくをつくした。",
    "english": "The athletes gave their all until the very end in order to win the championship.",
    "grammar": "〜べく"
  },
  {
    "spoken": "地域社会を活性化させるべく、若者たちが新しいプロジェクトを立ち上げた。",
    "expected": "地域社会を活性化させるべく、若者たちが新しいプロジェクトを立ち上げた。",
    "reading": "ちいきしゃかいをかっせいかさせるべく、わかものたちがあたらしいぷろじぇくとをたちあげた。",
    "english": "Young people launched a new project in order to revitalize the local community.",
    "grammar": "〜べく"
  },
  {
    "spoken": "お客様にご満足いただくべく、サービスの向上に努めております。",
    "expected": "お客様にご満足いただくべく、サービスの向上に努めております。",
    "reading": "おきゃくさまにごまんぞくいただくべく、さーびすのこうじょうにつとめております。",
    "english": "We are striving to improve our services in order to satisfy our customers.",
    "grammar": "〜べく"
  },
  {
    "spoken": "真相を明らかにするべく、ジャーナリストは危険な取材を敢行した。",
    "expected": "真相を明らかにするべく、ジャーナリストは危険な取材を敢行した。",
    "reading": "しんそうをあきらかにするべく、じゃーなりすとはきけんなしゅざいをかんこうした。",
    "english": "The journalist undertook dangerous reporting in order to reveal the truth.",
    "grammar": "〜べく"
  },
  {
    "spoken": "家族を養わんがため、彼は故郷を離れて都会で働いている。",
    "expected": "家族を養わんがため、彼は故郷を離れて都会で働いている。",
    "reading": "かぞくをやしなわんがため、かれはこきょうをはなれてとかいではたらいている。",
    "english": "For the sake of supporting his family, he left his hometown and works in the city.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "理想の社会を実現せんがため、多くの人々が運動に参加した。",
    "expected": "理想の社会を実現せんがため、多くの人々が運動に参加した。",
    "reading": "りそうのしゃかいをじつげんせんがため、おおくのひとびとがうんどうにさんかした。",
    "english": "Many people participated in the movement in order to realize an ideal society.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "学問の道を究めんがため、彼は全ての誘惑を断ち切った。",
    "expected": "学問の道を究めんがため、彼は全ての誘惑を断ち切った。",
    "reading": "がくもんのみちをきわめんがため、かれはすべてのゆうわくをたちきった。",
    "english": "In order to master the path of scholarship, he cut off all temptations.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "己の限界を超えんがため、アスリートは過酷なトレーニングに挑戦する。",
    "expected": "己の限界を超えんがため、アスリートは過酷なトレーニングに挑戦する。",
    "reading": "おのれのげんかいをこえんがため、あすりーとはかこくなとれーにんぐにちょうせんする。",
    "english": "Athletes challenge themselves with grueling training in order to surpass their own limits.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "平和な世界を築かんがため、国際社会は協力し合わなければならない。",
    "expected": "平和な世界を築かんがため、国際社会は協力し合わなければならない。",
    "reading": "へいわなせかいをきずかんがため、こくさいしゃかいはきょうりょくしあわなければならない。",
    "english": "For the sake of building a peaceful world, the international community must cooperate.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "芸術家は自らの表現を追求せんがため、時に孤独を選ぶ。",
    "expected": "芸術家は自らの表現を追求せんがため、時に孤独を選ぶ。",
    "reading": "げいじゅつかはみずからのひょうげんをついきゅうせんがため、ときにこどくをえらぶ。",
    "english": "Artists sometimes choose solitude in order to pursue their own expression.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "絶滅危惧種を救わんがために、保護団体が資金集めを行っている。",
    "expected": "絶滅危惧種を救わんがために、保護団体が資金集めを行っている。",
    "reading": "ぜつめつきぐしゅをすくわんがために、ほごだんたいがしきんあつめをおこなっている。",
    "english": "Conservation groups are fundraising in order to save endangered species.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "真実を伝えんがため、報道記者は圧力に屈しなかった。",
    "expected": "真実を伝えんがため、報道記者は圧力に屈しなかった。",
    "reading": "しんじつをつたえんがため、ほうどうきしゃはあつりょくにっしなかった。",
    "english": "For the sake of reporting the truth, the journalist did not yield to pressure.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "ただ一目、その景色を見んがため、彼は険しい山道を登った。",
    "expected": "ただ一目、その景色を見んがため、彼は険しい山道を登った。",
    "reading": "ただひとめ、そのけしきをみんがため、かれはけわしいやまみちをのぼった。",
    "english": "Just to catch a glimpse of that scenery, he climbed the steep mountain path.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "次世代により良い未来を残さんがため、私たちは環境保全に取り組むべきだ。",
    "expected": "次世代により良い未来を残さんがため、私たちは環境保全に取り組むべきだ。",
    "reading": "じせだいによりよいみらいをのこさんがため、わたしたちはかんきょうほぜんにとりくむべきだ。",
    "english": "We should engage in environmental conservation in order to leave a better future for the next generation.",
    "grammar": "〜んがため（に）"
  },
  {
    "spoken": "本日をもちまして、閉店セールは終了とさせていただきます。",
    "expected": "本日をもちまして、閉店セールは終了とさせていただきます。",
    "reading": "ほんじつをもちまして、へいてんせーるはしゅうりょうとさせていただきます。",
    "english": "As of today, the closing sale will be concluded.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "厳正なる審査をもって、受賞者を決定いたしました。",
    "expected": "厳正なる審査をもって、受賞者を決定いたしました。",
    "reading": "げんせいなるしんさをもって、じゅしょうしゃをけっていいたしました。",
    "english": "The winners were decided based on a rigorous screening process.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "書面をもって、正式な回答とさせていただきます。",
    "expected": "書面をもって、正式な回答とさせていただきます。",
    "reading": "しょめんをもって、せいしきなかいとうとさせていただきます。",
    "english": "We will provide our official response in writing.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "彼は卓越した技術をもって、その難問題を解決した。",
    "expected": "彼は卓越した技術をもって、その難問題を解決した。",
    "reading": "かれはたくえつしたぎじゅつをもって、そのなんもんだいをかいけつした。",
    "english": "He solved that difficult problem using his outstanding skills.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "誠意をもって、お客様に対応することが我々の基本方針です。",
    "expected": "誠意をもって、お客様に対応することが我々の基本方針です。",
    "reading": "せいいをもって、おきゃくさまにたいおうすることがわれわれのきほんほうしんです。",
    "english": "Responding to customers with sincerity is our fundamental policy.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "当社は最新のテクノロジーをもって、社会の発展に貢献してまいります。",
    "expected": "当社は最新のテクノロジーをもって、社会の発展に貢献してまいります。",
    "reading": "とうしゃはさいしんのてくのろじーをもって、しゃかいのはってんにこうけんしてまいります。",
    "english": "Our company will contribute to societal development using the latest technology.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "今回の成果をもって、プロジェクトは次の段階へ移行します。",
    "expected": "今回の成果をもって、プロジェクトは次の段階へ移行します。",
    "reading": "こんかいのせいかをもって、ぷろじぇくとはつぎのだんかいへいこうします。",
    "english": "Based on these results, the project will move to the next phase.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "議論は平行線をたどったため、議長の判断をもって一旦休憩となった。",
    "expected": "議論は平行線をたどったため、議長の判断をもって一旦休憩となった。",
    "reading": "ぎろんはへいこうせんをたどったため、ぎちょうのはんだんをもって いったんきゅうけいとなった。",
    "english": "As the discussion reached a deadlock, a break was called based on the chairperson's decision.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "彼は不屈の精神をもって、数々の困難を乗り越えてきた。",
    "expected": "彼は不屈の精神をもって、数々の困難を乗り越えてきた。",
    "reading": "かれはふくつのせいしんをもって、かずかずのこんなんをのりこえてきた。",
    "english": "He has overcome numerous difficulties with his indomitable spirit.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "2025年3月末日をもって、このサービスは提供を終了いたします。",
    "expected": "2025年3月末日をもって、このサービスは提供を終了いたします。",
    "reading": "にせんにじゅうごねんさんがつまつじつをもって、このさーびすはていきょうをしゅうりょういたします。",
    "english": "This service will be discontinued as of the end of March, 2025.",
    "grammar": "〜をもって"
  },
  {
    "spoken": "親は子供の将来を心配すればこそ、厳しく叱ることもある。",
    "expected": "親は子供の将来を心配すればこそ、厳しく叱ることもある。",
    "reading": "おやはこどものしょうらいをしんぱいすればこそ、きびしくしかることもある。",
    "english": "Parents sometimes scold strictly precisely because they worry about their child's future.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "あなたの成長を願えばこそ、あえて難しい課題を与えたのです。",
    "expected": "あなたの成長を願えばこそ、あえて難しい課題を与えたのです。",
    "reading": "あなたのせいちょうをねがえばこそ、あえてむずかしいかだいをあたえたのです。",
    "english": "It is precisely because I wish for your growth that I intentionally gave you a difficult task.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "健康であればこそ、好きなことに挑戦できる。",
    "expected": "健康であればこそ、好きなことに挑戦できる。",
    "reading": "けんこうであればこそ、すきなことにちょうせんできる。",
    "english": "Precisely because one is healthy, one can challenge oneself with things they like.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "信頼関係があればこそ、率直な意見交換が可能になる。",
    "expected": "信頼関係があればこそ、率直な意見交換が可能になる。",
    "reading": "しんらいかんけいがあればこそ、そっちょくないけんこうかんがかのうになる。",
    "english": "Frank opinion exchange becomes possible precisely because there is a relationship of trust.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "長年の努力があればこそ、今日の成功がある。",
    "expected": "長年の努力があればこそ、今日の成功がある。",
    "reading": "ながねんのどりょくがあればこそ、こんにちのせいこうがある。",
    "english": "Today's success exists precisely because of many years of effort.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "チーム全体の協力があればこそ、このプロジェクトは完成した。",
    "expected": "チーム全体の協力があればこそ、このプロジェクトは完成した。",
    "reading": "ちーむぜんたいのきょうりょくがあればこそ、このぷろじぇくとはかんせいした。",
    "english": "This project was completed precisely because there was cooperation from the entire team.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "豊かな自然環境であればこそ、多様な生態系が維持される。",
    "expected": "豊かな自然環境であればこそ、多様な生態系が維持される。",
    "reading": "ゆたかなしぜんかんきょうであればこそ、たようないせいたいけいがいじされる。",
    "english": "A diverse ecosystem is maintained precisely because the natural environment is rich.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "彼の実力があればこそ、皆が彼をリーダーとして推薦した。",
    "expected": "彼の実力があればこそ、皆が彼をリーダーとして推薦した。",
    "reading": "かれのじつりょくがあればこそ、みながかれをりーだーとしてすいせんした。",
    "english": "Everyone recommended him as a leader precisely because of his ability.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "自由な発想があればこそ、革新的なアイデアが生まれる。",
    "expected": "自由な発想があればこそ、革新的なアイデアが生まれる。",
    "reading": "じゆうなはっそうがあればこそ、かくしんてきなあいであがうまれる。",
    "english": "Innovative ideas are born precisely because there is freedom of thought.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "苦しい時期を乗り越えた経験があればこそ、人の痛みが理解できる。",
    "expected": "苦しい時期を乗り越えた経験があればこそ、人の痛みが理解できる。",
    "reading": "くるしいじきをのりこえたけいけんがあればこそ、ひとのいたみがりかいできる。",
    "english": "One can understand others' pain precisely because they have experienced overcoming difficult times.",
    "grammar": "〜ばこそ"
  },
  {
    "spoken": "今日は祝日とあって、多くの観光地が賑わっている。",
    "expected": "今日は祝日とあって、多くの観光地が賑わっている。",
    "reading": "きょうはしゅくじつとあって、おおくのかんこうちがにぎわっている。",
    "english": "As it's a public holiday today, many tourist spots are crowded.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "有名な俳優が来るとあって、会場にはファンが殺到した。",
    "expected": "有名な俳優が来るとあって、会場にはファンが殺到した。",
    "reading": "ゆうめいなはいゆうがくるとあって、かいじょうにはふぁんがさっとうした。",
    "english": "With a famous actor coming, fans flooded the venue.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "夏休み最後の日曜日とあって、遊園地は親子連れでいっぱいだった。",
    "expected": "夏休み最後の日曜日とあって、遊園地は親子連れでいっぱいだった。",
    "reading": "なつやすみさいごのにちようびとあって、ゆうえんちはおやこづれでいっぱいだった。",
    "english": "Being the last Sunday of the summer vacation, the amusement park was full of families.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "久しぶりの快晴とあって、洗濯物を干す家庭が多かった。",
    "expected": "久しぶりの快晴とあって、洗濯物を干す家庭が多かった。",
    "reading": "ひさしぶりのかいせいとあって、せんたくものをほすかていがおおかった。",
    "english": "As it was the first clear weather in a while, many households hung out their laundry.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "社長直々の指示とあって、社員たちは緊張して業務に取り組んだ。",
    "expected": "社長直々の指示とあって、社員たちは緊張して業務に取り組んだ。",
    "reading": "しゃちょうじきじきのしじとあって、しゃいんたちはきんちょうしてぎょうむにとりくんだ。",
    "english": "With direct instructions from the president, the employees worked nervously.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "閉店セールとあって、店内は通常より多くの客で混雑していた。",
    "expected": "閉店セールとあって、店内は通常より多くの客で混雑していた。",
    "reading": "へいてんせーるとあって、てんないはつうじょうよりおおくのきゃくでこんざつしていた。",
    "english": "Because it was a closing sale, the store was more crowded than usual with customers.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "注目度の高い新製品の発表会とあって、多くのメディアが集まった。",
    "expected": "注目度の高い新製品の発表会とあって、多くのメディアが集まった。",
    "reading": "ちゅうもくどのたかいしんせいひんのはっぴょうかいとあって、おおくのめでぃあがあつまった。",
    "english": "As it was the launch event for a highly anticipated new product, many media outlets gathered.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "彼の引退試合とあって、スタジアムは満員の観客で埋め尽くされた。",
    "expected": "彼の引退試合とあって、スタジアムは満員の観客で埋め尽くされた。",
    "reading": "かれのいんたいじあいとあって、すたじあむはまんいんのかんきゃくでうめつくされた。",
    "english": "Being his retirement match, the stadium was filled to capacity with spectators.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "千載一遇のチャンスとあって、彼は全力を尽くして挑戦した。",
    "expected": "千載一遇のチャンスとあって、彼は全力を尽くして挑戦した。",
    "reading": "せんざいいちぐうのちゃんすとあって、かれはぜんりょくをつくしてちょうせんした。",
    "english": "As it was a once-in-a-lifetime chance, he gave his all to the challenge.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "世界的な会議が開催されるとあって、市内の警備体制が強化された。",
    "expected": "世界的な会議が開催されるとあって、市内の警備体制が強化された。",
    "reading": "せかいてきなかいぎがかいさいされるとあって、しないのけいびたいせいがきょうかされた。",
    "english": "With an international conference being held, security in the city was tightened.",
    "grammar": "〜とあって"
  },
  {
    "spoken": "子供ではあるまいし、自分のことは自分でするべきだ。",
    "expected": "子供ではあるまいし、自分のことは自分でするべきだ。",
    "reading": "こどもではあるまいし、じぶんのことはじぶんでするべきだ。",
    "english": "You're not a child, so you should take care of your own affairs.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "神様ではあるまいし、未来のことなど誰にも分からない。",
    "expected": "神様ではあるまいし、未来のことなど誰にも分からない。",
    "reading": "かみさまではあるまいし、みらいのことなどだれにもわからない。",
    "english": "It's not like we're gods; nobody knows what the future holds.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "初めてのデートではあるまいし、そんなに緊張しなくてもいいだろう。",
    "expected": "初めてのデートではあるまいし、そんなに緊張しなくてもいいだろう。",
    "reading": "はじめてのでーとではあるまいし、そんなにきんちょうしなくてもいいだろう。",
    "english": "It's not like it's your first date, you don't need to be that nervous.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "ここは戦場ではあるまいし、もっと冷静に話し合うべきだ。",
    "expected": "ここは戦場ではあるまいし、もっと冷静に話し合うべきだ。",
    "reading": "ここはせんじょうではあるまいし、もっとれいせいにはなしあうべきだ。",
    "english": "This isn't a battlefield, we should discuss things more calmly.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "学生ではあるまいし、時間管理はしっかりしなさい。",
    "expected": "学生ではあるまいし、時間管理はしっかりしなさい。",
    "reading": "がくせいではあるまいし、じかんかんりはしっかりしなさい。",
    "english": "You're not a student anymore, so manage your time properly.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "他人事ではあるまいし、友人の悩みをもっと真剣に聞いてあげよう。",
    "expected": "他人事ではあるまいし、友人の悩みをもっと真剣に聞いてあげよう。",
    "reading": "たにんごとではあるまいし、ゆうじんのなやみをもっとしんけんにきいてあげよう。",
    "english": "It's not like it's someone else's problem; let's listen more seriously to our friend's worries.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "機械ではあるまいし、人間なのだから時には休息も必要だ。",
    "expected": "機械ではあるまいし、人間なのだから時には休息も必要だ。",
    "reading": "きかいではあるまいし、にんげんなのだからときにはきゅうそくもひつようだ。",
    "english": "We're not machines, we're human, so sometimes rest is necessary.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "赤ちゃんではあるまいし、自分の食事くらい自分で食べなさい。",
    "expected": "赤ちゃんではあるまいし、自分の食事くらい自分で食べなさい。",
    "reading": "あかちゃんではあるまいし、じぶんのしょくじくらいじぶんでたべなさい。",
    "english": "You're not a baby, eat your own meal by yourself.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "プロの料理人ではあるまいし、少し味が薄くても大目に見てください。",
    "expected": "プロの料理人ではあるまいし、少し味が薄くても大目に見てください。",
    "reading": "ぷろのりょうりにんではあるまいし、すこしあじがうすくてもおおめにみてください。",
    "english": "I'm not a professional chef, so please overlook it if the taste is a bit bland.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "締め切りが明日ではあるまいし、そんなに慌てなくても大丈夫ですよ。",
    "expected": "締め切りが明日ではあるまいし、そんなに慌てなくても大丈夫ですよ。",
    "reading": "しめきりがあしたではあるまいし、そんなにあわてなくてもだいじょうぶですよ。",
    "english": "It's not like the deadline is tomorrow, you don't need to panic like that.",
    "grammar": "〜ではあるまいし"
  },
  {
    "spoken": "先生という手前、学生たちの前でいい加減なことは言えない。",
    "expected": "先生という手前、学生たちの前でいい加減なことは言えない。",
    "reading": "せんせいというてまえ、がくせいたちのまえでいいかげんなことはいえない。",
    "english": "Being a teacher, I can't say irresponsible things in front of the students.",
    "grammar": "〜手前"
  },
  {
    "spoken": "一度「やります」と公言した手前、途中で投げ出すわけにはいかない。",
    "expected": "一度「やります」と公言した手前、途中で投げ出すわけにはいかない。",
    "reading": "いちど「やります」とこうげんしたてまえ、とちゅうでなげだすわけにはいかない。",
    "english": "Having publicly declared \"I'll do it,\" I can't just give up halfway.",
    "grammar": "〜手前"
  },
  {
    "spoken": "部長の手前、この提案に反対するとは言いにくかった。",
    "expected": "部長の手前、この提案に反対するとは言いにくかった。",
    "reading": "ぶちょうのてまえ、このていあんに はんたいするとはいいにくかった。",
    "english": "Given my boss's position, it was difficult to voice opposition to this proposal.",
    "grammar": "〜手前"
  },
  {
    "spoken": "専門家と名乗っている手前、この分野の質問には答えられないと恥ずかしい。",
    "expected": "専門家と名乗っている手前、この分野の質問には答えられないと恥ずかしい。",
    "reading": "せんもんかと なのっているてまえ、このぶんやのしつもんにはこたえられないとはずかしい。",
    "english": "Having identified myself as an expert, it would be embarrassing if I couldn't answer questions in this field.",
    "grammar": "〜手前"
  },
  {
    "spoken": "皆に奢ると約束した手前、今さら財布がないとは言えない。",
    "expected": "皆に奢ると約束した手前、今さら財布がないとは言えない。",
    "reading": "みんなにおごるとやくそくしたてまえ、いまさらさいふがないとはいえない。",
    "english": "Having promised to treat everyone, I can't very well say I don't have my wallet now.",
    "grammar": "〜手前"
  },
  {
    "spoken": "先輩という手前、後輩の失敗をフォローしないわけにはいかない。",
    "expected": "先輩という手前、後輩の失敗をフォローしないわけにはいかない。",
    "reading": "せんぱいというてまえ、こうはいのしっぱいをふぉろーしないわけにはいかない。",
    "english": "Being a senior colleague (senpai), I have to cover for my junior's (kohai's) mistakes.",
    "grammar": "〜手前"
  },
  {
    "spoken": "親友に紹介してもらった手前、無下に断ることはできなかった。",
    "expected": "親友に紹介してもらった手前、無下に断ることはできなかった。",
    "reading": "しんゆうにしょうかいしてもらったてまえ、むげにことわることはできなかった。",
    "english": "Since my best friend introduced us, I couldn't just rudely refuse.",
    "grammar": "〜手前"
  },
  {
    "spoken": "いつも偉そうなことを言っている手前、自分がミスするわけにはいかない。",
    "expected": "いつも偉そうなことを言っている手前、自分がミスするわけにはいかない。",
    "reading": "いつもえらそうなことをいっているてまえ、じぶんがみすするわけにはいかない。",
    "english": "Since I'm always saying pompous things, I absolutely cannot make a mistake myself.",
    "grammar": "〜手前"
  },
  {
    "spoken": "人前で大見得を切った手前、どんなに難しくてもやり遂げなければならない。",
    "expected": "人前で大見得を切った手前、どんなに難しくてもやり遂げなければならない。",
    "reading": "ひとまえでおおみえをきったてまえ、どんなにむずかしくてもやりとげなければならない。",
    "english": "Having made a big boast in public, I have to see it through no matter how difficult it is.",
    "grammar": "〜手前"
  },
  {
    "spoken": "案内役を引き受けた手前、道に迷うなんてことは絶対に避けたい。",
    "expected": "案内役を引き受けた手前、道に迷うなんてことは絶対に避けたい。",
    "reading": "あんないやくをひきうけたてまえ、みちにまようなんてことはぜったいにさけたい。",
    "english": "Having accepted the role of guide, I absolutely want to avoid getting lost.",
    "grammar": "〜手前"
  },
  {
    "spoken": "若さゆえの過ちというものもある。",
    "expected": "若さゆえの過ちというものもある。",
    "reading": "わかさゆえのあやまちというものもある。",
    "english": "There are such things as mistakes made due to youth.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "経験不足ゆえに、彼は簡単なミスを犯してしまった。",
    "expected": "経験不足ゆえに、彼は簡単なミスを犯してしまった。",
    "reading": "けいけんぶそくゆえに、かれはかんたんなみすをおかしてしまった。",
    "english": "Due to lack of experience, he made a simple mistake.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "国民の無関心ゆえに、政治改革が進まないという側面もある。",
    "expected": "国民の無関心ゆえに、政治改革が進まないという側面もある。",
    "reading": "こくみんのむかんしんゆえに、せいじかいかくがすすまないというそくめんもある。",
    "english": "There's an aspect where political reform doesn't progress due to the public's indifference.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "貧しさゆえに、十分な教育を受けられなかった子供たちがいる。",
    "expected": "貧しさゆえに、十分な教育を受けられなかった子供たちがいる。",
    "reading": "まずしさゆえに、じゅうぶんなきょういくをうけられなかったこどもたちがいる。",
    "english": "There are children who couldn't receive adequate education due to poverty.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "彼はその誠実さゆえに、多くの人々から信頼されている。",
    "expected": "彼はその誠実さゆえに、多くの人々から信頼されている。",
    "reading": "かれはそのせいじつさゆえに、おおくのひとびとからしんらいされている。",
    "english": "He is trusted by many people because of his sincerity.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "悪天候ゆえ、本日のイベントは中止とさせていただきます。",
    "expected": "悪天候ゆえ、本日のイベントは中止とさせていただきます。",
    "reading": "あくてんこうゆえ、ほんじつのいべんとはちゅうしとさせていただきます。",
    "english": "Due to the bad weather, today's event will be cancelled. (Formal announcement)",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "言葉の壁ゆえに、誤解が生じることも少なくない。",
    "expected": "言葉の壁ゆえに、誤解が生じることも少なくない。",
    "reading": "ことばのかべゆえに、ごかいがしょうじることもすくなくない。",
    "english": "Misunderstandings often arise due to language barriers.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "人手不足ゆえ、一時的に営業時間を短縮しております。",
    "expected": "人手不足ゆえ、一時的に営業時間を短縮しております。",
    "reading": "ひとでぶそくゆえ、いちじてきにえいぎょうじかんをたんしゅくしております。",
    "english": "We are temporarily shortening business hours due to a staff shortage. (Formal notice)",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "その美しさゆえに、この絵画は国宝に指定された。",
    "expected": "その美しさゆえに、この絵画は国宝に指定された。",
    "reading": "そのうつくしさゆえに、このかいがはこくほうにしていされた。",
    "english": "This painting was designated as a national treasure because of its beauty.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "古い慣習ゆえに、変化を受け入れるのが難しい地域もある。",
    "expected": "古い慣習ゆえに、変化を受け入れるのが難しい地域もある。",
    "reading": "ふるいかんしゅうゆえに、へんかをうけいれるのがむずかしいちいきもある。",
    "english": "There are regions where it is difficult to accept change due to old customs.",
    "grammar": "〜ゆえ（に）"
  },
  {
    "spoken": "彼の苦労を思えば、その成功を喜ぶ気持ちは察するにかたくない。",
    "expected": "彼の苦労を思えば、その成功を喜ぶ気持ちは察するにかたくない。",
    "reading": "かれのくろうをおもえば、そのせいこうをよろこぶきもちはさっするにかたくない。",
    "english": "Considering his hardships, it's not hard to imagine the joy he feels about his success.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "当時の混乱した状況は、現代の我々には想像するにかたくない。",
    "expected": "当時の混乱した状況は、現代の我々には想像するにかたくない。",
    "reading": "とうじのこんらんしたじょうきょうは、げんだいのわれわれにはそうぞうするにかたくない。",
    "english": "It is not difficult for us today to imagine the chaotic situation at that time.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "愛するペットを失った彼女の悲しみは、察するにかたくない。",
    "expected": "愛するペットを失った彼女の悲しみは、察するにかたくない。",
    "reading": "あいするぺっとをうしなったかのじょのかなしみは、さっするにかたくない。",
    "english": "It's not hard to imagine her sadness after losing her beloved pet.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "長年の研究が実を結んだ時の研究者の喜びは、想像にかたくない。",
    "expected": "長年の研究が実を結んだ時の研究者の喜びは、想像にかたくない。",
    "reading": "ながねんのけんきゅうがみをむすんだときのけんきゅうしゃのよろこびは、そうぞうにかたくない。",
    "english": "It's easy to imagine the researcher's joy when years of research bore fruit.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "被災地の惨状を見れば、住民たちの苦悩は理解にかたくない。",
    "expected": "被災地の惨状を見れば、住民たちの苦悩は理解にかたくない。",
    "reading": "ひさいちのさんじょうをみれば、じゅうみんたちのくのうはりかいにかたくない。",
    "english": "Seeing the devastation in the disaster-stricken area, it's not difficult to understand the residents' suffering.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "オリンピックで金メダルを獲得した選手の感動は、察するにかたくない。",
    "expected": "オリンピックで金メダルを獲得した選手の感動は、察するにかたくない。",
    "reading": "おりんぴっくできんめだるをかくとくしたせんしゅのかんどうは、さっするにかたくない。",
    "english": "It's not hard to imagine the emotions of the athlete who won a gold medal at the Olympics.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "文化や習慣の違いから生じる誤解は、想像にかたくない。",
    "expected": "文化や習慣の違いから生じる誤解は、想像にかたくない。",
    "reading": "ぶんかやしゅうかんのちがいからしょうじるごかいは、そうぞうにかたくない。",
    "english": "It's easy to imagine the misunderstandings that arise from cultural and habitual differences.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "膨大な資料を前にして、調査の困難さは推測するにかたくない。",
    "expected": "膨大な資料を前にして、調査の困難さは推測するにかたくない。",
    "reading": "ぼうだいなしりょうをまえにして、ちょうさのこんんんさはすいそくするにかたくない。",
    "english": "Faced with a vast amount of material, it is not hard to guess the difficulty of the investigation.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "初めての海外生活における不安は、察するにかたくない。",
    "expected": "初めての海外生活における不安は、察するにかたくない。",
    "reading": "はじめてのかいがいせいかつにおけるふあんは、さっするにかたくない。",
    "english": "It's not difficult to imagine the anxiety involved in living abroad for the first time.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "彼がどれほど努力してきたかを知れば、今回の昇進を喜ぶ気持ちも理解にかたくない。",
    "expected": "彼がどれほど努力してきたかを知れば、今回の昇進を喜ぶ気持ちも理解にかたくない。",
    "reading": "かれがどれほどどりょくしてきたかをしれば、こんかいのしょうしんをよろこぶきもちもりかいにかたくない。",
    "english": "Knowing how much effort he put in, it's easy to understand his joy at this promotion.",
    "grammar": "〜にかたくない"
  },
  {
    "spoken": "喉が痛くて、水を飲もうにも飲めない状態だった。",
    "expected": "喉が痛くて、水を飲もうにも飲めない状態だった。",
    "reading": "のどがいたくて、みずをのもうにものめないじょうたいだった。",
    "english": "My throat was so sore that I wanted to drink water but couldn't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "あまりに突然の出来事で、悲しむに悲しめなかった。",
    "expected": "あまりに突然の出来事で、悲しむに悲しめなかった。",
    "reading": "あまりにとつぜんのできごとで、かなしむにかなしめなかった。",
    "english": "It happened so suddenly that I wanted to grieve but couldn't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "仕事が山積みで、休みたくても休むに休めない状況だ。",
    "expected": "仕事が山積みで、休みたくても休むに休めない状況だ。",
    "reading": "しごとがやまづみで、やすみたくてもやすむにやすめないじょうきょうだ。",
    "english": "I have a mountain of work, so even though I want to rest, I'm in a situation where I can't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "引っ越しの準備で忙しく、荷物を片付けようにも片付けられない。",
    "expected": "引っ越しの準備で忙しく、荷物を片付けようにも片付けられない。",
    "reading": "ひっこしのじゅんびでいそがしく、にもつをかたづけようにもかたづけられない。",
    "english": "I'm busy preparing to move, so I want to tidy up my belongings but I can't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "会議中は他の電話に出ようにも出られなかった。",
    "expected": "会議中は他の電話に出ようにも出られなかった。",
    "reading": "かいぎちゅうはほかのでんわにでようにもでられなかった。",
    "english": "During the meeting, I wanted to answer other calls but couldn't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "複雑な気持ちで、彼女に本当のことを話そうにも話せなかった。",
    "expected": "複雑な気持ちで、彼女に本当のことを話そうにも話せなかった。",
    "reading": "ふくざつなきもちで、かのじょにほんとうのことをはなそうにもはなせなかった。",
    "english": "With mixed feelings, I wanted to tell her the truth but couldn't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "事故で足に怪我をして、歩くに歩けない。",
    "expected": "事故で足に怪我をして、歩くに歩けない。",
    "reading": "じこであしにけがをして、あるくにあるけない。",
    "english": "I injured my leg in an accident, and I want to walk but I can't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "緊張しすぎて、声を出そうにも出せなかった。",
    "expected": "緊張しすぎて、声を出そうにも出せなかった。",
    "reading": "きんちょうしすぎて、こえをだそうにもだせなかった。",
    "english": "I was so nervous that I wanted to speak but couldn't make a sound.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "資料が多すぎて、どこから手をつけるべきか、始めようにも始められない。",
    "expected": "資料が多すぎて、どこから手をつけるべきか、始めようにも始められない。",
    "reading": "しりょうがおおすぎて、どこからてをつけるべきか、はじめようにもはじめられない。",
    "english": "There are too many documents; I don't know where to start, I want to begin but I can't.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "彼は自分の意見を言いたくても、上司の前では言うに言えないらしい。",
    "expected": "彼は自分の意見を言いたくても、上司の前では言うに言えないらしい。",
    "reading": "かれはじぶんのいけんをいいたくても、じょうしのまえではいうにいえないらしい。",
    "english": "Apparently, even if he wants to express his opinion, he can't bring himself to say it in front of his boss.",
    "grammar": "〜に〜ない・〜（よ）うにも〜ない"
  },
  {
    "spoken": "締め切りが迫っているので、のんびりしてはいられない。",
    "expected": "締め切りが迫っているので、のんびりしてはいられない。",
    "reading": "しめきりがせまっているので、のんびりしてはいられない。",
    "english": "The deadline is approaching, so I can't afford to relax.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "子供が熱を出したと聞いて、仕事を続けてはいられなかった。",
    "expected": "子供が熱を出したと聞いて、仕事を続けてはいられなかった。",
    "reading": "こどもがねつをだしたときいて、しごとをつづけてはいられなかった。",
    "english": "Hearing that my child had a fever, I couldn't keep working.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "試験前日だというのに、遊んでばかりはいられない。",
    "expected": "試験前日だというのに、遊んでばかりはいられない。",
    "reading": "しけんぜんじつだというのに、あそんでばかりはいられない。",
    "english": "Even though it's the day before the exam, I can't just keep playing around.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "火事だと聞いたら、誰だって落ち着いてはいられないだろう。",
    "expected": "火事だと聞いたら、誰だって落ち着いてはいられないだろう。",
    "reading": "かじだときいたら、だれだっておちついてはいられないだろう。",
    "english": "If you heard there was a fire, surely anyone wouldn't be able to remain calm.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "目の前で困っている人を見たら、何もしないではいられない。",
    "expected": "目の前で困っている人を見たら、何もしないではいられない。",
    "reading": "めのまえでこまっているひとをみたら、なにもしないではいられない。",
    "english": "Seeing someone in trouble right in front of me, I can't just do nothing.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "明日は早朝出発だから、いつまでも起きてはいられない。",
    "expected": "明日は早朝出発だから、いつまでも起きてはいられない。",
    "reading": "あしたはそうちょうしゅっぱつだから、いつまでもおきてはいられない。",
    "english": "I have an early morning departure tomorrow, so I can't stay up indefinitely.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "このプロジェクトが成功するかどうか、心配で座ってはいられない。",
    "expected": "このプロジェクトが成功するかどうか、心配で座ってはいられない。",
    "reading": "このぷろじぇくとがせいこうするかどうか、しんぱいですわってはいられない。",
    "english": "I'm so worried about whether this project will succeed that I can't just sit still.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "電車に乗り遅れそうだったので、ゆっくり歩いてはいられなかった。",
    "expected": "電車に乗り遅れそうだったので、ゆっくり歩いてはいられなかった。",
    "reading": "でんしゃにのりおくれそうだったので、ゆっくりあるいてはいられなかった。",
    "english": "I was about to miss the train, so I couldn't afford to walk slowly.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "不正が行われているのを知って、黙ってはいられなかった。",
    "expected": "不正が行われているのを知って、黙ってはいられなかった。",
    "reading": "ふせいがわれているのをしって、だまってはいられなかった。",
    "english": "Knowing that misconduct was taking place, I couldn't remain silent.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "緊急事態が発生し、悠長に構えてはいられない状況となった。",
    "expected": "緊急事態が発生し、悠長に構えてはいられない状況となった。",
    "reading": "きんきゅうじたいがはっせいし、ゆうちょうにかまえてはいられないじょうきょうとなった。",
    "english": "An emergency occurred, creating a situation where we couldn't afford to be complacent.",
    "grammar": "〜て（は）いられない"
  },
  {
    "spoken": "素人の私には、その芸術作品の価値を判断すべくもない。",
    "expected": "素人の私には、その芸術作品の価値を判断すべくもない。",
    "reading": "しろうとのわたしには、そのげいじゅつさくひんのかちをはんだんすべくもない。",
    "english": "As an amateur, there is no way for me to judge the value of that artwork.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "十分な証拠がない限り、彼を有罪と断定すべくもない。",
    "expected": "十分な証拠がない限り、彼を有罪と断定すべくもない。",
    "reading": "じゅうぶんなしょうこがないかぎり、かれをゆうざいとだんていすべくもない。",
    "english": "Without sufficient evidence, it is impossible to conclude that he is guilty.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "当時の技術力では、そのような精密な機械を作るべくもなかった。",
    "expected": "当時の技術力では、そのような精密な機械を作るべくもなかった。",
    "reading": "とうじのぎじゅつりょくでは、そのようなせいみつなきかいをつくるべくもなかった。",
    "english": "With the technology of the time, it was impossible to create such a precise machine.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "外部の者には、会社の内部事情を知るべくもない。",
    "expected": "外部の者には、会社の内部事情を知るべくもない。",
    "reading": "がいぶのものには、かいしゃのないぶじじょうをしるべくもない。",
    "english": "Outsiders have no way of knowing the internal affairs of the company.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "限られた情報だけでは、事件の真相を解明すべくもない。",
    "expected": "限られた情報だけでは、事件の真相を解明すべくもない。",
    "reading": "かぎられたじょうほうだけでは、じけんのしんそうをかいめいすべくもない。",
    "english": "With only limited information, it's impossible to uncover the truth of the incident.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "初心者がいきなりプロの選手に勝つなど、望むべくもないことだ。",
    "expected": "初心者がいきなりプロの選手に勝つなど、望むべくもないことだ。",
    "reading": "しょしんしゃがいきなりぷろのせんしゅにかつなど、のぞむべくもないことだ。",
    "english": "It is impossible to expect a beginner to suddenly beat a professional player.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "彼が今どこで何をしているか、我々には知るべくもない。",
    "expected": "彼が今どこで何をしているか、我々には知るべくもない。",
    "reading": "かれがいまどこでなにをしているか、われわれにはしるべくもない。",
    "english": "We have no way of knowing where he is or what he is doing now.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "あの状況下で彼が助かったのは奇跡であり、通常では望むべくもない。",
    "expected": "あの状況下で彼が助かったのは奇跡であり、通常では望むべくもない。",
    "reading": "あのじょうきょうかでかれがたすかったのはきせきであり、つうじょうではのぞむべくもない。",
    "english": "It was a miracle he survived under those circumstances; normally, it would have been impossible to hope for.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "古代文明の技術が現代科学と比較すべくもないほど高度だったとは考えにくい。",
    "expected": "古代文明の技術が現代科学と比較すべくもないほど高度だったとは考えにくい。",
    "reading": "こだいぶんめいのぎじゅつがげんだいかがくとひかくすべくもないほどこうどだったとはかんがえにくい。",
    "english": "It's hard to believe that ancient civilizations had technology so advanced it's impossible to compare with modern science.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "戦争の悲劇を経験していない世代には、その恐ろしさを真に想像すべくもないかもしれない。",
    "expected": "戦争の悲劇を経験していない世代には、その恐ろしさを真に想像すべくもないかもしれない。",
    "reading": "せんそうのひげきをけいけんしていないせだいには、そのおそろしさをしんにそうぞうすべくもないかもしれない。",
    "english": "Generations that haven't experienced the tragedy of war might have no way to truly imagine its horror.",
    "grammar": "〜べくもない"
  },
  {
    "spoken": "関係者以外、この区域に立ち入るべからず。",
    "expected": "関係者以外、この区域に立ち入るべからず。",
    "reading": "かんけいしゃいがい、このくいきにたちいるべからず。",
    "english": "Unauthorized personnel must not enter this area.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "彼のその発言は、指導者としてあるべからざるものだった。",
    "expected": "彼のその発言は、指導者としてあるべからざるものだった。",
    "reading": "かれのそのはつげんは、しどうしゃとしてあるべからざるものだった。",
    "english": "That remark of his was unacceptable for a leader.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "平和な社会を築く上で、暴力は許すべからざる行為である。",
    "expected": "平和な社会を築く上で、暴力は許すべからざる行為である。",
    "reading": "へいわなしゃかいをきずくうえで、ぼうりょくはゆるすべからざるこういである。",
    "english": "In building a peaceful society, violence is an unforgivable act.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "伝統文化は、我々が次世代に伝えるべき、失うべからざる遺産だ。",
    "expected": "伝統文化は、我々が次世代に伝えるべき、失うべからざる遺産だ。",
    "reading": "でんとうぶんかは、われわれがじせだいにつたえるべき、うしなうべからざるいさんだ。",
    "english": "Traditional culture is an indispensable heritage that we must pass on to the next generation.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "研究においては、客観性は欠くべからざる要素である。",
    "expected": "研究においては、客観性は欠くべからざる要素である。",
    "reading": "けんきゅうにおいては、きゃっかんせいはかくべからざるようそである。",
    "english": "Objectivity is an indispensable element in research.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "館内では、携帯電話の通話は慎むべし。他の利用者の迷惑となるべからず。",
    "expected": "館内では、携帯電話の通話は慎むべし。他の利用者の迷惑となるべからず。",
    "reading": "かんないでは、けいたいでんわのつうわはつつしむべし。ほかのりようしゃのめいわくとなるべからず。",
    "english": "Inside the building, please refrain from making calls on mobile phones. You must not disturb other users.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "この教訓を忘れるべからず。",
    "expected": "この教訓を忘れるべからず。",
    "reading": "このきょうくんをわすれるべからず。",
    "english": "This lesson must not be forgotten.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "天然記念物には、触れるべからず。",
    "expected": "天然記念物には、触れるべからず。",
    "reading": "てんねんきねんぶつには、ふれるべからず。",
    "english": "Do not touch the natural monument.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "人の信頼を裏切ることは、断じてするべからざる行為だ。",
    "expected": "人の信頼を裏切ることは、断じてするべからざる行為だ。",
    "reading": "ひとのしんらいをうらぎることは、だんじてするべからざるこういだ。",
    "english": "Betraying someone's trust is an act that absolutely must not be done.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "彼はチームにとって代わるべからざる存在となっている。",
    "expected": "彼はチームにとって代わるべからざる存在となっている。",
    "reading": "かれはちーむにとってかわるべからざるそんざいとなっている。",
    "english": "He has become an irreplaceable presence for the team.",
    "grammar": "〜べからず・〜べからざる"
  },
  {
    "spoken": "賄賂を受け取るなど、政治家としてあるまじき行為だ。",
    "expected": "賄賂を受け取るなど、政治家としてあるまじき行為だ。",
    "reading": "わいろをうけとるなど、せいじかとしてあるまじきこういだ。",
    "english": "Accepting bribes is conduct unbecoming of a politician.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "生徒を差別するなど、教育者にあるまじき態度である。",
    "expected": "生徒を差別するなど、教育者にあるまじき態度である。",
    "reading": "せいとをさべつするなど、きょういくしゃにあるまじきたいどである。",
    "english": "Discriminating against students is an attitude unacceptable for an educator.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "公の場でそのような暴言を吐くとは、社会人にあるまじき振る舞いだ。",
    "expected": "公の場でそのような暴言を吐くとは、社会人にあるまじき振る舞いだ。",
    "reading": "おおやけのばでそのようなぼうげんをはくとは、しゃかいじんにあるまじきふるまいだ。",
    "english": "Using such abusive language in public is behavior unbecoming of a working adult.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "人の弱みに付け込むような商売は、商人にあるまじきことだ。",
    "expected": "人の弱みに付け込むような商売は、商人にあるまじきことだ。",
    "reading": "ひとのよわみにつけこむようなしょうばいは、しょうにんにあるまじきことだ。",
    "english": "Taking advantage of people's weaknesses in business is something a merchant should not do.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "患者の秘密を漏らすなど、医者にあるまじき行為だ。",
    "expected": "患者の秘密を漏らすなど、医者にあるまじき行為だ。",
    "reading": "かんじゃのひみつをもらすなど、いしゃにあるまじきこういだ。",
    "english": "Leaking a patient's confidentiality is an act unbecoming of a doctor.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "試合中に相手選手を故意に傷つけるのは、スポーツマンにあるまじき反則だ。",
    "expected": "試合中に相手選手を故意に傷つけるのは、スポーツマンにあるまじき反則だ。",
    "reading": "しあいちゅうにあいてせんしゅをこいにきずつけるのは、すぽーつまんにあるまじきはんそくだ。",
    "english": "Intentionally injuring an opponent during a match is a foul unbecoming of a sportsman.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "証拠を隠蔽するなど、警察官にあるまじき行動だ。",
    "expected": "証拠を隠蔽するなど、警察官にあるまじき行動だ。",
    "reading": "しょうこをいんぺいするなど、けいさつかんにあるまじきこうどうだ。",
    "english": "Concealing evidence is behavior unacceptable for a police officer.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "部下に対してパワハラを行うなど、上司にあるまじき振る舞いだ。",
    "expected": "部下に対してパワハラを行うなど、上司にあるまじき振る舞いだ。",
    "reading": "ぶかにたいしてぱわはらをこなうなど、じょうしにあるまじきふるまいだ。",
    "english": "Engaging in power harassment towards subordinates is conduct unbecoming of a superior.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "親友を裏切るとは、人としてあるまじき行いである。",
    "expected": "親友を裏切るとは、人としてあるまじき行いである。",
    "reading": "しんゆうをうらぎるとは、ひととしてあるまじきおこないである。",
    "english": "Betraying a close friend is an act unacceptable for a human being.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "試験でカンニングをするなど、学生にあるまじき不正行為だ。",
    "expected": "試験でカンニングをするなど、学生にあるまじき不正行為だ。",
    "reading": "しけんでかんにんぐをするなど、がくせいにあるまじきふせいこういだ。",
    "english": "Cheating on an exam is academic misconduct unbecoming of a student.",
    "grammar": "〜まじき"
  },
  {
    "spoken": "うちの猫ときたら、一番高いソファで爪を研ぐんだから困る。",
    "expected": "うちの猫ときたら、一番高いソファで爪を研ぐんだから困る。",
    "reading": "うちのねこときたら、いちばんたかいそふぁでつめをとぐんだからこまる。",
    "english": "My cat, honestly, sharpens its claws on the most expensive sofa, it's so troublesome.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "最近の若者ときたら、礼儀を知らない人が増えた気がする。",
    "expected": "最近の若者ときたら、礼儀を知らない人が増えた気がする。",
    "reading": "さいきんのわかものときたら、れいぎをしらないひとがふえたきがする。",
    "english": "Young people these days, it feels like the number of people who don't know manners has increased.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "このパソコンときたら、肝心な時にいつもフリーズする。",
    "expected": "このパソコンときたら、肝心な時にいつもフリーズする。",
    "reading": "このぱそこんときたら、かんじんなときにいつもふりーずする。",
    "english": "This computer, honestly, it always freezes at crucial moments.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "うちの部長ときたら、自分の意見ばかり押し付けてくる。",
    "expected": "うちの部長ときたら、自分の意見ばかり押し付けてくる。",
    "reading": "うちのぶちょうときたら、じぶんのいけんばかりおしつけてくる。",
    "english": "Our department manager, honestly, just forces their own opinions on us.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "満員電車ときたら、毎朝うんざりさせられる。",
    "expected": "満員電車ときたら、毎朝うんざりさせられる。",
    "reading": "まんいんでんしゃときたら、まいあさうんざりさせられる。",
    "english": "Packed trains, honestly, they make me sick every morning.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "あのレストランときたら、値段は高いしサービスも悪い。",
    "expected": "あのレストランときたら、値段は高いしサービスも悪い。",
    "reading": "あのれすとらんときたら、ねだんはたかいしさーびすもわるい。",
    "english": "That restaurant, honestly, the prices are high and the service is bad too.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "梅雨の時期ときたら、洗濯物が乾かなくて本当に困る。",
    "expected": "梅雨の時期ときたら、洗濯物が乾かなくて本当に困る。",
    "reading": "つゆのじきときたら、せんたくものがかわかなくてほんとうにこまる。",
    "english": "The rainy season, honestly, it's really a pain because laundry doesn't dry.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "うちの息子ときたら、勉強もしないでゲームばかりしている。",
    "expected": "うちの息子ときたら、勉強もしないでゲームばかりしている。",
    "reading": "うちのむすこときたら、べんきょうもしないでげーむばかりしている。",
    "english": "My son, honestly, he just plays games without studying.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "隣の工事現場ときたら、朝早くからうるさくて眠れない。",
    "expected": "隣の工事現場ときたら、朝早くからうるさくて眠れない。",
    "reading": "となりのこうじげんばときたら、あさはやくからうるさくてねむれない。",
    "english": "The construction site next door, honestly, it's so noisy from early morning I can't sleep.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "政府の対応ときたら、いつも後手後手に回っている。",
    "expected": "政府の対応ときたら、いつも後手後手に回っている。",
    "reading": "せいふのたいおうときたら、いつもごてごてにまわっている。",
    "english": "The government's response, honestly, is always one step behind.",
    "grammar": "〜ときたら"
  },
  {
    "spoken": "社長ともなると、会社の全責任を負わなければならない。",
    "expected": "社長ともなると、会社の全責任を負わなければならない。",
    "reading": "しゃちょうともなると、かいしゃのぜんせきにんをおわなければならない。",
    "english": "When one becomes the president, they must bear full responsibility for the company.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "大学生ともなれば、自分の行動には自分で責任を持つべきだ。",
    "expected": "大学生ともなれば、自分の行動には自分で責任を持つべきだ。",
    "reading": "だいがくせいともなれば、じぶんのこうどうにはじぶんでせきにんをもつべきだ。",
    "english": "Once you become a university student, you should take responsibility for your own actions.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "師走ともなると、さすがに街も人も慌ただしくなる。",
    "expected": "師走ともなると、さすがに街も人も慌ただしくなる。",
    "reading": "しわすともなると、さすがにまちもひともあわただしくなる。",
    "english": "When it becomes December, the town and people naturally get busy.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "オリンピック選手ともなると、並大抵ではないプレッシャーの中で戦っている。",
    "expected": "オリンピック選手ともなると、並大抵ではないプレッシャーの中で戦っている。",
    "reading": "おりんぴっくせんしゅともなると、なみたいていではないぷれっしゃーのなかでたたかっている。",
    "english": "When you are an Olympic athlete, you compete under extraordinary pressure.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "海外赴任ともなれば、家族にも大きな影響が出るだろう。",
    "expected": "海外赴任ともなれば、家族にも大きな影響が出るだろう。",
    "reading": "かいがいふにんともなれば、かぞくにもおおきなえいきょうがでるだろう。",
    "english": "If it comes to an overseas assignment, it will likely have a significant impact on the family too.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "医者ともなると、人の命を預かる重責を担うことになる。",
    "expected": "医者ともなると、人の命を預かる重責を担うことになる。",
    "reading": "いしゃともなると、ひとのいのちをあずかるじゅうせきをになうことになる。",
    "english": "Once one becomes a doctor, they bear the heavy responsibility of taking care of people's lives.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "卒業間近ともなれば、学生たちは将来について真剣に考え始める。",
    "expected": "卒業間近ともなれば、学生たちは将来について真剣に考え始める。",
    "reading": "そつぎょうまぢかともなれば、がくせいたちはしょうらいについてしんけんにかんがえはじめる。",
    "english": "When graduation draws near, students begin to think seriously about their future.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "母親ともなると、子供のことが何よりも優先になるものだ。",
    "expected": "母親ともなると、子供のことが何よりも優先になるものだ。",
    "reading": "ははおやともなると、こどものことがなによりもゆうせんになるものだ。",
    "english": "When one becomes a mother, her child naturally becomes her top priority.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "夏休みともなると、この海岸は多くの海水浴客で賑わう。",
    "expected": "夏休みともなると、この海岸は多くの海水浴客で賑わう。",
    "reading": "なつやすみともなると、このかいがんは多くのかいすいよくきゃくでにぎわう。",
    "english": "When summer vacation arrives, this beach becomes crowded with many swimmers.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "大臣ともなれば、その発言には大きな影響力がある。",
    "expected": "大臣ともなれば、その発言には大きな影響力がある。",
    "reading": "だいじんともなれば、そのはつげんにはおおきなえいきょうりょくがある。",
    "english": "When one becomes a government minister, their statements carry significant influence.",
    "grammar": "〜ともなると・〜ともなれば"
  },
  {
    "spoken": "大学教授ともあろう人が、学生の論文を盗用するなんて信じられない。",
    "expected": "大学教授ともあろう人が、学生の論文を盗用するなんて信じられない。",
    "reading": "だいがくきょうじゅともあろうひとが、がくせいのろんぶんをとうようするなんてしんじられない。",
    "english": "It's unbelievable that someone like a university professor would plagiarize a student's paper.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "国会議員ともあろう方が、公の場で暴言を吐くとは何事か。",
    "expected": "国会議員ともあろう方が、公の場で暴言を吐くとは何事か。",
    "reading": "こっかいぎいんともあろうかたが、おおやけのばでぼうげんをはくとはなにごとか。",
    "english": "What is the meaning of someone like a member of parliament uttering abusive language in public?",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "経験豊富なベテランともあろう選手が、あんな初歩的なミスをするとは。",
    "expected": "経験豊富なベテランともあろう選手が、あんな初歩的なミスをするとは。",
    "reading": "けいけんほうふなべてらんともあろうせんしゅが、あんなしょほてきなみすをするとは。",
    "english": "For a seasoned veteran player like him to make such a basic mistake...",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "一流企業の社長ともあろう方が、脱税で逮捕されるとは情けない。",
    "expected": "一流企業の社長ともあろう方が、脱税で逮捕されるとは情けない。",
    "reading": "いちりゅうきぎょうのしゃちょうともあろうかたが、だつぜいでたいほされるとはなさけない。",
    "english": "It's pathetic that someone like the president of a top company would be arrested for tax evasion.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "警察官ともあろう者が、市民に対して威圧的な態度をとるべきではない。",
    "expected": "警察官ともあろう者が、市民に対して威圧的な態度をとるべきではない。",
    "reading": "けいさつかんともあろうものが、しみんにたいしていあつてきなたいどをとるべきではない。",
    "english": "Someone who is a police officer should not take an intimidating attitude towards citizens.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "校長先生ともあろう方が、飲酒運転で事故を起こすとは言語道断だ。",
    "expected": "校長先生ともあろう方が、飲酒運転で事故を起こすとは言語道断だ。",
    "reading": "こうちょうせんせいともあろうかたが、いんしゅうんてんでじこをおこすとはごんごどうだんだ。",
    "english": "It's outrageous that someone like the school principal would cause an accident while driving drunk.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "裁判官ともあろう人が、個人的な感情で判決を左右するようなことがあってはならない。",
    "expected": "裁判官ともあろう人が、個人的な感情で判決を左右するようなことがあってはならない。",
    "reading": "さいばんかんともあろうひとが、こじんてきなかんじょうではんけつをさゆうするようなことがあってはならない。",
    "english": "Someone like a judge must not let personal feelings sway their judgment.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "医師ともあろう者が、患者の秘密を漏らすなど、許されることではない。",
    "expected": "医師ともあろう者が、患者の秘密を漏らすなど、許されることではない。",
    "reading": "いしともあろうものが、かんじゃのひみつをもらすなど、ゆるされることではない。",
    "english": "It's unforgivable for someone like a doctor to leak a patient's confidential information.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "教師ともあろうものが、生徒を差別するなど、あってはならないことだ。",
    "expected": "教師ともあろうものが、生徒を差別するなど、あってはならないことだ。",
    "reading": "きょうしともあろうものが、せいとをさべつするなど、あってはならないことだ。",
    "english": "It's unacceptable for someone who is a teacher to discriminate against students.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "会社の代表ともあろう人間が、会議に遅刻するとは、社員に示す態度ではない。",
    "expected": "会社の代表ともあろう人間が、会議に遅刻するとは、社員に示す態度ではない。",
    "reading": "かいしゃのだいひょうともあろうにんげんが、かいぎにちこくするとは、しゃいんにしめすたいどではない。",
    "english": "For someone who is the company representative to be late for a meeting is not the attitude to show employees.",
    "grammar": "〜ともあろう"
  },
  {
    "spoken": "リーダーたるものは、常にチーム全体のことを考えて行動すべきだ。",
    "expected": "リーダーたるものは、常にチーム全体のことを考えて行動すべきだ。",
    "reading": "りーだーたるものは、つねにちーむぜんたいのことをかんがえてこうどうすべきだ。",
    "english": "Those who are leaders should always act thinking about the entire team.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "教育者たるものは、自らが学び続ける姿勢を示さなければならない。",
    "expected": "教育者たるものは、自らが学び続ける姿勢を示さなければならない。",
    "reading": "きょういくしゃたるものは、みずからがまなびつづけるしせいをしめさなければならない。",
    "english": "Those who are educators must demonstrate an attitude of continuous learning themselves.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "プロの選手たるもの、結果が全ての世界で生きていることを自覚すべきだ。",
    "expected": "プロの選手たるもの、結果が全ての世界で生きていることを自覚すべきだ。",
    "reading": "ぷろのせんしゅたるもの、けっかがすべてのせかいでいきていることをじかくすべきだ。",
    "english": "Professional athletes should be aware that they live in a world where results are everything.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "社会人たるもの、時間管理と体調管理は基本中の基本だ。",
    "expected": "社会人たるもの、時間管理と体調管理は基本中の基本だ。",
    "reading": "しゃかいじんたるもの、じかんかんりとたいちょうかんりはきほんちゅうのきほんだ。",
    "english": "For working adults, time management and health management are the absolute basics.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "経営者たるもの、会社の将来を見据えた長期的な視点を持つ必要がある。",
    "expected": "経営者たるもの、会社の将来を見据えた長期的な視点を持つ必要がある。",
    "reading": "けいえいしゃたるもの、かいしゃのしょうらいをみすえたちょうきてきなしてんをもつひつようがある。",
    "english": "Those who are managers need to have a long-term perspective focused on the company's future.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "医者たるもの、患者の苦しみに寄り添う心を持つべきである。",
    "expected": "医者たるもの、患者の苦しみに寄り添う心を持つべきである。",
    "reading": "いしゃたるもの、かんじゃのくるしみによりそうこころをもつべきである。",
    "english": "Doctors should possess a heart that empathizes with the suffering of their patients.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "親たるもの、子供の手本となるような生き方を心がけたい。",
    "expected": "親たるもの、子供の手本となるような生き方を心がけたい。",
    "reading": "おやたるもの、こどものてほんとなるようないきかたをこころがけたい。",
    "english": "As parents, we want to strive to live in a way that sets an example for our children.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "学者たるものは、真理の探究に生涯を捧げる覚悟が必要だ。",
    "expected": "学者たるものは、真理の探究に生涯を捧げる覚悟が必要だ。",
    "reading": "がくしゃたるものは、しんりのたんきゅうにしょうがいをささげるかくごがひつようだ。",
    "english": "Scholars need the resolve to dedicate their lives to the pursuit of truth.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "ジャーナリストたるもの、権力に屈せず事実を報道する使命がある。",
    "expected": "ジャーナリストたるもの、権力に屈せず事実を報道する使命がある。",
    "reading": "じゃーなりすとたるもの、けんりょくにくっせずじじつをほうどうするしめいがある。",
    "english": "Journalists have a mission to report the facts without yielding to power.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "武士たるもの、主君への忠誠を第一と考えるべきだ。",
    "expected": "武士たるもの、主君への忠誠を第一と考えるべきだ。",
    "reading": "ぶしたるもの、しゅくんへのちゅうせいをだいいちとかんがえるべきだ。",
    "english": "A samurai should consider loyalty to his lord paramount.",
    "grammar": "〜たるもの（は）"
  },
  {
    "spoken": "彼は経験が浅いなりに、一生懸命プロジェクトに取り組んでいる。",
    "expected": "彼は経験が浅いなりに、一生懸命プロジェクトに取り組んでいる。",
    "reading": "かれはけいけんがあさいなりに、いっしょうけんめいぷろじぇくとにとりくんでいる。",
    "english": "Although he lacks experience, he is working hard on the project in his own way.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "子供は子供なりに、自分たちの世界のルールを理解している。",
    "expected": "子供は子供なりに、自分たちの世界のルールを理解している。",
    "reading": "こどもはこどもなりに、じぶんたちのせかいのるーるをりかいしている。",
    "english": "Children, in their own way, understand the rules of their world.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "予算が少ないなりに、工夫して素晴らしいイベントを企画した。",
    "expected": "予算が少ないなりに、工夫して素晴らしいイベントを企画した。",
    "reading": "よさんがすくないなりに、くふうしてすばらしいいべんとをきかくした。",
    "english": "Working within a small budget, they devised and planned a wonderful event.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "私なりに考えてみましたが、これが最善の方法だと思います。",
    "expected": "私なりに考えてみましたが、これが最善の方法だと思います。",
    "reading": "わたしなりにかんがえてみましたが、これがさいぜんのほうほうだとおもいます。",
    "english": "I've thought about it in my own way, and I believe this is the best method.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "初心者なりに頑張って描いた絵ですが、見ていただけますか。",
    "expected": "初心者なりに頑張って描いた絵ですが、見ていただけますか。",
    "reading": "しょしんしゃなりにがんばってかいたえですが、みていただけますか。",
    "english": "This is a picture I drew trying my best as a beginner, would you mind taking a look?",
    "grammar": "〜なりに"
  },
  {
    "spoken": "彼は彼なりに、今回の失敗から多くのことを学んだようだ。",
    "expected": "彼は彼なりに、今回の失敗から多くのことを学んだようだ。",
    "reading": "かれはかれなりに、こんかいのしっぱいからおおくのことをまなんだようだ。",
    "english": "It seems he learned a lot from this failure, in his own way.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "小さな会社なりに、独自の技術で大手企業と競争している。",
    "expected": "小さな会社なりに、独自の技術で大手企業と競争している。",
    "reading": "ちいさなかいしゃなりに、どくじのぎじゅつでおおてきぎょうときょうそうしている。",
    "english": "As a small company, it competes with large corporations using its unique technology.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "若者には若者なりの悩みや考えがあるものだ。",
    "expected": "若者には若者なりの悩みや考えがあるものだ。",
    "reading": "わかものにはわかものなりのなやみやかんがえがあるものだ。",
    "english": "Young people have their own worries and thoughts, appropriate to their age.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "それぞれが自分なりに目標を設定し、努力することが大切だ。",
    "expected": "それぞれが自分なりに目標を設定し、努力することが大切だ。",
    "reading": "それぞれがじぶんなりにもくひょうをせっていし、どりょくすることがたいせつだ。",
    "english": "It's important for each person to set goals in their own way and strive towards them.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "古い家なりに、味があって落ち着く空間になっている。",
    "expected": "古い家なりに、味があって落ち着く空間になっている。",
    "reading": "ふるいいえなりに、あじがあっておりつくくうかんになっている。",
    "english": "Though it's an old house, it has its own charm and has become a relaxing space.",
    "grammar": "〜なりに"
  },
  {
    "spoken": "勤勉な兄にひきかえ、弟は怠け者で困る。",
    "expected": "勤勉な兄にひきかえ、弟は怠け者で困る。",
    "reading": "きんべんなあににひきかえ、おとうとはなまけものでこまる。",
    "english": "In contrast to his diligent older brother, the younger brother is lazy, which is problematic.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "去年の不作にひきかえ、今年は豊作が期待されている。",
    "expected": "去年の不作にひきかえ、今年は豊作が期待されている。",
    "reading": "きょねんのふさくにひきかえ、ことしはほうさくがきたいされている。",
    "english": "In contrast to last year's poor harvest, a bountiful harvest is expected this year.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "活気あふれる都心にひきかえ、郊外は静寂に包まれていた。",
    "expected": "活気あふれる都心にひきかえ、郊外は静寂に包まれていた。",
    "reading": "かっきあふれるとしんにひきかえ、こうがいはせいじゃくにつつまれていた。",
    "english": "In contrast to the vibrant city center, the suburbs were enveloped in silence.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "子供が無邪気に遊んでいるのにひきかえ、親の心労は絶えない。",
    "expected": "子供が無邪気に遊んでいるのにひきかえ、親の心労は絶えない。",
    "reading": "こどもがむじゃきにあそんでいるのにひきかえ、おやのしんろうはたえない。",
    "english": "In contrast to the children playing innocently, the parents' worries never cease.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "周囲がパニックに陥ったのにひきかえ、彼は冷静沈着に対応した。",
    "expected": "周囲がパニックに陥ったのにひきかえ、彼は冷静沈着に対応した。",
    "reading": "しゅういがぱにっくにおちいったのにひきかえ、かれはれいせいちんちゃくにたいおうした。",
    "english": "In contrast to the surrounding people falling into panic, he responded calmly and collectedly.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "A社の急成長にひきかえ、B社の業績は低迷を続けている。",
    "expected": "A社の急成長にひきかえ、B社の業績は低迷を続けている。",
    "reading": "えーしゃのきゅうせいちょうにひきかえ、びーしゃのぎょうせきはていめいをつづけている。",
    "english": "In contrast to Company A's rapid growth, Company B's business performance continues to stagnate.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "昨日の快晴にひきかえ、今日は朝から雨模様だ。",
    "expected": "昨日の快晴にひきかえ、今日は朝から雨模様だ。",
    "reading": "きのうのかいせいにひきかえ、きょうはあさからあめもようだ。",
    "english": "In contrast to the clear skies yesterday, it's been rainy since this morning.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "同僚の田中さんの几帳面さにひきかえ、山田さんは何かと大雑把だ。",
    "expected": "同僚の田中さんの几帳面さにひきかえ、山田さんは何かと大雑把だ。",
    "reading": "どうりょうのたなかさんのきちょうめんさにひきかえ、やまださんはなにかとおおざっぱだ。",
    "english": "In contrast to colleague Tanaka's meticulousness, Yamada is rather sloppy about things.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "伝統的な意匠の簡素さにひきかえ、現代建築は複雑な構造を持つものが多い。",
    "expected": "伝統的な意匠の簡素さにひきかえ、現代建築は複雑な構造を持つものが多い。",
    "reading": "でんとうてきないしょうのかんそさにひきかえ、げんだいけんちくはふくざつなこうぞうをもつものがおおい。",
    "english": "In contrast to the simplicity of traditional designs, many modern buildings have complex structures.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "規制前の自由な雰囲気にひきかえ、規制後は手続きが煩雑になった。",
    "expected": "規制前の自由な雰囲気にひきかえ、規制後は手続きが煩雑になった。",
    "reading": "きせいぜんのじゆうなふんいきにひきかえ、きせいごはてつづきがはんざつになった。",
    "english": "In contrast to the free atmosphere before the regulations, procedures became complicated after they were implemented.",
    "grammar": "〜にひきかえ"
  },
  {
    "spoken": "いつにもまして、今日の寒さは身にしみる。",
    "expected": "いつにもまして、今日の寒さは身にしみる。",
    "reading": "いつにもまして、きょうのさむさはみにしみる。",
    "english": "Even more than usual, today's cold really cuts to the bone.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "何にもまして、健康が第一だと痛感している。",
    "expected": "何にもまして、健康が第一だと痛感している。",
    "reading": "なににもまして、けんこうがだいいちだとつうかんしている。",
    "english": "I strongly feel that health is more important than anything else.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "彼女の美しさは想像していたにもまして、見る者を魅了した。",
    "expected": "彼女の美しさは想像していたにもまして、見る者を魅了した。",
    "reading": "かのじょのうつくしさはそうぞうしていたにもまして、みるものをみりょうした。",
    "english": "Her beauty, even more than imagined, captivated onlookers.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "彼は以前にもまして、研究に没頭しているようだ。",
    "expected": "彼は以前にもまして、研究に没頭しているようだ。",
    "reading": "かれはいぜんにもまして、けんきゅうにぼっとうしているようだ。",
    "english": "He seems to be absorbed in his research even more than before.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "経済発展にもまして、環境保護の重要性が叫ばれている。",
    "expected": "経済発展にもまして、環境保護の重要性が叫ばれている。",
    "reading": "けいざいはってんにもまして、かんきょうほごのじゅうようせいがさけばれている。",
    "english": "The importance of environmental protection is being emphasized even more than economic development.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "その歌手にとって、ファンの声援は何にもまして力になるだろう。",
    "expected": "その歌手にとって、ファンの声援は何にもまして力になるだろう。",
    "reading": "そのかしゅにとって、ふぁんのせいえんはなににもましてちからになるだろう。",
    "english": "For that singer, the fans' cheers are likely more encouraging than anything else.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "プロジェクトの難易度は、予想していたにもまして高かった。",
    "expected": "プロジェクトの難易度は、予想していたにもまして高かった。",
    "reading": "ぷろじぇくとのなんいどは、よそうしていたにもましてたかかった。",
    "english": "The difficulty level of the project was even higher than expected.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "今回のプレゼンテーションは、前回にもまして聴衆の反応が良かった。",
    "expected": "今回のプレゼンテーションは、前回にもまして聴衆の反応が良かった。",
    "reading": "こんかいのぷれぜんてーしょんは、ぜんかいにもましてちょうしゅうのはんのうがよかった。",
    "english": "This time, the presentation received an even better audience reaction than the last time.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "別れてからは、共に過ごした日々が以前にもまして愛おしく感じられる。",
    "expected": "別れてからは、共に過ごした日々が以前にもまして愛おしく感じられる。",
    "reading": "わかれてからは、ともにすごしたひびがいぜんにもましていとおしくかんじられる。",
    "english": "Since parting, the days spent together feel even more precious than before.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "その教授の専門知識にもまして、教育に対する情熱には感銘を受けた。",
    "expected": "その教授の専門知識にもまして、教育に対する情熱には感銘を受けた。",
    "reading": "そのきょうじゅのせんもんちしきにもまして、きょういくにたいするじょうねつにはかんめいをうけた。",
    "english": "I was impressed by the professor's passion for education, even more than his expert knowledge.",
    "grammar": "〜にもまして"
  },
  {
    "spoken": "優勝できないまでも、せめて決勝戦には残りたい。",
    "expected": "優勝できないまでも、せめて決勝戦には残りたい。",
    "reading": "ゆうしょうできないまでも、せめてけっしょうせんにはのこりたい。",
    "english": "Even if I can't win the championship, I at least want to make it to the finals.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "彼の複雑な理論を完全に理解できないまでも、要点はおおよそ掴めた。",
    "expected": "彼の複雑な理論を完全に理解できないまでも、要点はおおよそ掴めた。",
    "reading": "かれのふくざつなりろんをかんぜんにりかいできないまでも、ようてんはおおよそつかめた。",
    "english": "Although I can't fully understand his complex theory, I could grasp the main points.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "全ての会議に出席できないまでも、議事録には必ず目を通すようにしている。",
    "expected": "全ての会議に出席できないまでも、議事録には必ず目を通すようにしている。",
    "reading": "すべてのかいぎにしゅっせきできないまでも、ぎじろくにはかならずめをとおすようにしている。",
    "english": "Even if I can't attend every meeting, I make sure to at least read the minutes.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "流暢な日本語を話せないまでも、日常会話程度なら問題なくこなせる。",
    "expected": "流暢な日本語を話せないまでも、日常会話程度なら問題なくこなせる。",
    "reading": "りゅうちょうなにほんごをはなせないまでも、にちじょうかいわていどならもんだいなくこなせる。",
    "english": "Although I can't speak fluent Japanese, I can handle daily conversation without problems.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "新車を買う余裕はないまでも、中古車ならなんとか手が届きそうだ。",
    "expected": "新車を買う余裕はないまでも、中古車ならなんとか手が届きそうだ。",
    "reading": "しんしゃをかうよゆうはないまでも、ちゅうこしゃならなんとかてがとどきそうだ。",
    "english": "Even if I can't afford a new car, it seems I can manage to buy a used one.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "問題を根本的に解決できないまでも、当面の回避策は見つけ出した。",
    "expected": "問題を根本的に解決できないまでも、当面の回避策は見つけ出した。",
    "reading": "もんだいをこんぽんてきにかいけつできないまでも、とうめんのかいひさくはみつけだした。",
    "english": "Although we can't solve the problem fundamentally, we have found a temporary workaround.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "直接お伺いできないまでも、せめて電話でご挨拶させてください。",
    "expected": "直接お伺いできないまでも、せめて電話でご挨拶させてください。",
    "reading": "ちょくせつおうかがいできないまでも、せめてでんわでごあいさつさせてください。",
    "english": "Even if I cannot visit you in person, please allow me to at least greet you over the phone.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "完璧とは言えないまでも、満足のいくレベルには到達できたと思う。",
    "expected": "完璧とは言えないまでも、満足のいくレベルには到達できたと思う。",
    "reading": "かんぺきとはいえないまでも、まんぞくのいくれべるにはとうたつできたとおもう。",
    "english": "Although it can't be called perfect, I think we were able to reach a satisfactory level.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "完全に元通りには修復できないまでも、使用可能な状態には戻せるだろう。",
    "expected": "完全に元通りには修復できないまでも、使用可能な状態には戻せるだろう。",
    "reading": "かんぜんにもとどおりにはしゅうふくできないまでも、しようかのうなじょうたいにはもどせるだろう。",
    "english": "Even if it can't be restored completely to its original state, it can probably be returned to a usable condition.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "要求された予算全額を承認できないまでも、一部については許可が下りた。",
    "expected": "要求された予算全額を承認できないまでも、一部については許可が下りた。",
    "reading": "ようきゅうされたよさんぜんがくをしょうにんできないまでも、いちぶについてはきょかがおりた。",
    "english": "Although the entire requested budget couldn't be approved, permission was granted for a portion of it.",
    "grammar": "〜ないまでも"
  },
  {
    "spoken": "事態がこの段階に至って、ようやく関係者は重い腰を上げた。",
    "expected": "事態がこの段階に至って、ようやく関係者は重い腰を上げた。",
    "reading": "じたいがこのだんかいにいたって、ようやくかんけいしゃはおもいこしをあげた。",
    "english": "Only after the situation reached this stage did the concerned parties finally decide to take action.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "何度も警告したにも関わらず、この事態に至ってしまったのは遺憾だ。",
    "expected": "何度も警告したにも関わらず、この事態に至ってしまったのは遺憾だ。",
    "reading": "なんどもしけいこくしたにもかかわらず、このじたいにいたってしまったのはいかんだ。",
    "english": "It's regrettable that we've reached this situation despite numerous warnings.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "最終段階に至っても、計画の根本的な欠陥は修正されなかった。",
    "expected": "最終段階に至っても、計画の根本的な欠陥は修正されなかった。",
    "reading": "さいしゅうだんかいにいたっても、けいかくのこんぽんてきなけっかんはしゅうせいされなかった。",
    "english": "Even upon reaching the final stage, the fundamental flaws in the plan were not corrected.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "生命の危機に瀕するに至って、彼は初めて自分の生き方を見つめ直した。",
    "expected": "生命の危機に瀕するに至って、彼は初めて自分の生き方を見つめ直した。",
    "reading": "せいめいのききにひんするにいたって、かれははじめてじぶんのいきかたをみつめなおした。",
    "english": "Only when facing a life-threatening crisis did he re-evaluate his way of life for the first time.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "これほど明白な証拠が提示されるに至っても、容疑者は犯行を否認し続けている。",
    "expected": "これほど明白な証拠が提示されるに至っても、容疑者は犯行を否認し続けている。",
    "reading": "これほどめいはくなしょうこがていじされるにいたっても、ようぎしゃははんこうをひにんしつづけている。",
    "english": "Even after such clear evidence has been presented, the suspect continues to deny the crime.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "プロジェクトが失敗に終わるに至って、責任の所在を巡る議論が始まった。",
    "expected": "プロジェクトが失敗に終わるに至って、責任の所在を巡る議論が始まった。",
    "reading": "ぷろじぇくとがしっぱいにおわるにいたって、せきにんのしょざいをめぐるぎろんがはじまった。",
    "english": "Now that the project has ended in failure, discussions have begun concerning where the responsibility lies.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "合意寸前に至っても、双方の主張には埋めがたい隔たりがあった。",
    "expected": "合意寸前に至っても、双方の主張にはうめがたいへだたりがあった。",
    "reading": "ごういすんぜんにいたっても、そうほうのしゅちょうにはうめがたいへだたりがあった。",
    "english": "Even when on the verge of agreement, there was an unbridgeable gap between the assertions of both sides.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "卒業間際に至って、ようやく留学を決意した学生もいる。",
    "expected": "卒業間際に至って、ようやく留学を決意した学生もいる。",
    "reading": "そつぎょうまぎわにいたって、ようやくりゅうがくをけついしたがくせいもいる。",
    "english": "There are also students who finally decided to study abroad only just before graduation.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "問題が公になるに至って、会社は初めて調査委員会を設置した。",
    "expected": "問題が公になるに至って、会社は初めて調査委員会を設置した。",
    "reading": "もんだいがおおやけになるにいたって、かいしゃははじめてちょうさいいんかいをせっちした。",
    "english": "Only after the problem became public did the company establish an investigative committee for the first time.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "ここまで事態が悪化するに至っても、彼は楽観的な態度を崩さなかった。",
    "expected": "ここまで事態が悪化するに至っても、彼は楽観的な態度を崩さなかった。",
    "reading": "ここまでじたいがあっかするにいたっても、かれはらっかんてきなたいどをくずさなかった。",
    "english": "Even when the situation had deteriorated to this extent, he didn't abandon his optimistic attitude.",
    "grammar": "〜に至って・〜に至っても"
  },
  {
    "spoken": "他の社員は遅刻が多いが、部長に至っては週に三回も遅れてくる。",
    "expected": "他の社員は遅刻が多いが、部長に至っては週に三回も遅れてくる。",
    "reading": "ほかのしゃいんはちこくがおおいが、ぶちょうにいたってはしゅうにさんかいもおくれてくる。",
    "english": "Other employees are often late, but when it comes to the department manager, he comes late as often as three times a week.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "兄はスポーツ万能だが、弟に至っては運動神経が全くない。",
    "expected": "兄はスポーツ万能だが、弟に至っては運動神経が全くない。",
    "reading": "あにはすぽーつばんのうだが、おとうとにいたってはうんどうしんけいがまったくない。",
    "english": "My older brother is good at all sports, but as for my younger brother, he has absolutely no athletic ability.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "この地域の治安は悪化しており、隣町に至っては夜間の外出は危険だ。",
    "expected": "この地域の治安は悪化しており、隣町に至っては夜間の外出は危険だ。",
    "reading": "このちいきのちあんはあっかしており、となりまちにいたってはやかんのがいしゅつはきけんだ。",
    "english": "Public safety in this area is worsening, and when it comes to the neighboring town, going out at night is dangerous.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "最近の若者の言葉遣いには驚かされるが、彼に至っては敬語すら使えない。",
    "expected": "最近の若者の言葉遣いには驚かされるが、彼に至っては敬語すら使えない。",
    "reading": "さいきんのわかもののことばづかいにはおどろかされるが、かれにいたってはけいごすらつかえない。",
    "english": "I'm surprised by the language use of young people recently, but when it comes to him, he can't even use honorific language.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "どの科目も苦手だが、数学に至っては赤点ばかりだ。",
    "expected": "どの科目も苦手だが、数学に至っては赤点ばかりだ。",
    "reading": "どのかもくもにがてだが、すうがくにいたってはあかてんばかりだ。",
    "english": "I'm bad at every subject, but when it comes to math, I only get failing grades.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "都市部では交通渋滞が深刻だが、首都高速道路に至っては慢性的に麻痺状態だ。",
    "expected": "都市部では交通渋滞が深刻だが、首都高速道路に至っては慢性的に麻痺状態だ。",
    "reading": "としぶではこうつうじゅうたいがしんこくだが、しゅとこうそくどうろにいたってはまんせいてきにまひじょうたいだ。",
    "english": "Traffic congestion is serious in urban areas, but the Metropolitan Expressway, in particular, is chronically paralyzed.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "一般的な食品の値上げも厳しいが、輸入果物に至っては庶民には手が出せない価格だ。",
    "expected": "一般的な食品の値上げも厳しいが、輸入果物に至っては庶民には手が出せない価格だ。",
    "reading": "いっぱんてきなしょくひんのねあげもきびしいが、ゆにゅうくだものにいたってはしょみんにはてがだせないかかくだ。",
    "english": "Price increases for general food items are tough, but when it comes to imported fruits, the prices are unaffordable for ordinary people.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "彼は普段から無口だが、会議の場に至っては一言も発しない。",
    "expected": "彼は普段から無口だが、会議の場に至っては一言も発しない。",
    "reading": "かれはふだんからむくちだが、かいぎのばにいたってはひとこともはっしない。",
    "english": "He is usually quiet, but when it comes to meetings, he doesn't utter a single word.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "多くの企業が業績不振に苦しんでいるが、A社に至っては倒産の危機に瀕している。",
    "expected": "多くの企業が業績不振に苦しんでいるが、A社に至っては倒産の危機に瀕している。",
    "reading": "おおくのきぎょうがぎょうせきふしんにくるしんでいるが、えーしゃにいたってはとうさんのききにひんしている。",
    "english": "Many companies are suffering from poor business performance, but Company A, in particular, is on the brink of bankruptcy.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "環境問題は多岐にわたるが、海洋プラスチック汚染に至っては、生態系への影響が深刻化している。",
    "expected": "環境問題は多岐にわたるが、海洋プラスチック汚染に至っては、生態系への影響が深刻化している。",
    "reading": "かんきょうもんだいはたきにわたるが、かいようぷらすちっくおせんにいたっては、せいたいけいへのえいきょうがしんこくかしている。",
    "english": "Environmental problems are diverse, but when it comes to marine plastic pollution, the impact on the ecosystem is becoming severe.",
    "grammar": "〜に至っては"
  },
  {
    "spoken": "彼は若い頃から怠惰な生活を送り、とうとう定職にも就けず、親に頼る始末だ。",
    "expected": "彼は若い頃から怠惰な生活を送り、とうとう定職にも就けず、親に頼る始末だ。",
    "reading": "かれはわかいころからたいだなせいかつをおくり、とうとうていしょくにもつけず、おやにたよるしまつだ。",
    "english": "He led an idle life from a young age, and ended up unable to find a steady job, relying on his parents.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "度重なる不注意が原因で、彼は大きな契約を失う始末だ。",
    "expected": "度重なる不注意が原因で、彼は大きな契約を失う始末だ。",
    "reading": "たびかさなるふちゅういがげんいんで、かれはおおきなけいやくをうしなうしまつだ。",
    "english": "Due to repeated carelessness, he ended up losing a major contract.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "子供たちは喧嘩ばかりして、家中を散らかし放題にした挙句、おもちゃを壊す始末だ。",
    "expected": "子供たちは喧嘩ばかりして、家中を散らかし放題にした挙句、おもちゃを壊す始末だ。",
    "reading": "こどもたちはけんかばかりして、いえじゅうをちらかしほうだいにしたあげく、おもちゃをこわすしまつだ。",
    "english": "The children were constantly fighting, made a mess of the whole house, and ultimately ended up breaking their toys.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "彼はギャンブルにのめり込み、貯金を使い果たし、借金まで作る始末だ。",
    "expected": "彼はギャンブルにのめり込み、貯金を使い果たし、借金まで作る始末だ。",
    "reading": "かれはぎゃんぶるにのめりこみ、ちょきんをつかいはたし、しゃっきんまでつくるしまつだ。",
    "english": "He got hooked on gambling, used up all his savings, and even ended up in debt.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "経営陣の判断ミスが続き、会社は赤字経営から抜け出せず、リストラを断行する始末だ。",
    "expected": "経営陣の判断ミスが続き、会社は赤字経営から抜け出せず、リストラを断行する始末だ。",
    "reading": "けいえいじんのはんだんみすがつづき、かいしゃはあかじけいえいからぬけだせず、りすとらをだんこうするしまつだ。",
    "english": "Due to continued misjudgments by management, the company couldn't escape its deficit operation and ended up implementing restructuring.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "彼は口先ばかりで行動が伴わず、結局何も達成できない始末だった。",
    "expected": "彼は口先ばかりで行動が伴わず、結局何も達成できない始末だった。",
    "reading": "かれはくちさきばかりでこうどうがともなわず、けっきょくなにもたっせいできないしまつだった。",
    "english": "He was all talk and no action, and in the end, he accomplished nothing.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "練習を怠けたせいで、大事な試合で簡単なミスを連発する始末だ。",
    "expected": "練習を怠けたせいで、大事な試合で簡単なミスを連発する始末だ。",
    "reading": "れんしゅうをなまけたせいで、だいじなしあいでかんたんなみすをれんぱつするしまつだ。",
    "english": "Because he neglected practice, he ended up making simple mistakes repeatedly in the important match.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "彼は友人の忠告を聞き入れず、怪しい投資話に乗って大損する始末だ。",
    "expected": "彼は友人の忠告を聞き入れず、怪しい投資話に乗って大損する始末だ。",
    "reading": "かれはゆうじんのちゅうこくをききいれず、あやしいとうしばなしにのっておおぞんするしまつだ。",
    "english": "He didn't listen to his friend's advice and ended up losing a lot of money by getting involved in a shady investment deal.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "あの政治家はスキャンダルが発覚した後も言い訳を繰り返し、国民の信頼を完全に失う始末だ。",
    "expected": "あの政治家はスキャンダルが発覚した後も言い訳を繰り返し、国民の信頼を完全に失う始末だ。",
    "reading": "あのせいじかはすきゃんだるがはっかくしたあともいいわけをくりかえし、こくみんのしんらいをかんぜんにうしなうしまつだ。",
    "english": "That politician kept making excuses after the scandal broke and ended up completely losing the public's trust.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "彼は仕事のストレスから酒に溺れ、体を壊して入院する始末だった。",
    "expected": "彼は仕事のストレスから酒に溺れ、体を壊して入院する始末だった。",
    "reading": "かれはしごとのすとれすからさけにおぼれ、からだをこわしてにゅういんするしまつだった。",
    "english": "He drowned his work stress in alcohol, ruined his health, and ended up being hospitalized.",
    "grammar": "〜始末だ"
  },
  {
    "spoken": "昨夜は疲れていたので、電気もテレビもつけっぱなしで寝てしまった。",
    "expected": "昨夜は疲れていたので、電気もテレビもつけっぱなしで寝てしまった。",
    "reading": "ゆうべはつかれていたので、でんきもてれびもつけっぱなしでねてしまった。",
    "english": "I was tired last night, so I fell asleep leaving the lights and TV on.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "弟はいつもおもちゃを部屋に散らかしっぱなしにするので、母が怒っている。",
    "expected": "弟はいつもおもちゃを部屋に散らかしっぱなしにするので、母が怒っている。",
    "reading": "おとうとはいつもおもちゃをへやにちらかしっぱなしにするので、ははがおこっている。",
    "english": "My younger brother always leaves his toys scattered around the room, so my mother gets angry.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "会議中、彼は自分の意見を主張しっぱなしで、他の人の話を聞こうとしなかった。",
    "expected": "会議中、彼は自分の意見を主張しっぱなしで、他の人の話を聞こうとしなかった。",
    "reading": "かいぎちゅう、かれはじぶんのいけんをしゅちょうしっぱなしで、ほかのひとのはなしをきこうとしなかった。",
    "english": "During the meeting, he just kept asserting his own opinions and didn't try to listen to others.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "この雨では洗濯物も干しっぱなしにできない。",
    "expected": "この雨では洗濯物も干しっぱなしにできない。",
    "reading": "このあめではせんたくものもほしっぱなしにできない。",
    "english": "With this rain, I can't just leave the laundry hanging out to dry.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "エンジンをかけっぱなしで車から離れないでください。",
    "expected": "エンジンをかけっぱなしで車から離れないでください。",
    "reading": "えんじんをかけっぱなしでくるまからはなれないでください。",
    "english": "Please don't leave the car with the engine running.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "彼は一日中パソコンの前に座りっぱなしで、運動不足が心配だ。",
    "expected": "彼は一日中パソコンの前に座りっぱなしで、運動不足が心配だ。",
    "reading": "かれはいちにちじゅうぱそこんのまえにすわりっぱなしで、うんどうぶそくがしんぱいだ。",
    "english": "He sits in front of the computer all day long, and I'm worried about his lack of exercise.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "エアコンをつけっぱなしで外出してしまい、電気代が無駄になった。",
    "expected": "エアコンをつけっぱなしで外出してしまい、電気代が無駄になった。",
    "reading": "えあこんをつけっぱなしでがいしゅつしてしまい、でんきだいがむだになった。",
    "english": "I went out leaving the air conditioner on, wasting electricity.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "蛇口を閉め忘れて水が出しっぱなしになっていた。",
    "expected": "蛇口を閉め忘れて水が出しっぱなしになっていた。",
    "reading": "じゃぐちをしめわすれてみずがだしっぱなしになっていた。",
    "english": "I forgot to turn off the faucet, and the water was left running.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "彼は借りた本を読みっぱなしで、まだ返してくれない。",
    "expected": "彼は借りた本を読みっぱなしで、まだ返してくれない。",
    "reading": "かれはかりたほんをよみっぱなしで、まだかえしてくれない。",
    "english": "He just left the book he borrowed after reading it and hasn't returned it yet.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "彼女は約束の時間に遅れてきたのに、謝りもせず、立ちっぱなしで私を待たせた。",
    "expected": "彼女は約束の時間に遅れてきたのに、謝りもせず、立ちっぱなしで私を待たせた。",
    "reading": "かのじょはやくそくのじかんにおくれてきたのに、あやまりもせず、たちっぱなしでわたしをまたせた。",
    "english": "She was late for our appointment, didn't apologize, and just kept me standing and waiting.",
    "grammar": "〜っぱなしだ"
  },
  {
    "spoken": "試験中は一瞬たりとも気を抜いてはいけない。",
    "expected": "試験中は一瞬たりとも気を抜いてはいけない。",
    "reading": "しけんちゅうはいっしゅんたりともきをぬいてはいけない。",
    "english": "During the exam, you must not lose focus even for a moment.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "彼は人から借りたお金は一円たりとも無駄遣いしなかった。",
    "expected": "彼は人から借りたお金は一円たりとも無駄遣いしなかった。",
    "reading": "かれはひとからかりたおかねはいちえんたりともむだづかいしなかった。",
    "english": "He didn't waste even a single yen of the money he borrowed from others.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "この機密情報は一文字たりとも外部に漏らしてはならない。",
    "expected": "この機密情報は一文字たりとも外部に漏らしてはならない。",
    "reading": "このきみつじょうほうはいちもんじたりともがいぶにもらしてはならない。",
    "english": "Not even a single character of this confidential information must be leaked outside.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "規則ですから、何人たりともこの線から中に入ることは許されません。",
    "expected": "規則ですから、何人たりともこの線から中に入ることは許されません。",
    "reading": "きそくですから、なんびとたりともこのせんからなかにはいることはゆるされません。",
    "english": "Because it's the rule, absolutely no one is permitted to enter past this line.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "ゴールキーパーは一瞬たりともボールから目を離さなかった。",
    "expected": "ゴールキーパーは一瞬たりともボールから目を離さなかった。",
    "reading": "ごーるきーぱーはいっしゅんたりともぼーるからめをはなさなかった。",
    "english": "The goalkeeper didn't take his eyes off the ball for even an instant.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "彼の研究は、些細なデータ一点たりとも見逃すことなく進められた。",
    "expected": "彼の研究は、些細なデータ一点たりとも見逃すことなく進められた。",
    "reading": "かれのけんきゅうは、ささいなでーた いってんたりともみのがすことなくすすめられた。",
    "english": "His research proceeded without overlooking even a single trivial piece of data.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "将軍は、一兵たりとも無駄死にさせるわけにはいかないと決意した。",
    "expected": "将軍は、一兵たりとも無駄死にさせるわけにはいかないと決意した。",
    "reading": "しょうぐんは、いっぺいたりともむだじにさせるわけにはいかないとけついした。",
    "english": "The general was determined not to let even a single soldier die in vain.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "災害時、配給された食料は一粒たりとも無駄にできなかった。",
    "expected": "災害時、配給された食料は一粒たりとも無駄にできなかった。",
    "reading": "さいがいじ、はいきゅうされたしょくりょうはひとつぶたりともむだにできなかった。",
    "english": "During the disaster, we couldn't waste even a single grain of the rationed food.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "締め切りが迫っているので、一日たりとも作業を休むことはできない。",
    "expected": "締め切りが迫っているので、一日たりとも作業を休むことはできない。",
    "reading": "しめきりがせまっているので、いちにちたりともさぎょうをやすむことはできない。",
    "english": "Since the deadline is approaching, I can't take even a single day off from work.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "恩師の最後の言葉は一句たりとも忘れることができない。",
    "expected": "恩師の最後の言葉は一句たりとも忘れることができない。",
    "reading": "おんしのさいごのことばはいっくたりともわすれることができない。",
    "english": "I cannot forget even a single phrase of my respected teacher's final words.",
    "grammar": "〜たりとも…ない"
  },
  {
    "spoken": "この漢字は難しくて、日本人ですら読めないことがある。",
    "expected": "この漢字は難しくて、日本人ですら読めないことがある。",
    "reading": "このかんじはむずかしくて、にほんじんですらよめないことがある。",
    "english": "This kanji is so difficult that sometimes even Japanese people cannot read it.",
    "grammar": "〜すら"
  },
  {
    "spoken": "彼は自分の名前すら書けないほど、教育を受けていなかった。",
    "expected": "彼は自分の名前すら書けないほど、教育を受けていなかった。",
    "reading": "かれはじぶんのなまえすらかけないほど、きょういくをうけていなかった。",
    "english": "He was so uneducated that he couldn't even write his own name.",
    "grammar": "〜すら"
  },
  {
    "spoken": "この新しいソフトウェアは非常に直感的で、初心者ですら簡単に操作できる。",
    "expected": "この新しいソフトウェアは非常に直感的で、初心者ですら簡単に操作できる。",
    "reading": "このあたらしいそふとうぇあはひじょうにちょっかんてきで、しょしんしゃですらかんたんにそうさできる。",
    "english": "This new software is so intuitive that even beginners can operate it easily.",
    "grammar": "〜すら"
  },
  {
    "spoken": "あまりの痛みに、声を出すことすらかなわなかった。",
    "expected": "あまりの痛みに、声を出すことすらかなわなかった。",
    "reading": "あまりのいたみに、こえをだすことすらかなわなかった。",
    "english": "The pain was so intense that I couldn't even make a sound.",
    "grammar": "〜すら"
  },
  {
    "spoken": "長年の親友ですら、彼を裏切ることになるとは思わなかった。",
    "expected": "長年の親友ですら、彼を裏切ることになるとは思わなかった。",
    "reading": "ながねんのしんゆうですら、かれをうらぎることになるとはおもわなかった。",
    "english": "I never thought that even his long-time best friend would betray him.",
    "grammar": "〜すら"
  },
  {
    "spoken": "不況の影響で、大企業ですら経営が困難になっている。",
    "expected": "不況の影響で、大企業ですら経営が困難になっている。",
    "reading": "ふきょうのえいきょうで、だいきぎょうですらけいえいがこんなんになっている。",
    "english": "Due to the recession's impact, even large corporations are facing management difficulties.",
    "grammar": "〜すら"
  },
  {
    "spoken": "この理論は専門家ですら理解するのが難しいと言われている。",
    "expected": "この理論は専門家ですら理解するのが難しいと言われている。",
    "reading": "このりろんはせんもんかですらりかいするのがむずかしいといわれている。",
    "english": "It is said that this theory is difficult to understand, even for experts.",
    "grammar": "〜すら"
  },
  {
    "spoken": "彼は疲れて、ベッドから起き上がることすら億劫だった。",
    "expected": "彼は疲れて、ベッドから起き上がることすら億劫だった。",
    "reading": "かれはつかれて、べっどからおきあがることすらおっくうだった。",
    "english": "He was so tired that even getting out of bed felt like a chore.",
    "grammar": "〜すら"
  },
  {
    "spoken": "まさか砂漠で洪水が起きるなんて、想像すらしていなかった。",
    "expected": "まさか砂漠で洪水が起きるなんて、想像すらしていなかった。",
    "reading": "まさかさばくでこうずいがおきるなんて、そうぞうすらしていなかった。",
    "english": "I hadn't even imagined that a flood could occur in the desert.",
    "grammar": "〜すら"
  },
  {
    "spoken": "昔は考えられなかったことだが、今では小学生ですらスマートフォンを持っている。",
    "expected": "昔は考えられなかったことだが、今では小学生ですらスマートフォンを持っている。",
    "reading": "むかしはかんがえられなかったことだが、いまではしょうがくせいですらすまーとふぉんをもっている。",
    "english": "It was unthinkable in the past, but nowadays even elementary school students have smartphones.",
    "grammar": "〜すら"
  },
  {
    "spoken": "あの恐ろしい事故のことは、思い出すだに身震いする。",
    "expected": "あの恐ろしい事故のことは、思い出すだに身震いする。",
    "reading": "あのおそろしいじこのことは、おもいだすだにみぶるいする。",
    "english": "Just recalling that terrible accident makes me shudder.",
    "grammar": "〜だに"
  },
  {
    "spoken": "戦争中の悲惨な体験は、聞くだに涙を誘う。",
    "expected": "戦争中の悲惨な体験は、聞くだに涙を誘う。",
    "reading": "せんそうちゅうのひさんなたいけんは、きくだになみだをさそう。",
    "english": "Hearing about the tragic experiences during the war brings tears to one's eyes.",
    "grammar": "〜だに"
  },
  {
    "spoken": "一寸先は闇とは言うが、自分の将来は想像するだに恐ろしい。",
    "expected": "一寸先は闇とは言うが、自分の将来は想像するだに恐ろしい。",
    "reading": "いっすんさきはやみとはいうが、じぶんのしょうらいはそうぞうするだにおそろしい。",
    "english": "They say the future is uncertain, and just imagining my own future is frightening.",
    "grammar": "〜だに"
  },
  {
    "spoken": "親友が突然亡くなったという知らせは、聞くだに信じがたいものだった。",
    "expected": "親友が突然亡くなったという知らせは、聞くだに信じがたいものだった。",
    "reading": "しんゆうがとつぜんなくなったというしらせは、きくだにしんじがたいものだった。",
    "english": "The news that my best friend had suddenly passed away was hard to believe even just hearing it.",
    "grammar": "〜だに"
  },
  {
    "spoken": "まさか自分が社長になれるなんて、夢にだに思わなかった。",
    "expected": "まさか自分が社長になれるなんて、夢にだに思わなかった。",
    "reading": "まさかじぶんがしゃちょうになれるなんて、ゆめにだにおもわなかった。",
    "english": "I never even dreamed that I could become the company president.",
    "grammar": "〜だに"
  },
  {
    "spoken": "もし合格できたらと、考えるだに嬉しい気持ちになる。",
    "expected": "もし合格できたらと、考えるだに嬉しい気持ちになる。",
    "reading": "もしごうかくできたらと、かんがえるだにうれしいきもちになる。",
    "english": "Just thinking about the possibility of passing makes me feel happy.",
    "grammar": "〜だに"
  },
  {
    "spoken": "その城で起こったとされる悲劇は、語るだに残酷すぎる。",
    "expected": "その城で起こったとされる悲劇は、語るだに残酷すぎる。",
    "reading": "そのしろでおこったとされるひげきは、かたるだにざんこくすぎる。",
    "english": "The tragedy said to have occurred in that castle is too cruel even to speak of.",
    "grammar": "〜だに"
  },
  {
    "spoken": "大自然の脅威を目の当たりにすると、想像するだにしなかった恐怖を感じる。",
    "expected": "大自然の脅威を目の当たりにすると、想像するだにしなかった恐怖を感じる。",
    "reading": "だいしぜんのきょういをまのあたりにすると、そうぞうするだにしなかったきょうふをかんじる。",
    "english": "Witnessing the threat of mother nature firsthand invokes a fear I hadn't even imagined.",
    "grammar": "〜だに"
  },
  {
    "spoken": "彼がそんな嘘をつくとは、微塵だに考えなかった。",
    "expected": "彼がそんな嘘をつくとは、微塵だに考えなかった。",
    "reading": "かれがそんなうそをつくとは、みじんだにかんがえなかった。",
    "english": "I didn't think for a moment (not even a speck) that he would tell such a lie.",
    "grammar": "〜だに"
  },
  {
    "spoken": "来週の旅行のことを思うだに、心が躍る。",
    "expected": "来週の旅行のことを思うだに、心が躍る。",
    "reading": "らいしゅうのりょこうのことをおもうだに、こころがおどる。",
    "english": "Just thinking about next week's trip makes my heart leap with joy.",
    "grammar": "〜だに"
  },
  {
    "spoken": "この難易度の高い手術は、彼のような熟練した外科医にして初めて成功した。",
    "expected": "この難易度の高い手術は、彼のような熟練した外科医にして初めて成功した。",
    "reading": "このなんいどのたかいしゅじゅつは、かれのようなじゅくれんしたげかいにしてはじめてせいこうした。",
    "english": "This highly difficult surgery succeeded for the first time only because it was performed by a skilled surgeon like him.",
    "grammar": "〜にして"
  },
  {
    "spoken": "彼女は弱冠２０歳にして、国際的なコンクールで優勝した。",
    "expected": "彼女は弱冠２０歳にして、国際的なコンクールで優勝した。",
    "reading": "かのじょはじゃっかんにじゅっさいにして、こくさいてきなこんくーるでゆうしょうした。",
    "english": "At the young age of only 20, she won an international competition.",
    "grammar": "〜にして"
  },
  {
    "spoken": "事態は一瞬にして悪化した。",
    "expected": "事態は一瞬にして悪化した。",
    "reading": "じたいはいっしゅんにしてあっかした。",
    "english": "The situation worsened in an instant.",
    "grammar": "〜にして"
  },
  {
    "spoken": "あんなに努力した彼にして、試験に落ちるとは意外だった。",
    "expected": "あんなに努力した彼にして、試験に落ちるとは意外だった。",
    "reading": "あんなにどりょくしたかれにして、しけんにおちるとはいがいだった。",
    "english": "It was surprising that even he, who had tried so hard, failed the exam.",
    "grammar": "〜にして"
  },
  {
    "spoken": "社長という立場にして、無責任な発言は許されない。",
    "expected": "社長という立場にして、無責任な発言は許されない。",
    "reading": "しゃちょうというたちばにして、むせきにんなはつげんはゆるされない。",
    "english": "Especially given the position of company president, irresponsible remarks are unacceptable.",
    "grammar": "〜にして"
  },
  {
    "spoken": "長年の経験を持つベテランの彼にして、この問題の解決は容易ではなかった。",
    "expected": "長年の経験を持つベテランの彼にして、この問題の解決は容易ではなかった。",
    "reading": "ながねんのけいけんをもつべてらんのかれにして、このもんだいのかいけつはよういではなかった。",
    "english": "Even for him, a veteran with many years of experience, solving this problem was not easy.",
    "grammar": "〜にして"
  },
  {
    "spoken": "この品質にしてこの価格は、非常にお買い得だ。",
    "expected": "この品質にしてこの価格は、非常にお買い得だ。",
    "reading": "このひんしつにしてこのかかくは、ひじょうにおかいどくだ。",
    "english": "For this quality, this price is an extremely good bargain.",
    "grammar": "〜にして"
  },
  {
    "spoken": "この繊細な表現は、巨匠にして初めて可能な技だ。",
    "expected": "この繊細な表現は、巨匠にして初めて可能な技だ。",
    "reading": "このせんさいなひょうげんは、きょしょうにしてはじめてかのうなわざだ。",
    "english": "This delicate expression is a technique possible only for a great master.",
    "grammar": "〜にして"
  },
  {
    "spoken": "この状況にして、冷静さを保つのは難しい。",
    "expected": "この状況にして、冷静さを保つのは難しい。",
    "reading": "このじょうきょうにして、れいせいさをたもつのはむずかしい。",
    "english": "In this situation, it is difficult to maintain composure.",
    "grammar": "〜にして"
  },
  {
    "spoken": "デザインと機能性、この二つを高いレベルで両立させているのは、この製品にして初めてだ。",
    "expected": "デザインと機能性、この二つを高いレベルで両立させているのは、この製品にして初めてだ。",
    "reading": "でざいんときのうせい、このふたつをたかいれべるでりょうりつさせているのは、このせいひんにしてはじめてだ。",
    "english": "This product is the first to achieve both design and functionality at such a high level.",
    "grammar": "〜にして"
  },
  {
    "spoken": "家族の支えあっての私の成功です。",
    "expected": "家族の支えあっての私の成功です。",
    "reading": "かぞくのささえあってのわたしのせいこうです。",
    "english": "My success exists only thanks to the support of my family.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "お客様あっての商売ですから、感謝の気持ちを忘れてはいけません。",
    "expected": "お客様あっての商売ですから、感謝の気持ちを忘れてはいけません。",
    "reading": "おきゃくさまあってのしょうばいですから、かんしゃのきもちをわすれてはいけません。",
    "english": "Business exists only because of our customers, so we must not forget our gratitude.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "健康あっての人生だ。体が資本ということを忘れないようにしよう。",
    "expected": "健康あっての人生だ。体が資本ということを忘れないようにしよう。",
    "reading": "けんこうあってのじんせいだ。からだがしほんということをわすれないようにしよう。",
    "english": "Life is only possible with health. Let's not forget that our body is our capital.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "チーム全員の協力あってのプロジェクト完遂だった。",
    "expected": "チーム全員の協力あってのプロジェクト完遂だった。",
    "reading": "ちーむぜんいんのきょうりょくあってのぷろじぇくとかんすいだった。",
    "english": "The project completion was only possible thanks to the cooperation of the entire team.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "ファンの皆様あっての私達です。いつも応援ありがとうございます。",
    "expected": "ファンの皆様あっての私達です。いつも応援ありがとうございます。",
    "reading": "ふぁんのみなさまあってのわたしたちです。いつもおうえんありがとうございます。",
    "english": "We exist only because of you, our fans. Thank you always for your support.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "豊かな土壌あっての美味しい野菜作りが可能になる。",
    "expected": "豊かな土壌あっての美味しい野菜作りが可能になる。",
    "reading": "ゆたかなどじょうあってのおいしいやさいづくりがかのうになる。",
    "english": "Growing delicious vegetables is possible only thanks to fertile soil.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "信頼あっての人間関係だ。一度失うと取り戻すのは難しい。",
    "expected": "信頼あっての人間関係だ。一度失うと取り戻すのは難しい。",
    "reading": "しんらいあってのにんげんかんけいだ。いちどうしなうとりもどすのはむずかしい。",
    "english": "Human relationships exist based on trust. Once lost, it's difficult to regain.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "平和あっての国民の安定した生活が保障される。",
    "expected": "平和あっての国民の安定した生活が保障される。",
    "reading": "へいわあってのこくみんのあんていしたせいかつがほしょうされる。",
    "english": "The stable lives of the citizens are guaranteed only because there is peace.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "日々の地道な努力あっての今日の成果だ。",
    "expected": "日々の地道な努力あっての今日の成果だ。",
    "reading": "ひびのじみちなどりょくあってのきょうのせいかだ。",
    "english": "Today's results are thanks to steady, daily effort.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "読者あっての文学作品であり、その解釈は読者に委ねられる部分も大きい。",
    "expected": "読者あっての文学作品であり、その解釈は読者に委ねられる部分も大きい。",
    "reading": "どくしゃあってのぶんがくさくひんであり、そのかいしゃくはどくしゃにゆだねられるぶぶんもおおきい。",
    "english": "Literary works exist because of readers, and a large part of their interpretation is left up to them.",
    "grammar": "〜あっての"
  },
  {
    "spoken": "この金庫は１００キロからあるので、一人ではとても運べない。",
    "expected": "この金庫は１００キロからあるので、一人ではとても運べない。",
    "reading": "このきんこはひゃっきろからあるので、ひとりではとてもはこべない。",
    "english": "This safe weighs 100 kilograms or more, so one person definitely cannot move it.",
    "grammar": "〜からある"
  },
  {
    "spoken": "彼女が身につけている宝石は、一つで数百万円からするらしい。",
    "expected": "彼女が身につけている宝石は、一つで数百万円からするらしい。",
    "reading": "かのじょがみにつけているほうせきは、ひとつで すうひゃくまんえんからするらしい。",
    "english": "Apparently, the jewels she wears cost several million yen or more each.",
    "grammar": "〜からする"
  },
  {
    "spoken": "そのデモには、一万人からの市民が参加したと報道されている。",
    "expected": "そのデモには、一万人からの市民が参加したと報道されている。",
    "reading": "そのでもには、いちまんにんからのしみんがさんかしたとほうどうされている。",
    "english": "It is reported that ten thousand or more citizens participated in that demonstration.",
    "grammar": "〜からの"
  },
  {
    "spoken": "彼が住んでいる家は、駅から２キロからある丘の上にある。",
    "expected": "彼が住んでいる家は、駅から２キロからある丘の上にある。",
    "reading": "かれがすんでいるいえは、えきからにきろからあるおかのうえにある。",
    "english": "The house he lives in is on a hill two kilometers or more from the station.",
    "grammar": "〜からある"
  },
  {
    "spoken": "新しいシステム開発には、５億円からする費用が見込まれている。",
    "expected": "新しいシステム開発には、５億円からする費用が見込まれている。",
    "reading": "あたらしいしすてむかいはつには、ごおくえんからするひようがみこまれている。",
    "english": "A cost of 500 million yen or more is estimated for the new system development.",
    "grammar": "〜からする"
  },
  {
    "spoken": "あの人気歌手のコンサートには、毎回５万人からの観客が集まる。",
    "expected": "あの人気歌手のコンサートには、毎回５万人からの観客が集まる。",
    "reading": "あの にんきかしゅのこんさーとには、まいかいごまんにんからのかんきゃくがあつまる。",
    "english": "That popular singer's concerts draw audiences of 50,000 people or more every time.",
    "grammar": "〜からの"
  },
  {
    "spoken": "建設中の超高層ビルは、完成すれば３００メートルからある高さになるそうだ。",
    "expected": "建設中の超高層ビルは、完成すれば３００メートルからある高さになるそうだ。",
    "reading": "けんせつちゅうのちょうこうそうびるは、かんせいすればさんびゃくめーとるからあるたかさになるそうだ。",
    "english": "They say the skyscraper under construction will be 300 meters or more tall when completed.",
    "grammar": "〜からある"
  },
  {
    "spoken": "有名な画家の作品ともなれば、一点で数千万円からするのは普通だ。",
    "expected": "有名な画家の作品ともなれば、一点で数千万円からするのは普通だ。",
    "reading": "ゆうめいながかのさくひんともなれば、いってんで すうせんまんえんからするのはふつうだ。",
    "english": "When it comes to works by famous painters, it's normal for a single piece to cost tens of millions of yen or more.",
    "grammar": "〜からする"
  },
  {
    "spoken": "その難関大学の学部には、毎年千人からの受験生が応募する。",
    "expected": "その難関大学の学部には、毎年千人からの受験生が応募する。",
    "reading": "そのなんかんだいがくのがくぶには、まいとし せんにんからのじゅけんせいがおうぼする。",
    "english": "One thousand or more students apply to that highly competitive university faculty every year.",
    "grammar": "〜からの"
  },
  {
    "spoken": "動物園で見た象は、５トンからある巨体だった。",
    "expected": "動物園で見た象は、５トンからある巨体だった。",
    "reading": "どうぶつえんでみたぞうは、ごとんからあるきょたいだった。",
    "english": "The elephant I saw at the zoo had a huge body weighing 5 tons or more.",
    "grammar": "〜からある"
  },
  {
    "spoken": "その結果は明らかだから、改めて説明するまでもないでしょう。",
    "expected": "その結果は明らかだから、改めて説明するまでもないでしょう。",
    "reading": "そのけっかはおきらかだから、あらためてせつめいするまでもないでしょう。",
    "english": "The result is obvious, so there's probably no need to explain it again.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "この程度の雨なら、傘をさすまでもない。",
    "expected": "この程度の雨なら、傘をさすまでもない。",
    "reading": "このていどのあめなら、かさをさすまでもない。",
    "english": "With this little rain, there's no need to even use an umbrella.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "言うまでもないことですが、健康が第一です。",
    "expected": "言うまでもないことですが、健康が第一です。",
    "reading": "いうまでもないことですが、けんこうがだいいちです。",
    "english": "It goes without saying, but health is the most important thing.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "わざわざ図書館へ行くまでもなく、インターネットで多くの情報は得られます。",
    "expected": "わざわざ図書館へ行くまでもなく、インターネットで多くの情報は得られます。",
    "reading": "わざわざとしょかんへいくまでもなく、いんたーねっとでおおくのじょうほうはえられます。",
    "english": "Without needing to go all the way to the library, a lot of information can be obtained online.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "子供でもわかるような簡単な問題だから、ヒントを与えるまでもない。",
    "expected": "子供でもわかるような簡単な問題だから、ヒントを与えるまでもない。",
    "reading": "こどもでもわかるようなかんたんなもんだいだから、ひんとをあたえるまでもない。",
    "english": "It's such a simple problem that even a child could understand, so there's no need to give hints.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "彼の日本語能力は非常に高いので、通訳を頼むまでもないだろう。",
    "expected": "彼の日本語能力は非常に高いので、通訳を頼むまでもないだろう。",
    "reading": "かれのにほんごのうりょくはひじょうにたかいので、つうやくをたのむまでもないだろう。",
    "english": "His Japanese proficiency is extremely high, so there's probably no need to ask for an interpreter.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "ちょっとした切り傷だから、病院に行くまでもないよ。",
    "expected": "ちょっとした切り傷だから、病院に行くまでもないよ。",
    "reading": "ちょっとしたきりきずだから、びょういんにいくまでもないよ。",
    "english": "It's just a small cut, so there's no need to go to the hospital.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "会議の決定事項については、改めてメールで確認するまでもないと思います。",
    "expected": "会議の決定事項については、改めてメールで確認するまでもないと思います。",
    "reading": "かいぎのけっていじこうについては、あらためてめーるでかくにんするまでもないとおもいます。",
    "english": "Regarding the decisions made in the meeting, I don't think there's a need to confirm them again by email.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "あの店の評判は誰もが知っているので、推薦するまでもない。",
    "expected": "あの店の評判は誰もが知っているので、推薦するまでもない。",
    "reading": "あのみせのひょうばんはだれもしっているので、すいせんするまでもない。",
    "english": "Everyone knows that shop's reputation, so there's no need to recommend it.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "操作方法は非常に直感的で、説明書を読むまでもない。",
    "expected": "操作方法は非常に直感的で、説明書を読むまでもない。",
    "reading": "そうさほうほうはひじょうにちょっかんてきで、せつめいしょをよむまでもない。",
    "english": "The operation method is very intuitive, so there's no need to read the manual.",
    "grammar": "〜までもない"
  },
  {
    "spoken": "終電に乗り遅れたら、歩いて帰るまでだ。",
    "expected": "終電に乗り遅れたら、歩いて帰るまでだ。",
    "reading": "しゅうでんにおくれたら、あるいてかえるまでだ。",
    "english": "If I miss the last train, I'll just walk home.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "誰も協力してくれないなら、一人でやるまでのことだ。",
    "expected": "誰も協力してくれないなら、一人でやるまでのことだ。",
    "reading": "だれもきょうりょくしてくれないなら、ひとりでやるまでのことだ。",
    "english": "If no one will cooperate, I'll just do it myself.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "特に深い意味はありません。ちょっと気になったから聞いてみたまでです。",
    "expected": "特に深い意味はありません。ちょっと気になったから聞いてみたまでです。",
    "reading": "とくにふかいいみはありません。ちょっときになったからきいてみたまです。",
    "english": "There's no deep meaning. I just asked because I was a little curious, that's all.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "このプロジェクトが失敗したら、責任を取って辞職するまでだ。",
    "expected": "このプロジェクトが失敗したら、責任を取って辞職するまでだ。",
    "reading": "このぷろじぇくとがしっぱいしたら、せきにんをとってじしょくするまでだ。",
    "english": "If this project fails, I'll just take responsibility and resign.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "手伝ったと言っても、荷物を少し運んだまでのことです。",
    "expected": "手伝ったと言っても、荷物を少し運んだまでのことです。",
    "reading": "てつだったといっても、にもつをすこしはこんだまでのことです。",
    "english": "Even though I said I helped, I just carried a little luggage, that's all.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "どうしても必要なら、貯金を切り崩して買うまでだ。",
    "expected": "どうしても必要なら、貯金を切り崩して買うまでだ。",
    "reading": "どうしてもひつようなら、ちょきんをきりくずしてかうまでだ。",
    "english": "If it's absolutely necessary, I'll just dip into my savings and buy it.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "謝罪したのは、形式的な手続きを踏んだまでで、本心からではありません。",
    "expected": "謝罪したのは、形式的な手続きを踏んだまでで、本心からではありません。",
    "reading": "しゃざいしたのは、けいしきてきなてつづきをふんだまでで、ほんしんからではありません。",
    "english": "I apologized merely as a formality; it wasn't from the heart.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "いくら反対されても、自分の信念を貫き通すまでだ。",
    "expected": "いくら反対されても、自分の信念を貫き通すまでだ。",
    "reading": "いくらはんたいされても、じぶんのしんねんをつらぬきとおすまでだ。",
    "english": "No matter how much opposition I face, I will just stick to my beliefs.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "彼にアドバイスしたのは、親切心からというより、自分の経験を話したまでですよ。",
    "expected": "彼にアドバイスしたのは、親切心からというより、自分の経験を話したまでですよ。",
    "reading": "かれにあどばいすしたのは、しんせつしんからというより、じぶんのけいけんをはなしたまでですよ。",
    "english": "Giving him advice wasn't so much out of kindness, I just shared my own experience, that's all.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "チャンスが来ないなら、自分でチャンスを作り出すまでだ。",
    "expected": "チャンスが来ないなら、自分でチャンスを作り出すまでだ。",
    "reading": "ちゃんすがこないなら、じぶんでちゃんすをつくりだすまでだ。",
    "english": "If opportunity doesn't knock, I'll just build a door myself.",
    "grammar": "〜までだ・〜までのことだ"
  },
  {
    "spoken": "いくら高価な骨董品でも、壊れてしまえばそれまでだ。",
    "expected": "いくら高価な骨董品でも、壊れてしまえばそれまでだ。",
    "reading": "いくらこうかなこっとうひんでも、こわれてしまえばそれまでだ。",
    "english": "No matter how expensive the antique is, if it breaks, that's the end of it.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "人間、死んでしまえばそれまでだ。生きているうちにやりたいことをやろう。",
    "expected": "人間、死んでしまえばそれまでだ。生きているうちにやりたいことをやろう。",
    "reading": "にんげん、しんでしまえばそれまでだ。いきているうちにやりたいことをやろう。",
    "english": "Once a person dies, it's all over. Let's do what we want while we're alive.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "どんなに完璧な計画を立てても、実行する前に状況が変わればそれまでだ。",
    "expected": "どんなに完璧な計画を立てても、実行する前に状況が変わればそれまでだ。",
    "reading": "どんなにかんぺきなけいかくをたてても、じっこうするまえにじょうきょうがかわればそれまでだ。",
    "english": "No matter how perfect the plan you make, if the situation changes before you execute it, it's all for nothing.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "貴重なデータも、バックアップを取っていなければ、コンピューターが故障すればそれまでだ。",
    "expected": "貴重なデータも、バックアップを取っていなければ、コンピューターが故障すればそれまでだ。",
    "reading": "きちょうなでーたも、ばっくあっぷをとっていなければ、こんぴゅーたーがこしょうすればそれまでだ。",
    "english": "Even valuable data, if not backed up, is lost forever if the computer breaks down.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "いくら才能があっても、努力を怠ってチャンスを逃せばそれまでだ。",
    "expected": "いくら才能があっても、努力を怠ってチャンスを逃せばそれまでだ。",
    "reading": "いくらさいのうがあっても、どりょくをおこたってちゃんすをのがせばそれまでだ。",
    "english": "No matter how talented you are, if you neglect to work hard and miss your chance, it's all over.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "長年築き上げてきた信頼関係も、一度裏切ってしまえばそれまでだ。",
    "expected": "長年築き上げてきた信頼関係も、一度裏切ってしまえばそれまでだ。",
    "reading": "ながねんきずきあげてきたしんらいかんけいも、いちどうらぎってしまえばそれまでだ。",
    "english": "Even a relationship of trust built over many years is ruined if betrayed just once.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "デジタル時代の今、紙の書類は火事で燃えてしまえばそれまでだというリスクがある。",
    "expected": "デジタル時代の今、紙の書類は火事で燃えてしまえばそれまでだというリスクがある。",
    "reading": "でじたるじだいのいま、かみのしょるいはかじでもえてしまえばそれまでだというりすくがある。",
    "english": "In this digital age, there's the risk that paper documents are lost forever if they burn in a fire.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "どんなに愛し合っていても、心が離れてしまえばそれまでだ。",
    "expected": "どんなに愛し合っていても、心が離れてしまえばそれまでだ。",
    "reading": "どんなにあいしあっていても、こころがはなれてしまえばそれまでだ。",
    "english": "No matter how much they love each other, if their hearts grow apart, it's over.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "苦労して手に入れた資格も、活かす機会がなければそれまでだ。",
    "expected": "苦労して手に入れた資格も、活かす機会がなければそれまでだ。",
    "reading": "くろうしててにいれたしかくも、いかすきかいがなければそれまでだ。",
    "english": "Even qualifications obtained through hard work are meaningless if there's no opportunity to use them.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "いくら貯金しても、ハイパーインフレが起こればそれまでだ。",
    "expected": "いくら貯金しても、ハイパーインフレが起こればそれまでだ。",
    "reading": "いくらちょきんしても、はいぱーいんふれがおこればそれまでだ。",
    "english": "No matter how much you save, if hyperinflation occurs, it's all worthless.",
    "grammar": "〜ばそれまでだ"
  },
  {
    "spoken": "彼が少し遅刻したからといって、そこまで怒るには当たらない。",
    "expected": "彼が少し遅刻したからといって、そこまで怒るには当たらない。",
    "reading": "かれがすこしちこくしたからといって、そこまでおこるにはあたらない。",
    "english": "Just because he was a little late, it's not worth getting that angry.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "小さな失敗をいつまでも気にするには当たりませんよ。",
    "expected": "小さな失敗をいつまでも気にするには当たりませんよ。",
    "reading": "ちいさなしっぱいをいつまでもきにするにはあたりませんよ。",
    "english": "It's not worth worrying forever about a small mistake.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "賞賛には当たらない。当然のことをしたまでです。",
    "expected": "賞賛には当たらない。当然のことをしたまでです。",
    "reading": "しょうさんにはあたらない。とうぜんのことをしたまでです。",
    "english": "It's not worthy of praise. I just did what was expected.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "ただの噂に過ぎないのだから、一々反論するには当たらない。",
    "expected": "ただの噂に過ぎないのだから、一々反論するには当たらない。",
    "reading": "ただのうわさにすぎないのだから、いちいちはんろんするにはあたらない。",
    "english": "Since it's just a rumor, it's not worth refuting every single point.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "彼の意見は少数派だが、全く無視するには当たらないだろう。",
    "expected": "彼の意見は少数派だが、全く無視するには当たらないだろう。",
    "reading": "かれのいけんはしょうすうはだが、まったくむしするにはあたらないだろう。",
    "english": "His opinion is in the minority, but it probably isn't appropriate to ignore it completely.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "子供のいたずらを大げさに非難するには当たりません。",
    "expected": "子供のいたずらを大げさに非難するには当たりません。",
    "reading": "こどものいたずらをおおげさにひなんするにはあたりません。",
    "english": "It's not appropriate to excessively criticize a child's mischief.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "その程度の金額で、感謝するには当たりませんよ。",
    "expected": "その程度の金額で、感謝するには当たりませんよ。",
    "reading": "そのていどのきんがくで、かんしゃするにはあたりませんよ。",
    "english": "For that small amount of money, it's not really worth thanking me.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "一度断られたからといって、すぐに諦めるには当たらない。",
    "expected": "一度断られたからといって、すぐに諦めるには当たらない。",
    "reading": "いちどことわられたからといって、すぐにあきらめるにはあたらない。",
    "english": "Just because you were rejected once, it's not worth giving up immediately.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "文化の違いから生じる誤解で、相手を責めるには当たらない。",
    "expected": "文化の違いから生じる誤解で、相手を責めるには当たらない。",
    "reading": "ぶんかのちがいからしょうじるごかいで、あいてをせめるにはあたらない。",
    "english": "It's not appropriate to blame the other person for misunderstandings arising from cultural differences.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "彼らはプロなのだから、このくらいのパフォーマンスは驚くには当たらない。",
    "expected": "彼らはプロなのだから、このくらいのパフォーマンスは驚くには当たらない。",
    "reading": "かれらはぷろなのだから、このくらいのぱふぉーまんすはおどろくにはあたらない。",
    "english": "They are professionals, so this level of performance is not surprising.",
    "grammar": "〜には当たらない"
  },
  {
    "spoken": "これほど美しい夕焼けは、芸術でなくてなんだろうか。",
    "expected": "これほど美しい夕焼けは、芸術でなくてなんだろうか。",
    "reading": "これほどうつくしいゆうやけは、げいじゅつでなくてなんだろうか。",
    "english": "Such a beautiful sunset, what could it be if not art?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "彼女の献身的な介護は、愛でなくてなんだろう。",
    "expected": "彼女の献身的な介護は、愛でなくてなんだろう。",
    "reading": "かのじょのけんしんてきなかいごは、あいでなくてなんだろう。",
    "english": "Her devoted caregiving – what could it be but love?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "何の見返りも求めずに他人を助ける行為は、真の優しさでなくてなんだろうか。",
    "expected": "何の見返りも求めずに他人を助ける行為は、真の優しさでなくてなんだろうか。",
    "reading": "なんのみかえりももとめずにたにんをたすけるこういは、しんのやさしさでなくてなんだろうか。",
    "english": "The act of helping others without seeking anything in return – what could it be if not true kindness?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "苦しい時も諦めずに努力を続けることこそ、挑戦でなくてなんだろう。",
    "expected": "苦しい時も諦めずに努力を続けることこそ、挑戦でなくてなんだろう。",
    "reading": "くるしいときもあきらめずにどりょくをつづけることこそ、ちょうせんでなくてなんだろう。",
    "english": "Continuing to strive without giving up even in difficult times – that itself must be a challenge.",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "一目見ただけで恋に落ちてしまう、これこそ運命でなくてなんだろうか。",
    "expected": "一目見ただけで恋に落ちてしまう、これこそ運命でなくてなんだろうか。",
    "reading": "ひとめみただけでこいにおちてしまう、これこそんめいでなくてなんだろうか。",
    "english": "Falling in love at first sight – what could this be if not fate?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "この複雑怪奇な事件の真相を解明するのは、探偵の使命でなくてなんだろう。",
    "expected": "この複雑怪奇な事件の真相を解明するのは、探偵の使命でなくてなんだろう。",
    "reading": "このふくざつかいきなじけんのしんそうをかいめいするのは、たんていのしめいでなくてなんだろう。",
    "english": "Unraveling the truth of this complex and bizarre case – what else could it be but a detective's mission?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "故郷の風景を見るたびに込み上げてくるこの感情は、郷愁でなくてなんだろうか。",
    "expected": "故郷の風景を見るたびに込み上げてくるこの感情は、郷愁でなくてなんだろうか。",
    "reading": "こきょうのふうけいをみるたびにこみあげてくるこのかんじょうは、きょうしゅうでなくてなんだろうか。",
    "english": "This emotion that wells up every time I see the scenery of my hometown – what could it be but nostalgia?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "人生における様々な困難を乗り越える力は、希望でなくてなんだろう。",
    "expected": "人生における様々な困難を乗り越える力は、希望でなくてなんだろう。",
    "reading": "じんせいにおけるさまざまこんなんをのりこえるちからは、きぼうでなくてなんだろう。",
    "english": "The strength to overcome various difficulties in life – what could it be but hope?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "あの政治家の矛盾した言動は、国民への裏切りでなくてなんだろうか。",
    "expected": "あの政治家の矛盾した言動は、国民への裏切りでなくてなんだろうか。",
    "reading": "あのせいじかのむじゅんしたげんどうは、こくみんへのうらぎりでなくてなんだろうか。",
    "english": "That politician's contradictory words and actions – what could they be if not a betrayal of the people?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "長年の研究が実を結び、新しい発見をもたらした。これこそ科学の進歩でなくてなんだろう。",
    "expected": "長年の研究が実を結び、新しい発見をもたらした。これこそ科学の進歩でなくてなんだろう。",
    "reading": "ながねんのけんきゅうがみをむすび、あたらしいはっけんをもたらした。これこそかがくのしんぽでなくてなんだろう。",
    "english": "Years of research bore fruit and brought about a new discovery. What else could this be but scientific progress?",
    "grammar": "〜でなくてなんだろう（か）"
  },
  {
    "spoken": "彼の最新の研究は、学界の注目を集めるに足るものだ。",
    "expected": "彼の最新の研究は、学界の注目を集めるに足るものだ。",
    "reading": "かれのさいしんのけんきゅうは、がっかいのちゅうもくをあつめるにたるものだ。",
    "english": "His latest research is sufficient to attract the attention of the academic world.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "この美術館のコレクションは、わざわざ訪れるに足る価値がある。",
    "expected": "この美術館のコレクションは、わざわざ訪れるに足る価値がある。",
    "reading": "このびじゅつかんのこれくしょんは、わざわざおとずれるにたるかちがある。",
    "english": "This art museum's collection is worthy enough to make a special trip to visit.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "彼女の提案は独創的で、検討するに足るアイデアだ。",
    "expected": "彼女の提案は独創的で、検討するに足るアイデアだ。",
    "reading": "かのじょのていあんはどくそうてきで、けんとうするにたるあいであだ。",
    "english": "Her proposal is original and an idea worthy of consideration.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "信頼に足る人物かどうか、見極める必要がある。",
    "expected": "信頼に足る人物かどうか、見極める必要がある。",
    "reading": "しんらいにたるじんぶつかどうか、みきわめるひつようがある。",
    "english": "It is necessary to determine whether they are a person worthy of trust.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "その古文書は、歴史的資料として参照するに足る重要性を持っている。",
    "expected": "その古文書は、歴史的資料として参照するに足る重要性を持っている。",
    "reading": "そのこもんじょは、れきしてきしりょうとしてさんしょうするにたるじゅうようせいをもっている。",
    "english": "That ancient document has sufficient importance to be referenced as a historical source.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "彼の証言は、事件解決の鍵となるに足るものだった。",
    "expected": "彼の証言は、事件解決の鍵となるに足るものだった。",
    "reading": "かれのしょうげんは、じけんかいけつのかぎとなるにたるものだった。",
    "english": "His testimony was significant enough to become the key to solving the case.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "この程度の困難は、我々の決意を揺るがすに足らない。",
    "expected": "この程度の困難は、我々の決意を揺るがすに足らない。",
    "reading": "このていどのこんなんは、われわれのけついをゆるがすにたらない。",
    "english": "Difficulties of this level are not sufficient to shake our determination.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "その映画は批評家の称賛に足る出来栄えだった。",
    "expected": "その映画は批評家の称賛に足る出来栄えだった。",
    "reading": "そのえいがはひひょうかのしょうさんにたるできばえだった。",
    "english": "The movie was well-made enough to deserve the critics' praise.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "今回の成果は、満足するに足るものではなかった。",
    "expected": "今回の成果は、満足するに足るものではなかった。",
    "reading": "こんかいのせいかは、まんぞくするにたるものではなかった。",
    "english": "The results this time were not sufficient enough to be satisfying.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "彼のリーダーシップは、この難局を乗り切るに足るものと信じている。",
    "expected": "彼のリーダーシップは、この難局を乗り切るに足るものと信じている。",
    "reading": "かれのりーだーしップは、このなんきょくをのりきるにたるものとしんじている。",
    "english": "I believe his leadership is sufficient to overcome this difficult situation.",
    "grammar": "〜に足る"
  },
  {
    "spoken": "彼の演奏は繊細で、聴く人の心に響き、鑑賞に堪えるものだった。",
    "expected": "彼の演奏は繊細で、聴く人の心に響き、鑑賞に堪えるものだった。",
    "reading": "かれのえんそうはせんさいで、きくひとのこころにひびき、かんしょうにたえるものだった。",
    "english": "His performance was delicate, resonated with the listeners' hearts, and was worth appreciating.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "あの画家の作品は、何度見ても見るに堪える深みがある。",
    "expected": "あの画家の作品は、何度見ても見るに堪える深みがある。",
    "reading": "あのがかのさくひんは、なんどみてもみるにたえるふかみがある。",
    "english": "That artist's works have a depth that makes them worth viewing again and again.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "彼の書く評論は、読むに堪える洞察力に満ちている。",
    "expected": "彼の書く評論は、読むに堪える洞察力に満ちている。",
    "reading": "かれのかくひょうろんは、よむにたえるどうさつりょくにみちている。",
    "english": "The critiques he writes are full of insight that makes them worth reading.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "このドキュメンタリー映画は、その衝撃的な内容から、見るに堪えない人もいるだろう。",
    "expected": "このドキュメンタリー映画は、その衝撃的な内容から、見るに堪えない人もいるだろう。",
    "reading": "このどきゅめんたりーえいがは、そのしょうげきてきなないようから、みるにたえないひともいるだろう。",
    "english": "Given its shocking content, some people probably find this documentary unbearable to watch.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "会議での彼の発言は、あまりに的外れで聞くに堪えなかった。",
    "expected": "会議での彼の発言は、あまりに的外れで聞くに堪えなかった。",
    "reading": "かいぎでのかれのはつげんは、あまりにまとはずれできくにたえなかった。",
    "english": "His remarks at the meeting were so off-topic they were unbearable to listen to.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "低俗な内容のテレビ番組は、見るに堪えない。",
    "expected": "低俗な内容のテレビ番組は、見るに堪えない。",
    "reading": "ていぞくないようのてれびばんぐみは、みるにたえない。",
    "english": "TV shows with vulgar content are unwatchable.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "初心者向けの解説書かと思いきや、専門的で読むに堪える内容だった。",
    "expected": "初心者向けの解説書かと思いきや、専門的で読むに堪える内容だった。",
    "reading": "しょしんしゃむけのかいせつしょかとおもいきや、せんもんてきでよむにたえるないようだった。",
    "english": "I thought it was a guidebook for beginners, but surprisingly, it was specialized and worth reading.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "事故現場の惨状は、見るに堪えないものだった。",
    "expected": "事故現場の惨状は、見るに堪えないものだった。",
    "reading": "じこげんばのさんじょうは、みるにたえないものだった。",
    "english": "The disastrous state of the accident scene was unbearable to look at.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "彼の歌声は力強く、人を感動させ、聴くに堪えるものがある。",
    "expected": "彼の歌声は力強く、人を感動させ、聴くに堪えるものがある。",
    "reading": "かれのうたごえはちからづよく、ひとをかんどうさせ、きくにたえるものがある。",
    "english": "His singing voice is powerful, moves people, and is worth listening to.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "その子供のわがままな行動は、周りの大人にとって見るに堪えない光景だった。",
    "expected": "その子供のわがままな行動は、周りの大人にとって見るに堪えない光景だった。",
    "reading": "そのこどものわがままなこうどうは、まわりのおとにとってみるにたえないこうけいだった。",
    "english": "The child's selfish behavior was an unbearable sight for the surrounding adults.",
    "grammar": "〜に堪える、〜に堪えない"
  },
  {
    "spoken": "満天の星空の美しさといったらなかった。",
    "expected": "満天の星空の美しさといったらなかった。",
    "reading": "まんてんのほしぞらのうつくしさといったらなかった。",
    "english": "The beauty of the star-filled sky was beyond description.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "初めての海外旅行で道に迷った時の心細さといったらなかった。",
    "expected": "初めての海外旅行で道に迷った時の心細さといったらなかった。",
    "reading": "はじめてのかいがいりょこうでみちにまよったときのこころぼそさといったらなかった。",
    "english": "The helplessness I felt when I got lost during my first trip abroad was incredible.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "合格発表で自分の番号を見つけたときの喜びようといったらない。",
    "expected": "合格発表で自分の番号を見つけたときの喜びようといったらない。",
    "reading": "ごうかくはっぴょうでじぶんのばんごうをみつけたときのよろこびようといったらない。",
    "english": "The sheer joy when I found my number on the acceptance list was indescribable.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "締め切り前の忙しさといったら、想像を絶するほどだ。",
    "expected": "締め切り前の忙しさといったら、想像を絶するほどだ。",
    "reading": "しめきりまえのいそがしさといったら、そうぞうをぜっするほどだ。",
    "english": "The busyness before the deadline is just incredibly, unimaginably intense.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "山頂から見た雲海の壮大さといったら、言葉では言い表せない。",
    "expected": "山頂から見た雲海の壮大さといったら、言葉では言い表せない。",
    "reading": "さんちょうからみたうんかいのそうだいさといったら、ことばではいいあらわせない。",
    "english": "The magnificence of the sea of clouds seen from the mountain top was simply indescribable.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "彼のプレゼンテーションの分かりやすさといったらなかった。皆が納得していた。",
    "expected": "彼のプレゼンテーションの分かりやすさといったらなかった。皆が納得していた。",
    "reading": "かれのぷれぜんてーしょんのわかりやすさといったらなかった。みながなっとくしていた。",
    "english": "His presentation was incredibly easy to understand. Everyone was convinced.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "真夏の満員電車の蒸し暑さといったら、本当に不快だ。",
    "expected": "真夏の満員電車の蒸し暑さといったら、本当に不快だ。",
    "reading": "まなつのまんいんでんしゃのむしあつさといったら、ほんとうにふかいだ。",
    "english": "The stuffiness of a crowded train in midsummer is just incredibly uncomfortable.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "試合に逆転勝ちした時の興奮といったら、今でも忘れられない。",
    "expected": "試合に逆転勝ちした時の興奮といったら、今でも忘れられない。",
    "reading": "しあいにぎゃくてんがちしたときのこうふんといったら、いまでもわすれられない。",
    "english": "The excitement when we won the game after turning it around was incredible; I still can't forget it.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "あのレストランの料理のおいしさといったら、格別だった。",
    "expected": "あのレストランの料理のおいしさといったら、格別だった。",
    "reading": "あのれすとらんのりょうりのおいしさといったら、かくべつだった。",
    "english": "The deliciousness of the food at that restaurant was absolutely exceptional.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "突然の知らせに驚いたことといったらなかった。",
    "expected": "突然の知らせに驚いたことといったらなかった。",
    "reading": "とつぜんのしらせにおどろいたことといったらなかった。",
    "english": "I was unbelievably surprised by the sudden news.",
    "grammar": "〜といったらない"
  },
  {
    "spoken": "旧友との再会は何年ぶりかで、嬉しいかぎりです。",
    "expected": "旧友との再会は何年ぶりかで、嬉しいかぎりです。",
    "reading": "きゅうゆうとのさいかいはなんねんぶりかで、うれしいかぎりです。",
    "english": "Reuniting with my old friend after so many years makes me feel extremely happy.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "長年の努力が実を結び、感無量のかぎりです。",
    "expected": "長年の努力が実を結び、感無量のかぎりです。",
    "reading": "ながねんのどりょくがみをむすび、かんむりょうのかぎりです。",
    "english": "My years of effort have paid off, and I am overcome with emotion.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "彼の成功を妬むなんて、情けないかぎりだ。",
    "expected": "彼の成功を妬むなんて、情けないかぎりだ。",
    "reading": "かれのせいこうをねたむなんて、なさけないかぎりだ。",
    "english": "Being envious of his success is truly pathetic.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "皆様の温かいご支援に、ただただ感謝のかぎりです。",
    "expected": "皆様の温かいご支援に、ただただ感謝のかぎりです。",
    "reading": "みなさまのあたたかいごしえんに、ただただかんしゃのかぎりです。",
    "english": "I feel nothing but the utmost gratitude for everyone's warm support.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "このような栄誉ある賞をいただき、光栄なかぎりです。",
    "expected": "このような栄誉ある賞をいただき、光栄なかぎりです。",
    "reading": "このようなえいよあるしょうをいただき、こうえいなかぎりです。",
    "english": "Receiving such a prestigious award is the greatest honor.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "大切な書類を紛失してしまい、残念なかぎりだ。",
    "expected": "大切な書類を紛失してしまい、残念なかぎりだ。",
    "reading": "たいせつなしょるいをふんしつしてしまい、ざんねんなかぎりだ。",
    "english": "Having lost the important documents, I feel extremely regretful.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "若くして才能を発揮している彼が羨ましいかぎりだ。",
    "expected": "若くして才能を発揮している彼が羨ましいかぎりだ。",
    "reading": "わかくしてさいのうをはっきしているかれがうらやましいかぎりだ。",
    "english": "I feel extremely envious of him demonstrating his talent at such a young age.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "無事にプロジェクトを完了できて、心強いかぎりです。",
    "expected": "無事にプロジェクトを完了できて、心強いかぎりです。",
    "reading": "ぶじにぷろじぇくとをかんりょうできて、こころづよいかぎりです。",
    "english": "Being able to complete the project safely is extremely reassuring.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "彼の無責任な発言には、憤りを感じるかぎりだ。",
    "expected": "彼の無責任な発言には、憤りを感じるかぎりだ。",
    "reading": "かれのむせきにんなはつげんには、いきどおりをかんじるかぎりだ。",
    "english": "I feel nothing but indignation towards his irresponsible remarks.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "遠い故郷を思うと、寂しいかぎりです。",
    "expected": "遠い故郷を思うと、寂しいかぎりです。",
    "reading": "とおいふるさとをおもうと、さびしいかぎりです。",
    "english": "When I think of my distant hometown, I feel extremely lonely.",
    "grammar": "〜かぎりだ"
  },
  {
    "spoken": "公の場でそのような発言をするとは、非常識極まる。",
    "expected": "公の場でそのような発言をするとは、非常識極まる。",
    "reading": "おおやけのばでそのようなはつげんをするとは、ひじょうしききわまる。",
    "english": "Making such remarks in public is the height of absurdity.",
    "grammar": "〜極まる"
  },
  {
    "spoken": "彼の態度は、失礼極まりないものだった。",
    "expected": "彼の態度は、失礼極まりないものだった。",
    "reading": "かれのたいどは、しつれいきわまりないものだった。",
    "english": "His attitude was extremely rude.",
    "grammar": "〜極まりない"
  },
  {
    "spoken": "贅沢極まる生活を送っている彼らは、庶民の苦しみなど理解できないだろう。",
    "expected": "贅沢極まる生活を送っている彼らは、庶民の苦しみなど理解できないだろう。",
    "reading": "ぜいたくきわまるせいかつをおくっているかれらは、しょみんのくるしみなどりかいできないだろう。",
    "english": "Living an extremely luxurious life, they probably cannot understand the struggles of ordinary people.",
    "grammar": "〜極まる"
  },
  {
    "spoken": "彼の提案は現実離れしており、愚か極まりない。",
    "expected": "彼の提案は現実離れしており、愚か極まりない。",
    "reading": "かれのていあんはげんじつばなれしており、おろかきわまりない。",
    "english": "His proposal is detached from reality and utterly foolish.",
    "grammar": "〜極まりない"
  },
  {
    "spoken": "危険極まる行為を平気でする若者たちに、将来が案じられる。",
    "expected": "危険極まる行為を平気でする若者たちに、将来が案じられる。",
    "reading": "きけんきわまるこういをへいきでするわかものたちに、しょうらいがあんじられる。",
    "english": "I worry about the future of young people who casually engage in extremely dangerous acts.",
    "grammar": "〜極まる"
  },
  {
    "spoken": "あの政治家の汚職事件は、不快極まりない。",
    "expected": "あの政治家の汚職事件は、不快極まりない。",
    "reading": "あのせいじかのおしょくじけんは、ふかいきわまりない。",
    "english": "That politician's corruption scandal is extremely unpleasant.",
    "grammar": "〜極まりない"
  },
  {
    "spoken": "こんな単純なミスをするなんて、怠慢極まる。",
    "expected": "こんな単純なミスをするなんて、怠慢極まる。",
    "reading": "こんなたんじゅんなみすをするなんて、たいまんきわまる。",
    "english": "Making such a simple mistake is the height of negligence.",
    "grammar": "〜極まる"
  },
  {
    "spoken": "彼の自己中心的な行動には、退屈極まりない。",
    "expected": "彼の自己中心的な行動には、退屈極まりない。",
    "reading": "かれのじこちゅうしんてきなこうどうには、たいくつきわまりない。",
    "english": "His self-centered behavior is utterly tedious.",
    "grammar": "〜極まりない"
  },
  {
    "spoken": "感極まって、涙が止まらなかった。",
    "expected": "感極まって、涙が止まらなかった。",
    "reading": "かんきわまって、なみだがとまらなかった。",
    "english": "Overcome with emotion, I couldn't stop crying. (Note: This is a related fixed expression, using the kanji)",
    "grammar": "〜極まる"
  },
  {
    "spoken": "彼の説明は曖昧極まりなく、全く理解できなかった。",
    "expected": "彼の説明は曖昧極まりなく、全く理解できなかった。",
    "reading": "かれのせつめいはあいまいきわまりなく、まったく理解できなかった。",
    "english": "His explanation was extremely ambiguous, and I couldn't understand it at all.",
    "grammar": "〜極まりない"
  },
  {
    "spoken": "彼が社長に抜擢されるとは、誰も予想していなかった。",
    "expected": "彼が社長に抜擢されるとは、誰も予想していなかった。",
    "reading": "かれがしゃちょうにばってきされるとは、だれもよそうしていなかった。",
    "english": "To think he would be chosen as president! Nobody expected that.",
    "grammar": "〜とは"
  },
  {
    "spoken": "まさか自分が宝くじに当選するとは、夢にも思わなかった。",
    "expected": "まさか自分が宝くじに当選するとは、夢にも思わなかった。",
    "reading": "まさかじぶんがたからくじにとうせんするとは、ゆめにもおもわなかった。",
    "english": "To think I would actually win the lottery! I never even dreamed of it.",
    "grammar": "〜とは"
  },
  {
    "spoken": "あの温厚な彼があんなに怒るなんて、一体何があったのとは。",
    "expected": "あの温厚な彼があんなに怒るなんて、一体何があったのとは。",
    "reading": "あのおんこうなかれがあんなにおこるなんて、いったいなにがあったのとは。",
    "english": "For that good-natured person to get so angry! I wonder what on earth happened.",
    "grammar": "〜とは"
  },
  {
    "spoken": "わずか10歳でこの難問を解くとは、まさに神童だ。",
    "expected": "わずか10歳でこの難問を解くとは、まさに神童だ。",
    "reading": "わずかじゅっさいでこのなんもんをとくとは、まさにしんどうだ。",
    "english": "Solving this difficult problem at only 10 years old! He's truly a child prodigy.",
    "grammar": "〜とは"
  },
  {
    "spoken": "親友に裏切られるとは、信じられない。",
    "expected": "親友に裏切られるとは、信じられない。",
    "reading": "しんゆうにうらぎられるとは、しんじられない。",
    "english": "To be betrayed by my best friend! It's unbelievable.",
    "grammar": "〜とは"
  },
  {
    "spoken": "こんな美しい景色が存在するとは、驚きだ。",
    "expected": "こんな美しい景色が存在するとは、驚きだ。",
    "reading": "こんなうつくしいけしきがそんざいするとは、おどろきだ。",
    "english": "To think such beautiful scenery exists! It's amazing.",
    "grammar": "〜とは"
  },
  {
    "spoken": "一度も練習せずに本番で成功するとは、彼の才能は計り知れない。",
    "expected": "一度も練習せずに本番で成功するとは、彼の才能は計り知れない。",
    "reading": "いちどもれんしゅうせずにほんばんでせいこうするとは、かれのさいのうははかりしれない。",
    "english": "Succeeding in the actual performance without practicing even once! His talent is immeasurable.",
    "grammar": "〜とは"
  },
  {
    "spoken": "この年になって新しい言語を学ぶとは、我ながら感心する。",
    "expected": "この年になって新しい言語を学ぶとは、我ながら感心する。",
    "reading": "このとしになってあたらしいげんごをまなぶとは、われながらかんしんする。",
    "english": "To be learning a new language at this age! I must say I'm impressed with myself.",
    "grammar": "〜とは"
  },
  {
    "spoken": "約束の時間に連絡もなしに来ないとは、どういうつもりだろう。",
    "expected": "約束の時間に連絡もなしに来ないとは、どういうつもりだろう。",
    "reading": "やくそくのじかんにれんらくもなしにこないとは、どういうつもりだろう。",
    "english": "Not showing up at the promised time without any contact! What could they be thinking?",
    "grammar": "〜とは"
  },
  {
    "spoken": "砂漠の真ん中にこんな巨大な都市があるとは、想像もつかなかった。",
    "expected": "砂漠の真ん中にこんな巨大な都市があるとは、想像もつかなかった。",
    "reading": "さばくのまんなかにこんなきょだいなとしがあるとは、そうぞうもつかなかった。",
    "english": "To think there's such a huge city in the middle of the desert! I couldn't have imagined it.",
    "grammar": "〜とは"
  },
  {
    "spoken": "卒業生の皆さんの輝かしい未来を願ってやみません。",
    "expected": "卒業生の皆さんの輝かしい未来を願ってやみません。",
    "reading": "そつぎょうせいのみなさんのかがやかしいみらいをねがってやみません。",
    "english": "I sincerely hope for a bright future for all the graduates.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "遠く離れた故郷の家族の健康を案じてやみません。",
    "expected": "遠く離れた故郷の家族の健康を案じてやみません。",
    "reading": "とおくはなれたこきょうのかぞくのけんこうをあんじてやみません。",
    "english": "I constantly worry about the health of my family in my distant hometown.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "一日も早い被災地の復興を祈ってやみません。",
    "expected": "一日も早い被災地の復興を祈ってやみません。",
    "reading": "いちにちもはやいひさいちのふっこうをいのってやみません。",
    "english": "I pray endlessly for the earliest possible recovery of the disaster-stricken area.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "長年にわたりご指導いただいた先生を尊敬してやみません。",
    "expected": "長年にわたりご指導いただいた先生を尊敬してやみません。",
    "reading": "ながねんにわたりごしどういただいたせんせいをそんけいしてやみません。",
    "english": "I have unending respect for the teacher who guided me for many years.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "亡くなった友人の冥福を心から祈ってやみません。",
    "expected": "亡くなった友人の冥福を心から祈ってやみません。",
    "reading": "なくなったゆうじんのめいふくをこころからいのってやみません。",
    "english": "I sincerely and constantly pray for the repose of my deceased friend's soul.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "子供たちの健やかな成長を願ってやまない親心。",
    "expected": "子供たちの健やかな成長を願ってやまない親心。",
    "reading": "こどもたちのすこやかなせいちょうをねがってやまないおやごころ。",
    "english": "A parent's heart endlessly wishes for their children's healthy growth.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "世界中の人々が平和に暮らせる日を切望してやみません。",
    "expected": "世界中の人々が平和に暮らせる日を切望してやみません。",
    "reading": "せかいじゅうのひとびとがへいわにくらせるひをせつぼうしてやみません。",
    "english": "I earnestly and constantly long for the day when people all over the world can live in peace.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "彼の才能が開花する日を期待してやまない。",
    "expected": "彼の才能が開花する日を期待してやまない。",
    "reading": "かれのさいのうがかいかするひをきたいしてやまない。",
    "english": "I have unwavering expectations for the day his talent will blossom.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "困難な状況にある人々への支援の必要性を感じてやみません。",
    "expected": "困難な状況にある人々への支援の必要性を感じてやみません。",
    "reading": "こんなんなじょうきょうにあるひとびとへのしえんのひつようせいをかんじてやみません。",
    "english": "I constantly feel the necessity of support for people in difficult situations.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "青春時代の淡い恋の思い出を懐かしんでやまない。",
    "expected": "青春時代の淡い恋の思い出を懐かしんでやまない。",
    "reading": "せいしゅんじだいのあわいこいのおもいでをなつかしんでやまない。",
    "english": "I endlessly feel nostalgic about the memories of a faint love from my youth.",
    "grammar": "〜てやまない"
  },
  {
    "spoken": "彼の長年にわたる会社への貢献には、感謝の念に堪えません。",
    "expected": "彼の長年にわたる会社への貢献には、感謝の念に堪えません。",
    "reading": "かれのながねんにわたるかいしゃへのこうけんには、かんしゃのねんにたえません。",
    "english": "I am overwhelmed with gratitude for his many years of contribution to the company.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "その悲惨な事故の報道に接し、哀惜の念に堪えなかった。",
    "expected": "その悲惨な事故の報道に接し、哀惜の念に堪えなかった。",
    "reading": "そのひさんなじこのほうどうにせっし、あいせきのねんにたえなかった。",
    "english": "Upon hearing the news of that tragic accident, I was overcome with sorrow.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "皆様からの温かい励ましのお言葉、感激に堪えません。",
    "expected": "皆様からの温かい励ましのお言葉、感激に堪えません。",
    "reading": "みなさまからのあたたかいはげましのおことば、かんげきにたえません。",
    "english": "I am deeply moved beyond words by everyone's warm words of encouragement.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "彼のあまりに無礼な態度には、憤慨に堪えなかった。",
    "expected": "彼のあまりに無礼な態度には、憤慨に堪えなかった。",
    "reading": "かれのあまりにぶれいなたいどには、ふんがいにたえなかった。",
    "english": "I couldn't bear my indignation at his extremely rude attitude.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "このような盛大な歓迎を受け、光栄の至りに堪えません。",
    "expected": "このような盛大な歓迎を受け、光栄の至りに堪えません。",
    "reading": "このようなせいだいなかんげいをうけ、こうえいのいたりにたえません。",
    "english": "Receiving such a grand welcome, I am overwhelmed with honor.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "あの画家の描く子供たちの表情は、見る者の心に深く、同情の念に堪えない。",
    "expected": "あの画家の描く子供たちの表情は、見る者の心に深く、同情の念に堪えない。",
    "reading": "あのがかのかくこどもたちのひょうじょうは、みるもののこころにふかく、どうじょうのねんにたえない。",
    "english": "The expressions of the children drawn by that artist deeply touch the viewer's heart, evoking unbearable sympathy.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "彼のスピーチは聴衆の心を打ち、感動に堪えないものだった。",
    "expected": "彼のスピーチは聴衆の心を打ち、感動に堪えないものだった。",
    "reading": "かれのすぴーちはちょうしゅうのこころをうち、かんどうにたえないものだった。",
    "english": "His speech struck a chord with the audience and was unbearably moving.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "汚職事件の真相を知り、政治家への不信感に堪えなくなった。",
    "expected": "汚職事件の真相を知り、政治家への不信感に堪えなくなった。",
    "reading": "おしょくじけんのしんそうをしり、せいじかへのふしんかんにたえなくなった。",
    "english": "Learning the truth of the corruption scandal, my distrust towards politicians became unbearable.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "大失敗をしてしまい、自己嫌悪の念に堪えない。",
    "expected": "大失敗をしてしまい、自己嫌悪の念に堪えない。",
    "reading": "だいしっぱいをしてしまい、じこけんおのねんにたえない。",
    "english": "Having made a huge mistake, I am overwhelmed with self-loathing.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "展覧会で見たその絵の美しさは、実に感嘆に堪えないものだった。",
    "expected": "展覧会で見たその絵の美しさは、実に感嘆に堪えないものだった。",
    "reading": "てんらんかいでみたそのえのうつくしさは、じつにかんたんにたえないものだった。",
    "english": "The beauty of the painting I saw at the exhibition was truly something that evoked unbearable admiration.",
    "grammar": "〜に堪えない"
  },
  {
    "spoken": "多大なご迷惑をおかけした以上、謝罪しないではすまないだろう。",
    "expected": "多大なご迷惑をおかけした以上、謝罪しないではすまないだろう。",
    "reading": "ただいなごめいわくをおかけしたいじょう、しゃざいしないではすまないだろう。",
    "english": "Having caused so much trouble, I will inevitably have to apologize.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "規則を破ったのだから、何らかの処分を受けないではすまない。",
    "expected": "規則を破ったのだから、何らかの処分を受けないではすまない。",
    "reading": "きそくをやぶったのだから、なんらかのしょぶんをうけないではすまない。",
    "english": "Since I broke the rules, I can't avoid receiving some kind of punishment.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "これだけ大きなミスを犯したのだ。責任を取らずにはすまない。",
    "expected": "これだけ大きなミスを犯したのだ。責任を取らずにはすまない。",
    "reading": "これだけおおきなみすをおかしたのだ。せきにんをとらずにはすまない。",
    "english": "I made such a big mistake. I have no choice but to take responsibility.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "事故を目撃したからには、警察に状況を説明せずにはすまない。",
    "expected": "事故を目撃したからには、警察に状況を説明せずにはすまない。",
    "reading": "じこをもくげきしたからには、けいさつにじょうきょうをせつめいせずにはすまない。",
    "english": "Having witnessed the accident, I must explain the situation to the police.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "借りたお金は、約束の期日までに返さないではすまない。",
    "expected": "借りたお金は、約束の期日までに返さないではすまない。",
    "reading": "かりたおかねは、やくそくのきじつまでにえさないではすまない。",
    "english": "Borrowed money must be returned by the promised date.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "部長の命令とあれば、この仕事を引き受けないではすまない。",
    "expected": "部長の命令とあれば、この仕事を引き受けないではすまない。",
    "reading": "ぶちょうのめいれいとあれば、このしごとをひきうけないではすまない。",
    "english": "If it's an order from the department manager, I have no choice but to accept this job.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "結婚式に招待されたのだから、出席せずにはすまないだろう。",
    "expected": "結婚式に招待されたのだから、出席せずにはすまないだろう。",
    "reading": "けっこんしきにしょうたいされたのだから、しゅっせきせずにはすまないだろう。",
    "english": "Since I was invited to the wedding, I suppose I must attend.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "この状況を改善するためには、抜本的な改革を行わないではすまない。",
    "expected": "この状況を改善するためには、抜本的な改革を行わないではすまない。",
    "reading": "このじょうきょうをかいぜんするためには、ばっぽんてきなかいかくをおこなわないではすまない。",
    "english": "To improve this situation, carrying out fundamental reforms is unavoidable.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "環境問題は、もはや無視しないではすまない段階に来ている。",
    "expected": "環境問題は、もはや無視しないではすまない段階に来ている。",
    "reading": "かんきょうもんだいは、もはやむししないではすまないだんかいにきている。",
    "english": "Environmental problems have reached a stage where they can no longer be ignored.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "人前で恥をかかされたのだから、一言文句を言わずにはすまなかった。",
    "expected": "人前で恥をかかされたのだから、一言文句を言わずにはすまなかった。",
    "reading": "ひとまえではじをかかされたのだから、ひとこともんくをいわずにはすまなかった。",
    "english": "Having been embarrassed in public, I couldn't help but complain.",
    "grammar": "〜ないではすまない・〜ずにはすまない"
  },
  {
    "spoken": "彼の不正を知った以上、告発しないではおかない。",
    "expected": "彼の不正を知った以上、告発しないではおかない。",
    "reading": "かれのふせいをしったいじょう、こくはつしないではおかない。",
    "english": "Now that I know about his wrongdoing, I will definitely report him.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "こんな理不尽な要求は、絶対に認めないではおかないぞ。",
    "expected": "こんな理不尽な要求は、絶対に認めないではおかないぞ。",
    "reading": "こんなりふじんなようきゅうは、ぜったいにみとめないではおかないぞ。",
    "english": "I will never ever accept such an unreasonable demand.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "あの感動的な映画は、見る人の涙を誘わずにはおかないだろう。",
    "expected": "あの感動的な映画は、見る人の涙を誘わずにはおかないだろう。",
    "reading": "あのかんどうてきなえいがは、みるひとのなみだをさそわずにはおかないだろう。",
    "english": "That moving film will inevitably bring viewers to tears.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "子供の好奇心は、未知の世界を探求せずにはおかない。",
    "expected": "子供の好奇心は、未知の世界を探求せずにはおかない。",
    "reading": "こどものこうきしんは、みちのせかいをたんきゅうせずにはおかない。",
    "english": "A child's curiosity inevitably drives them to explore the unknown world.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "彼のユーモアあふれる話は、いつも周りの人を笑わせないではおかない。",
    "expected": "彼のユーモアあふれる話は、いつも周りの人を笑わせないではおかない。",
    "reading": "かれのゆーもあふれるはなしは、いつもまわりのひとをわらわせないではおかない。",
    "english": "His humorous stories always inevitably make everyone around him laugh.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "社会の矛盾に対する彼の鋭い指摘は、人々の問題意識を喚起せずにはおかない。",
    "expected": "社会の矛盾に対する彼の鋭い指摘は、人々の問題意識を喚起せずにはおかない。",
    "reading": "しゃかいのむじゅんにたいするかれのするどいしてきは、ひとびとのもんだいいしきをかんきせずにはおかない。",
    "english": "His sharp criticism of social contradictions inevitably raises people's awareness of the issues.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "真実を明らかにすると決めたからには、最後まで追求せずにはおかない。",
    "expected": "真実を明らかにすると決めたからには、最後まで追求せずにはおかない。",
    "reading": "しんじつをあきらかにするときめたからには、さいごまでついきゅうせずにはおかない。",
    "english": "Since I've decided to reveal the truth, I will pursue it relentlessly to the end.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "あの画家の独特な色彩感覚は、見る者を魅了しないではおかない。",
    "expected": "あの画家の独特な色彩感覚は、見る者を魅了しないではおかない。",
    "reading": "あのがかのどくとくなしきさいかんかくは、みるものをみりょうしないではおかない。",
    "english": "That artist's unique sense of color inevitably fascinates viewers.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "彼の隠された才能は、いつか必ず人々を驚かせずにはおかないはずだ。",
    "expected": "彼の隠された才能は、いつか必ず人々を驚かせずにはおかないはずだ。",
    "reading": "かれのかくされたさいのうは、いつかかならずひとびとをおどろかせずにはおかないはずだ。",
    "english": "His hidden talent will surely and inevitably surprise people someday.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "その衝撃的なニュースは、世界中に波紋を広げないではおかなかった。",
    "expected": "その衝撃的なニュースは、世界中に波紋を広げないではおかなかった。",
    "reading": "そのしょうげきてきなニュースは、せかいじゅうにはもんをひろげないではおかなかった。",
    "english": "That shocking news inevitably spread ripples throughout the world.",
    "grammar": "〜ないではおかない・〜ずにはおかない"
  },
  {
    "spoken": "彼の勇敢な行動には、称賛の念を禁じ得ない。",
    "expected": "彼の勇敢な行動には、称賛の念を禁じ得ない。",
    "reading": "かれのゆうかんなこうどうには、しょうさんのねんをきんじえない。",
    "english": "I cannot help but admire his courageous actions.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "事故で家族を失った人々の悲しみには、同情を禁じ得ない。",
    "expected": "事故で家族を失った人々の悲しみには、同情を禁じ得ない。",
    "reading": "じこでかぞくをうしなったひとびとのかなしみには、どうじょうをきんじえない。",
    "english": "I can't help but feel sympathy for the sorrow of those who lost their families in the accident.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "彼の突然の裏切りに対して、強い憤りを禁じ得なかった。",
    "expected": "彼の突然の裏切りに対して、強い憤りを禁じ得なかった。",
    "reading": "かれのとつぜんのうらぎりにたいして、つよい憤りをきんじえなかった。",
    "english": "I couldn't suppress my strong indignation towards his sudden betrayal.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "古いアルバムを見て、過ぎ去った日々への郷愁を禁じ得なかった。",
    "expected": "古いアルバムを見て、過ぎ去った日々への郷愁を禁じ得なかった。",
    "reading": "ふるいあるばむをみて、すぎさったひびへのきょうしゅうをきんじえなかった。",
    "english": "Looking at the old album, I couldn't help feeling nostalgic for the days gone by.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "必死に努力する彼の姿に、感動を禁じ得ない。",
    "expected": "必死に努力する彼の姿に、感動を禁じ得ない。",
    "reading": "ひっしにどりょくするかれのすがたに、かんどうをきんじえない。",
    "english": "Seeing him try so hard, I can't help but be moved.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "度重なる失敗に、彼は失望の色を禁じ得なかった。",
    "expected": "度重なる失敗に、彼は失望の色を禁じ得なかった。",
    "reading": "たびかさなるしっぱいに、かれはしつぼうのいろをきんじえなかった。",
    "english": "Faced with repeated failures, he couldn't hide his disappointment.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "その不公平な判決には、多くの人が疑問を禁じ得なかった。",
    "expected": "その不公平な判決には、多くの人が疑問を禁じ得なかった。",
    "reading": "そのふこうへいなはんけつには、おおくのひとがぎもんをきんじえなかった。",
    "english": "Many people couldn't help but question that unfair verdict.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "彼の予期せぬ発言に、会場は失笑を禁じ得なかった。",
    "expected": "彼の予期せぬ発言に、会場は失笑を禁じ得なかった。",
    "reading": "かれのよきせぬはつげんに、かいじょうはしっしょうをきんじえなかった。",
    "english": "The audience couldn't suppress their snickers at his unexpected remark.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "技術の進歩の速さには、驚きを禁じ得ない。",
    "expected": "技術の進歩の速さには、驚きを禁じ得ない。",
    "reading": "ぎじゅつのしんぽのはやさには、おどろきをきんじえない。",
    "english": "I cannot help but be amazed at the speed of technological advancement.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "彼の成功の裏にあった苦労を知り、尊敬の念を禁じ得ない。",
    "expected": "彼の成功の裏にあった苦労を知り、尊敬の念を禁じ得ない。",
    "reading": "かれのせいこうのうらにあったくろうをしり、そんけいのねんをきんじえない。",
    "english": "Learning about the hardships behind his success, I can't help but feel respect.",
    "grammar": "〜を禁じ得ない"
  },
  {
    "spoken": "経営不振のため、支店の閉鎖を余儀なくされた。",
    "expected": "経営不振のため、支店の閉鎖を余儀なくされた。",
    "reading": "けいえいふしんのため、してんのへいさをよぎなくされた。",
    "english": "Due to poor business performance, we were forced to close the branch.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "台風の影響で、旅行計画の大幅な変更を余儀なくされた。",
    "expected": "台風の影響で、旅行計画の大幅な変更を余儀なくされた。",
    "reading": "たいふうのえいきょうで、りょこうけいかくのおおはばなへんこうをよぎなくされた。",
    "english": "Due to the typhoon, I was forced to make significant changes to my travel plans.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "病気のため、彼は長期の休職を余儀なくされた。",
    "expected": "病気のため、彼は長期の休職を余儀なくされた。",
    "reading": "びょうきのため、かれはちょうきのきゅうしょくをよぎなくされた。",
    "english": "Due to illness, he was forced to take a long leave of absence.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "不祥事により、その大臣は辞任を余儀なくされた。",
    "expected": "不祥事により、その大臣は辞任を余儀なくされた。",
    "reading": "ふしょうじにより、そのだいじんはじにんをよぎなくされた。",
    "english": "Due to the scandal, the minister was forced to resign.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "資金不足から、研究の中断を余儀なくされた。",
    "expected": "資金不足から、研究の中断を余儀なくされた。",
    "reading": "しきんぶそくから、けんきゅうのちゅうだんをよぎなくされた。",
    "english": "Due to lack of funding, they were forced to suspend the research.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "予期せぬ事故が、彼に人生設計の見直しを余儀なくさせた。",
    "expected": "予期せぬ事故が、彼に人生設計の見直しを余儀なくさせた。",
    "reading": "よきせぬじこが、かれにじんせいせっけいのみなおしをよぎなくさせた。",
    "english": "The unexpected accident forced him to reconsider his life plans.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "急速なデジタル化の波は、多くの伝統産業に変革を余儀なくさせている。",
    "expected": "急速なデジタル化の波は、多くの伝統産業に変革を余儀なくさせている。",
    "reading": "きゅうそくなでじたるかのみは、おおくのでんとうさんぎょうにへんかくをよぎなくさせている。",
    "english": "The rapid wave of digitalization is forcing many traditional industries to transform.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "大地震は、住民たちに避難所での生活を余儀なくさせた。",
    "expected": "大地震は、住民たちに避難所での生活を余儀なくさせた。",
    "reading": "だいじしんは、じゅうみんたちにひなんじょでのせいかつをよぎなくさせた。",
    "english": "The major earthquake forced the residents into life in evacuation shelters.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "景気後退は、企業にリストラという苦渋の選択を余儀なくさせた。",
    "expected": "景気後退は、企業にリストラという苦渋の選択を余儀なくさせた。",
    "reading": "けいきこうたいは、きぎょうにりすとらというくじゅうのせんたくをよぎなくさせた。",
    "english": "The economic recession forced companies to make the painful decision of restructuring.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  },
  {
    "spoken": "パンデミックは、世界中の人々に生活様式の変更を余儀なくさせた。",
    "expected": "パンデミックは、世界中の人々に生活様式の変更を余儀なくさせた。",
    "reading": "ぱんでみっくは、せかいじゅうのひとびとにせいかつようしきのへんこうをよぎなくさせた。",
    "english": "The pandemic forced people all over the world to change their lifestyles.",
    "grammar": "〜を余儀なくされる、〜を余儀なくさせる"
  }
]